[
 {
  "S_No": 1,
  "Scientific_name": "Acacia auriculiformis",
  "Code": 1,
  "Common_name": "Earleaf acacia",
  "Family_name": "Fabaceae",
  "Kannada_name": "-",
  "Origin": "Australia, Indonesia, Papua New Guinea",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Least concern",
  "Flowering_period": "December - January",
  "Fruiting_period": "February - March",
  "Uses": "Its wood is used for making paper, furniture and tools. It contains tannin which is used in animal hide tanning.",
  "Additional_information": "-",
  "Description": "Medium to large evergeen tree, 15–3- m tall. Leaves alternate, simple, reduced to phyllodes (flattened leaf stalks), these blade-like, slightly curved, 5-8 in long. Flowers in loose, yellow-orange spikes at leaf axils or in clusters of spikes at stem tips; flowers mimosa-like, with numerous free stamens. Fruit a flat, oblong pod, twisted at maturity."
 },
 {
  "S_No": 2,
  "Scientific_name": "Acacia ferruginea",
  "Code": 2,
  "Common_name": "Rusty acacia",
  "Family_name": "Fabaceae",
  "Kannada_name": "Banni mara, Kiri banni",
  "Origin": "India, Sri Lanka",
  "Species type": "Indigenous",
  "Phenology": "Deciduous",
  "Conservation_status": "Vulnerable",
  "Flowering_period": "March - May",
  "Fruiting_period": "June - August",
  "Uses": "A bark decoction, in conjunction with ginger is frequently used as an astringent for the teeth. The wood is mostly used in cartwheels, posts, beams and agricultural implements. ",
  "Additional_information": null,
  "Description": "Medium-sized tree, up to 2-m tall. Leaves are alternately arranged, double-compound, prickles twin, infra-stipular, slightly curved. Flowers are pale yellow in numerous lax axillary spikes, which are often panicled at the end of the branches. Pods glabrous, contain a dry sweetish pulp, dark brown and pinnately dehiscent, 3-7 seeded. Seeds flat ovate, oblong, distinctly stalked, greenish to brown."
 },
 {
  "S_No": 3,
  "Scientific_name": "Adenanthera pavonina",
  "Code": 3,
  "Common_name": "Red bead tree",
  "Family_name": "Fabaceae",
  "Kannada_name": "Aane gulaganji, Manjuti",
  "Origin": "China",
  "Species type": "Exotic",
  "Phenology": "Deciduous",
  "Conservation_status": "Not known",
  "Flowering_period": "March - June",
  "Fruiting_period": "May - August",
  "Uses": "This tree is used for making soap and a red dye can be obtained from the wood. The wood, which is extremely hard, is also used in boat-building, making furniture and for firewood. A decoction of the young leaves and bark is used to treat diarrhoea. Also, the ground seeds are used to treat inflammation.",
  "Additional_information": "The seeds are considered as a symbol of love in China. In India, the seeds have been used as units of weight for fine measures, of gold for instance, throughout recorded history because the seeds are known to be almost identical weights to each other.",
  "Description": "Medium to large deciduous tree, up to 15m tall. Leaves bipinnate, oval-oblong, with an asymmetric base and blunt apex, dull green on topside and blue-green underside. Flowers borne in narrow spike-like racemes at branch ends, small, creamy yellow, fragrant; each flower star shaped with 5 petals. Pods long and narrow, with slight constrictions between seeds, dark brown, turning black upon ripening, leathery, curve and twist upon dehiscence to reveal 8-12 hard-coated, showy, lens shaped, vivid scarlet seeds."
 },
 {
  "S_No": 4,
  "Scientific_name": "Aegle marmelos",
  "Code": 4,
  "Common_name": "Bengal quince, Bael",
  "Family_name": "Rutaceae",
  "Kannada_name": "Bilvapatre",
  "Origin": "India, Bangaldesh, Sri Lanka",
  "Species type": "Indigenous",
  "Phenology": "Deciduous",
  "Conservation_status": "Near threatened",
  "Flowering_period": "April - May",
  "Fruiting_period": "March - June (following year)",
  "Uses": "Its extracts when applied on the exposed area, help to cure inflammation. Its leaf juice with honey can prove useful for treating fever. It can be used to treat tuberculosis.",
  "Additional_information": "The fruits can be eaten either fresh from trees or after being dried and produced into candy, toffee, pulp powder or nectar. If fresh, the juice is strained and sweetened to make a drink similar to lemonade.",
  "Description": "Small to medium sized tree, up to 15m tall. Alternate leaves, borne singly or in 2's or 3's, are composed of 3 to 5 oval, pointed, shallowly toothed leaflets, the terminal one with a long petiole. Fragrant flowers, in clusters of 4 to 7 along the young branchlets, have 4 recurved, fleshy petals, green outside, yellowish inside, and 5- or more greenish-yellow stamens. The fruit, round, pyriform, oval, or oblong, thin, hard, woody shell. Inside, there is a hard central core and 8 to 2- faintly defined triangular segments, with thin, dark-orange walls, filled with aromatic, paleorange, pasty, sweet, resinous, more or less astringent, pulp. Seeds flattened-oblong, bearing woolly hairs and each enclosed in a sac of adhesive, transparent mucilage."
 },
 {
  "S_No": 5,
  "Scientific_name": "Afzelia africana",
  "Code": 5,
  "Common_name": "African Mahogany",
  "Family_name": "Fabaceae",
  "Kannada_name": "-",
  "Origin": "Tropical Africa",
  "Species type": "Exotic",
  "Phenology": "Deciduous",
  "Conservation_status": "Vulnerable",
  "Flowering_period": "April - May",
  "Fruiting_period": "December - February",
  "Uses": "The leaves are used as fodder for livestock. The bark is often used for medicinal purposes in West Africa. The plant is used in traditional medicine, where it is considered to be analgesic, antihaemorrhagic, , emetic, emmenagogue, febrifuge and laxative. The plant is used in local medicine for general pain relief; treating digestive problems such as constipation and vomiting; and for internal bleedings (haemorrhagic).",
  "Additional_information": "It is known for being resistant to decay and termites.",
  "Description": "Medium to large deciduous tree, up to 3-m tall. Leaves bright green, paripinnate, each with 7-17 pairs of\nelliptic or ovate glabrous leaflets. Flowers white to yellowish, with one single red striped petal, set in terminal panicles. Fruit a flat pod, hard, slightly rounded, dark brown to black, glabrous with a distinct beak at one end. Seeds poisonous, with sweet bright orange edible aril in one-third of its length from the base. "
 },
 {
  "S_No": 6,
  "Scientific_name": "Agathis robusta",
  "Code": 6,
  "Common_name": "Queensland kauri, smooth-barked Kauri",
  "Family_name": "Araucariaceae",
  "Kannada_name": "-",
  "Origin": "Australia",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Least concern",
  "Flowering_period": null,
  "Fruiting_period": null,
  "Uses": "The bark yields a resin known as dammar - used for making varnish, lacquers, oil paints, etc. A fibre obtained from the inner bark is used to made ropes and nets. ",
  "Additional_information": null,
  "Description": "Medium to large evergeen coniferous tree, up to 3-m tall. Leaves spirally arranged on primary shoots, opposite to subopposite on lateral shoots, entire on petioles, linear to elliptic, stiff; veins fine, longitudinal, more or less parallel.  Cones globular to cylindric, scales 34--44-. Pollen cones shortly pedunculate or almost sessile, usually axillary on slender leafy twigs, cylindric, bearing 6---13-- microsporophylls, each with 2-8 pollen sacs on the underside. Seeds narrowly cordate, winged."
 },
 {
  "S_No": 7,
  "Scientific_name": "Aglaia elaeagnoidea",
  "Code": 7,
  "Common_name": "Droopy leaf tree",
  "Family_name": "Meliaceae",
  "Kannada_name": "Gadagayya, Kempu nola, Thottilu,",
  "Origin": "Indian Subcontinent, Australia",
  "Species type": "Indigenous",
  "Phenology": "Evergreen",
  "Conservation_status": "Least concern",
  "Flowering_period": "November - August",
  "Fruiting_period": "November - August",
  "Uses": "In Ayurveda, the fruits are reported to be astringent and cooling. They are recommended in the treatment of inflammations and febrile complaints. The seeds are said to be useful in the treatment of painful micturition",
  "Additional_information": null,
  "Description": "Small to medium-sized tree, up to 1- m. Leaves imparipinnate, alternate, estipulate, leaflets elliptic, elliptic-obovate, lanceolate or oblanceolate, base oblique, acute or attenuate, apex acute, acuminate or caudate-acuminate, margin entire. Flowers polygamodioecious, yellow in axillary branching panicles. Fruit a berry, globose, buff coloured; seeds 1-2."
 },
 {
  "S_No": 8,
  "Scientific_name": "Ailanthus triphysa",
  "Code": 8,
  "Common_name": "Malabar Tree of Heaven",
  "Family_name": "Simaroubaceae",
  "Kannada_name": "Baggada dhoopa, Haalumaddi",
  "Origin": "Indian subcontinent, Australia",
  "Species type": "Indigenous",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": "January - May",
  "Fruiting_period": "January -May",
  "Uses": "The bark and leaves are renowned as a tonic, especially in debility after childbirth, they also possess febrifuge properties and are useful in dyspeptic complaints.",
  "Additional_information": null,
  "Description": "Medium to large sized tree, up to 3- m. Leaves imparipinnate, alternate, crowded towards the apex of branches, estipulate, oblong-ovate, oblong-lanceolate or elliptic to lanceolate, base oblique, apex acute or acuminate, margin entire, revolute, glabrous, coriaceous. Flowers polygamous, greenish-yellow, in axillary panicles. Fruit a samara, prominently veined, not twisted, reddish-brown with rounded ends."
 },
 {
  "S_No": 9,
  "Scientific_name": "Alangium salviifolium",
  "Code": 9,
  "Common_name": "Sage-leaved alangium",
  "Family_name": "Cornaceae",
  "Kannada_name": "Guddada goni, Kallu maavina mara",
  "Origin": "Tropical Asia, Tropical Africa",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": "February - April",
  "Fruiting_period": "March - May",
  "Uses": "In Ayurveda the roots and the fruits are used for the treatment of rheumatism and haemorrhoid. Externally, it is used for the treatment of bites by rabbits, rats, and dogs. The root-bark is also used in traditional medicine skin problems and as an antidote for snake bite. The wood is used to make ornamental work, pestles and rollers and also is also used as a fuel wood.",
  "Additional_information": null,
  "Description": "Small, bushy tree, growing up to 1-m. The leaves are elliptic oblong, elliptic lanceolate or oblong lanceolate. The flowers are greenish white, fascilcled, axillary or on old wood. The berries are ovoid, ellipsoid or nearly globose.glabrous, smooth and violet to purple."
 },
 {
  "S_No": 10,
  "Scientific_name": "Albizia julibrissin",
  "Code": 10,
  "Common_name": "Pink silk tree, Persian silk tree ",
  "Family_name": "Fabaceae",
  "Kannada_name": " Chela",
  "Origin": "Southwestern and eastern Asia",
  "Species type": "Exotic",
  "Phenology": "Deciduous",
  "Conservation_status": "Not known",
  "Flowering_period": "April - June",
  "Fruiting_period": "August - September",
  "Uses": "The leaves can be used to treat the effects of stinging nettle by rubbing them in hand and then applying to the rash area. Relief is almost instantaneous.  The flowers and stem bark are used to make medicine. ",
  "Additional_information": null,
  "Description": "Small to medium-sized tree, 6-15m tall. The bark is light brown, nearly smooth, and generally thin with lens shaped areas along the stem. Leaves large, bipinnately compound with 1--35 pairs of leaflets, many oblong leaflets alternate along the stems. Flowers showy, fragrant pink, resembling pompoms and are arranged in panicles at the ends of branches. Fruits are flat, straw-colored pods containing light brown oval-shaped  seeds."
 },
 {
  "S_No": 11,
  "Scientific_name": "Albizia lebbeck",
  "Code": 11,
  "Common_name": "Flea tree, Woman's tongue tree",
  "Family_name": "Fabaceae",
  "Kannada_name": "Baage mara, Sireesa",
  "Origin": "Indomalaya, New Guniea, Northern Australia",
  "Species type": "Exotic",
  "Phenology": "Deciduous",
  "Conservation_status": "Not known",
  "Flowering_period": "April - May",
  "Fruiting_period": "December - January",
  "Uses": "It is an astringent, also used by some cultures to treat boils, cough, to treat the eye, flu, gingivitis, lung problems, pectoral problems, is used as a tonic, and is used to treat abdominal tumors. The bark is used medicinally to treat inflammation.",
  "Additional_information": null,
  "Description": "Medium-sized tree, up to 3-m tall. Compound leaves bipinnate, glabrous or slightly hairy on the axis; pinnae in 2-4 pairs, each with 2-11 pairs of obliquely oblong leaflets, shortly stalked. Flowers are white, heavily scented, with the stamens free above the corolla, stamens 3--4-, yellowish-green on top side, white underside. Pods pale straw to light brown at maturity, narrow-oblong, papery, leathery, flat and not raised or constricted between seeds; seeds brown, flat, orbicular or elliptic, transversely placed with 6- 12 in each pod."
 },
 {
  "S_No": 12,
  "Scientific_name": "Albizia odoratissima",
  "Code": 12,
  "Common_name": "Black Siris",
  "Family_name": "Fabaceae",
  "Kannada_name": "Kaadu baaga, bilvara",
  "Origin": "Indian subcontinent",
  "Species type": "Indigenous",
  "Phenology": "Deciduous",
  "Conservation_status": "Not known",
  "Flowering_period": "March - June",
  "Fruiting_period": "August - October",
  "Uses": "The bark of the tree is useful in ulcers, leprosy, skin diseases, cough, bronchitis, diabetes and burning sensation. The premium quality wood is suitable for paneling and furniture. It is also used for carts, wheels, farm implements and construction timbers. The tree's presence in tea monoculture reduces incidence of tea pests, particularly red spider mites and scarlet mites",
  "Additional_information": null,
  "Description": "Medium sized tree, 22-4-m in height. Leaves dark green, bipinnately compound, alternate, stipulate; stipule free, lateral, caducous. Inflorescence clustered into hairy terminal panicles; flowers 1--15 per head, dimorphic, pale yellowish white, fragrant. Pods thin, flat, leathery, brown when ripe, dehiscent, each containing 8-14 seeds. Seeds ovoid."
 },
 {
  "S_No": 13,
  "Scientific_name": "Alstonia macrophylla",
  "Code": 13,
  "Common_name": "Hard milkwood",
  "Family_name": "Apocynaceae",
  "Kannada_name": "Janthaala mara",
  "Origin": "Indonesia, Malaysia, Phillipines",
  "Species type": "Exotic",
  "Phenology": "Deciduous",
  "Conservation_status": "Least concern",
  "Flowering_period": "December - March",
  "Fruiting_period": "May - July",
  "Uses": "The timber is of superior quality and less liable to attack by boring insects. It is used for making roof beams, frames, poles and toys. The bark, in the form of a powder, decoction, infusion, tincture or wine preparation, is used as an antiamoebic, anticholeric, antidysenteric, antimalarial, antiperiodic, emmenagogue, febrifuge, tonic and a vulnerary",
  "Additional_information": null,
  "Description": "Medium to large evergreen tree, growing upto 3- m. Bark is smooth and light grey in color. Leaves are in whorls of three to four, simple, penni-veined, oblong-obovate, membranous, and glabrous above. Leaf-blades are widest in or above the middle, and cuneate at the base. The flowers are small, yellowish-white, and borne on short cymes at the end of branches. The flowers consist of a long tube, opening into 5 pure-white petals. The fruit is a double follicle, pendant, very long, and slender. The seeds are small and very flat, deep-brown."
 },
 {
  "S_No": 14,
  "Scientific_name": "Alstonia scholaris",
  "Code": 14,
  "Common_name": "Devil  tree",
  "Family_name": "Apocynaceae",
  "Kannada_name": "Adda sarpa",
  "Origin": "Southern China, Tropical Asia",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Least concern",
  "Flowering_period": "October - March",
  "Fruiting_period": "April - June",
  "Uses": "The wood is used for the manufacture of pencils. It has proved a valuable remedy in chronic diarrhoea and the advanced stages of dysentery. It has also been found effectual in restoring the tone of the stomach and of the system generally in debility after fevers and other exhausting diseases.",
  "Additional_information": "At high doses, an extract of the plant exhibited marked damage to all the major organs of the body in both rats and mice.",
  "Description": "Medium to large tree, up to 4-m in height. Leaves in whorls of 4-8 in the upper axils, the lamina obovate to elliptical or elliptical-lanceolate, glabrous or sparsely hairy, upper surface is dark green, the lower is green-white;  The tip of the leaf is rounded or shortly pointed, tapering towards the base. The inflorescence is a much-branched terminal panicle; flowers white, cream or green, strongly perfumed. Fruit a pendulous, two-lobed, dehiscent follicle, brown or green, dry or woody, spindle-shaped, containing numerous flat, oblong, brown seeds, with a tuft of hairs at each end."
 },
 {
  "S_No": 15,
  "Scientific_name": "Anonna muricata",
  "Code": 15,
  "Common_name": "Soursop, Graviola",
  "Family_name": "Annonaceae",
  "Kannada_name": "Mullu ram phal",
  "Origin": "Tropical America, Caribbean",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": "All year",
  "Fruiting_period": "All year",
  "Uses": "The pulp is also used to make fruit nectar, smoothies, fruit juice drinks, as well as candies, sorbets, and ice cream flavorings. The leaves are usually boiled to make tea. It is believed to have medicinal benefits such as for preventing cancer and anti-inflammation. Powder of dried leaves and sap from fresh ones are useful in destroying vermin. A powder or oil from the\nseeds has been used to kill lice and bedbugs. All tree parts have insecticidal properties and can be used, with fruit as bait, to kill fish.",
  "Additional_information": null,
  "Description": "Small evergreen tree, up to 1- m tall. Leaves simple, alternate, oblong-ovate, dark green and glabrous above, pale green and slightly pubescent below, base cuneate to rounded, apex acute to obtuse. Inflorescence axillary, 1 to 2 flowered. Flower bisexual, petals 6, thick, yellowish, pubescent. Fruit dark green, ovoid, echinate, pulp white, juicy and aromatic. Seeds brownish. "
 },
 {
  "S_No": 16,
  "Scientific_name": "Aphanamixis polystachya",
  "Code": 16,
  "Common_name": "Pithraj tree",
  "Family_name": "Meliaceae",
  "Kannada_name": "Mukhyamuttage, Mullumuttaga",
  "Origin": "Indian Subcontinent",
  "Species type": "Indigenous",
  "Phenology": "Evergreen",
  "Conservation_status": "Least concern",
  "Flowering_period": null,
  "Fruiting_period": null,
  "Uses": "Bark is used in spleen, liver diseases, tumour and abdominal complaints. Seed-oil is used in rheumatism.",
  "Additional_information": null,
  "Description": "Evergreen tree, 2--3- m in height. Leaves compound, imparipinnate, alternate, pulvinate, oblong-elliptic, membranous when young, later leathery, base oblique, apex acute or acuminate with entire margin. Inflorescence axillary panicles. Flower polygamous, white, 6-7 mm in diameter. Fruit a single seeded orange-red subglobose capsule."
 },
 {
  "S_No": 17,
  "Scientific_name": "Aquilaria malaccensis",
  "Code": 17,
  "Common_name": "Agar wood, Malayan eagle-wood",
  "Family_name": "Thymelaeaceae",
  "Kannada_name": "Agaru, Kaaragilu",
  "Origin": "Indian subcontinent, Singapore, Thailand",
  "Species type": "Indigenous",
  "Phenology": "Evergreen",
  "Conservation_status": "Critically endangered",
  "Flowering_period": "April - June",
  "Fruiting_period": "April - September",
  "Uses": "It is a major source of agar wood resin that is used for perfume and incense. The resin is produced when the tree is infected by a parasitic fungus, Phaeoacremonium parasitica. The incense is used against cancer in Western, Chinese, and Indian medicine.",
  "Additional_information": null,
  "Description": "Evergreen tree up to 4- m tall with an irregular crown. Peeling outer bark dark to pale grey, inner bark cream-white. Leaves simple, alternate, oval-oblong to oblong-lanceolate, thin and leathery, acuminate. Inflorescence in clusters of 1-. Flower dirty yellow, 5-6 mm long. Fruit green and flattened, woody when ripe. Seeds pear shaped covered with orange-brown hairs, attached to fruit with a twisted appendage. "
 },
 {
  "S_No": 18,
  "Scientific_name": "Araucaria columnaris",
  "Code": 18,
  "Common_name": "Christmas tree",
  "Family_name": "Araucariaceae",
  "Kannada_name": "-",
  "Origin": "New Caledonia",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Least concern",
  "Flowering_period": "-",
  "Fruiting_period": "-",
  "Uses": "It is used as an ornamental tree.",
  "Additional_information": null,
  "Description": "Evergreen, narrowly conical tree up to 6- m tall. Bark papery. The relatively short, mostly horizontal branches are in whorls around the slender, upright to slightly leaning trunk. The branches are lined with cord-like, horizontal branchlets. The branchlets are covered with small, green, incurved, point-tipped, spirally arranged, overlapping leaves, younger leaves needle like. Male cone oblong-cylindrical, 5-1- cm long, finely teethed. Female cone 1--15 cm long with short bracts. Seeds 3-3.5 cm long and winged. "
 },
 {
  "S_No": 19,
  "Scientific_name": "Araucaria cunninghamii",
  "Code": 19,
  "Common_name": "Hoop pine, Moreton Bay pine",
  "Family_name": "Araucariaceae",
  "Kannada_name": "-",
  "Origin": "Australia",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Least concern",
  "Flowering_period": null,
  "Fruiting_period": "Seed dispersal - November - February",
  "Uses": "The bark exudes a resin when cut. This resin can be dissolved in alcohol to treat kidney ailments.  it is suitable for use as general-purpose construction timber; better grades are suitable for internal finishes for buildings, furniture and cabinet making. It is also an excellent veneer species and is used as such for making plywood.",
  "Additional_information": null,
  "Description": "Evergreen tree up to 7- m tall. Bark gray-brown, rough, splits naturally and peels easily. Lateral branches dense and drooping. Leaves dimorphic: leaves of young trees and lateral branchlets loosely arranged, needle like, falcate, wide at base, apex acute or acuminate; leaves on mature trees and cone bearing branchlets densely arranged, overlapping, ovate to triangular, apex acute or obtuse. Male cones terminal, solitary and ovoid or ellipsoid. Female cones ovoid or ellipsoid, 6-1- cm long, bracteate, apex caudate. Seeds ellipsoid with membranous lateral wing. "
 },
 {
  "S_No": 20,
  "Scientific_name": "Artabotrys hexapetalus",
  "Code": 20,
  "Common_name": "Tail grape, Climbing lang-lang",
  "Family_name": "Annonaceae",
  "Kannada_name": "Manoranjani, Kandaala",
  "Origin": "South China, Phillippines, India",
  "Species type": "Indigenous",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": "April - July",
  "Fruiting_period": "September - February",
  "Uses": "A decoction of the leaves is used as a treatment against cholera. The fruit is used to treat scrofula. The flowers yield an essential oil that is used in perfumery.",
  "Additional_information": null,
  "Description": "A woody, evergreen, climbing shrub up to 1- m tall. Leaves simple, alternate, oblong-elliptic, glabrous above and glaucous below, base cuneate, apex acuminate to acute. Inflorescence 1 to 2 flowered. Flowers bisexual, green and fade to yellow with age and are extremely fragrant. Petals 6 or 9 in two whorls. Fruit 3-4 cm long, berry. "
 },
 {
  "S_No": 21,
  "Scientific_name": "Artocarpus heterophyllus",
  "Code": 21,
  "Common_name": "Jack fruit",
  "Family_name": "Moraceae",
  "Kannada_name": "Halasu mara",
  "Origin": "Western ghats of India",
  "Species type": "Endemic",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": "March - April",
  "Fruiting_period": "June - August",
  "Uses": "The golden yellow timber with good grain is used for building furniture and house construction. It is termite-resistant and is superior to teak for building furniture. The wood is also used for manufacturing musical instruments. The pulp of young fruit is cooked as a vegetable, pickled or canned in brine or curry. Pulp of ripe fruit is eaten fresh or made into various local delicacies. The sap is an anti-syphilitic and a vermifuge.",
  "Additional_information": null,
  "Description": "Evergreen tree, 1-- 2- m tall, blackish- grey bark. All parts contain a sticky, white latex. Leaves simple, spirally arranged, elliptic to obovate, lobed leaves in saplings, coriaceous, base cuneate, apex acute to obtuse, entire. Male inflorescence axillary or terminal catkins, female inflorescence catkins, borne on main trunk and old branches, flowers unisexual, minute, yellowish green in colour and enclosed in spathe like bracts. Fruit a sorosis, globose with tubercles, fleshy yellow to orange pulp. Seeds glossy. "
 },
 {
  "S_No": 22,
  "Scientific_name": "Artocarpus lacucha",
  "Code": 22,
  "Common_name": "Monkey fruit tree",
  "Family_name": "Moraceae",
  "Kannada_name": "Esuluhuli, Vatehuli, Kanchisimbu",
  "Origin": "Indian subcontinent, Southeast Asia",
  "Species type": "Indigenous",
  "Phenology": "Deciduous",
  "Conservation_status": "Not known",
  "Flowering_period": "February - May",
  "Fruiting_period": "July - August",
  "Uses": "The sap and juice of the bark is applied externally to boils, pimples, cuts and wounds. The root is astringent and is also used as a purgative. The macerated bark is used as a poultice for treating skin ailments. ",
  "Additional_information": null,
  "Description": "Large deciduous tree, 1--15 m tall. Leaves simple, elliptical, sometimes pinnately lobed, are densely covered with yellow bristles, base broadly cuneate, apex obtuse, margin entire. Male inflorescences ovoid, orange-yellow. Female inflorescence slightly longer. Fruit globose, yellow, 7 cm in diameter. "
 },
 {
  "S_No": 23,
  "Scientific_name": "Averrhoa carambola",
  "Code": 23,
  "Common_name": "Carambola, Star fruit tree",
  "Family_name": "Oxalidaceae",
  "Kannada_name": "Kaparakhi mara",
  "Origin": "India, Indonesia, Sri Lanka",
  "Species type": "Indigenous",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": "July - August",
  "Fruiting_period": "October - January",
  "Uses": "Starfruit juice can be used to remove stains from linen. The fruit can be a laxative on account of the oxalic acid it contains. It is also used in traditional medicine for skin disorders and fevers. It is valued by Chinese communities as a remedy for high blood pressure, whilst it is also said to reduce blood sugar levels and so is of help to diabetics. The flowers are used to relieve coughs. The leaves are used to treat rheumatism. The seed is emmenagogue, galactagogue and abortifacient. The powdered seed is a good anodyne for treating asthma, colic and jaundice",
  "Additional_information": null,
  "Description": "Small, evergreen tree, 5-12 m tall. Leaf compound, imparipinnate, alternate, leaflets ovate-elliptic, pubescent, base rounded or truncate, apex acute to acuminate. Inflorescence axillary or ramal panicles or cymes. Flowers numerous, small, lilac to purple, petals 8-9 mm long. Fruit a berry, narrowly oblong, 5 ridged, yellow when mature. "
 },
 {
  "S_No": 24,
  "Scientific_name": "Azadirachta indica",
  "Code": 24,
  "Common_name": "Neem tree",
  "Family_name": "Meliaceae",
  "Kannada_name": "Bevina mara",
  "Origin": "Africa, Indian Subcontinent",
  "Species type": "Indigenous",
  "Phenology": "Deciduous",
  "Conservation_status": "Least concern",
  "Flowering_period": "March - April",
  "Fruiting_period": "July - August",
  "Uses": "Neem leaves are dried and placed in cupboards to prevent insects eating the clothes. It acts as an anti-feedant, repellent, and egg-laying deterrent and thus protects the crop from damage. Neem oil has been shown to avert termite attack as an ecofriendly and economical agent.",
  "Additional_information": null,
  "Description": "Evergreen tree, 15-2- m tall. Crown dense and roundish. Leaves compound, imparipinnate, alternate pulvinus leaf base, medium to dark green, leaflets ovate-lanceolate to lanceolate, glabrous, base oblique, apex acuminate, margin serrate. Inflorescence an axillary panicle. Flowers bisexual, white, sweet scented, 8 mm in diameter. The fruit is a drupe, oblong-ovoid, greenish-yellow, sweet pulp surrounding a single seed. "
 },
 {
  "S_No": 25,
  "Scientific_name": "Barringtonia acutangula",
  "Code": 25,
  "Common_name": "Freshwater mangrove, Mango pine",
  "Family_name": "Lecythidaceae",
  "Kannada_name": "Dhatripala",
  "Origin": "Southeast Asia, Australia",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Least concern",
  "Flowering_period": "March - May",
  "Fruiting_period": "March - May",
  "Uses": "Research on this plant has reported a number of medicinal uses, including antitumor (seed extract), antibiotic, inhibition of growth of Helicobacter pylori, antinociceptive activity and antifungal activity. Its bark contains potent opioid painkillers",
  "Additional_information": null,
  "Description": "Medium sized, evergreen tree, up to 15 m tall. Leaves simple, alternate, obovate to oblong, glabrous, base attenuate or cuneate, apex acute-acuminate, margin finely serrate. Inflorescence a terminal pendulous raceme. Flowers bisexual, 2 to 3 cm in diameter, red coloured. Fruit ovoid, quadrangular, 2 to 6 cm long, single seed."
 },
 {
  "S_No": 26,
  "Scientific_name": "Barringtonia asiatica",
  "Code": 26,
  "Common_name": "Sea poison tree, Fish poison tree",
  "Family_name": "Lecythidaceae",
  "Kannada_name": "-",
  "Origin": "Islands in Indian and Pacific ocean",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Least concern",
  "Flowering_period": null,
  "Fruiting_period": null,
  "Uses": "A decoction of the leaves is used to treat hernia. The leaves are heated and externally applied for stomach-ache. Fresh leaves are applied topically to bring relief from rheumatism and to treat sores. The toxic seeds are employed as a vermifuge.",
  "Additional_information": null,
  "Description": "Small to medium-sized tree, 7–2- m tall. Bark fissured. Leaves simple, obovate to obovate-oblong, 2-–4- cm in length and 1-–2- cm in width, coriaceous, glabrous, base cuneate, apex obtuse or broadly rounded, margin entire. Inflorescence a terminal raceme. Flowers large, fragrant, petals white, stamens numerous, white coloured and red tipped. Fruit broadly pyramidal, smooth, 9-11 cm with spongy and fibrous pericarp. Seed 4-5 cm. "
 },
 {
  "S_No": 27,
  "Scientific_name": "Bauhinia purpurea",
  "Code": 27,
  "Common_name": "Camel foot tree",
  "Family_name": "Fabaceae",
  "Kannada_name": "Basavanapaada, Mandara",
  "Origin": "South China, South-east Asia",
  "Species type": "Indigenous",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": "September - February",
  "Fruiting_period": "January - April",
  "Uses": "It used in making poultices for treating swelling, bruises, boils, and ulcers. Various parts of the plant are also used in decoctions to treat fever and stomach ailments, as well as being used as an astringent. In Indian traditional medicine, the leaves are used to treat coughs while the bark is used for glandular diseases and as an antidote for poisons. The flowers are also used in pickles and curries and is regarded as a laxative.",
  "Additional_information": null,
  "Description": "It is a medium sized, semi-evergreen tree, growing up to 1- m. Leaves simple, alternate, sub-orbicular, bilobed, thin coriaceous, glabrous, minutely pubescent lower surface when young, base sub-cordate, apex slightly acute or rarely rounded, margin entire. Inflorescence an axillary or terminal, raceme or panicle.  Flowers bisexual, petals 5, pink and fragrant. Fruit a pod, compressed, containing 12 to 16 seeds, coils after splitting open. "
 },
 {
  "S_No": 28,
  "Scientific_name": "Bauhinia tomentosa",
  "Code": 28,
  "Common_name": "Yellow bell orchid",
  "Family_name": "Fabaceae",
  "Kannada_name": "Kaadu mandaara, Vana Sampige",
  "Origin": "Tropical Africa, India, Sri Lanka",
  "Species type": "Indigenous",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": "December - March",
  "Fruiting_period": "January - June",
  "Uses": "The root bark is used internally for conditions of the large intestine, while the flower is used as a remedy for dysentery and diarrhoea. A decoction of the root bark is used in India as a vermifuge and an infusion of the stem bark as an astringent gargle. The fruit is said to be diuretic, and the seed is eaten in India as a tonic and aphrodisiac.",
  "Additional_information": "The generic name commemorates the Bauhin brothers Jean (1541-1613) and Gaspard (156--1624), the Swiss botanists; the two lobes of the leaf exemplify the two brothers.",
  "Description": "Shrub or a small tree, evergreen but can be deciduous in harsh climates, up to 8 m tall. Young branches glabrous to pubescent. Leaves simple, sub-orbicular, bilobed, papery, tomentose on lower surface, glabrous above, base cordate, lobes rounded at apex. Inflorescence a terminal or lateral raceme. Flowers yellow, petals 5. Fruit a dehiscent pod, occasionally tomentose, 8-12 seeded. Seeds blackish-brown. \n\n"
 },
 {
  "S_No": 29,
  "Scientific_name": "Beaucarnea recurvata",
  "Code": 29,
  "Common_name": "Ponytail palm",
  "Family_name": "Asparagaceae",
  "Kannada_name": "-",
  "Origin": "Mexico",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Critically endangered",
  "Flowering_period": null,
  "Fruiting_period": null,
  "Uses": "The leaves are very tough. They are used for thatching, making brooms, caskets, coarse hats, mats, etc. The fibre is used locally for cordage.",
  "Additional_information": null,
  "Description": "Small tree, evergreen growing up to 5m with a noticeable expanded caudex, for storing water. The single palm-like stem produces terminal tufts of strap-shaped simple, recurved coriaceous leaves, arranged in a rosette. Inflorescence a panicle of small white flowers, flowers rarely."
 },
 {
  "S_No": 30,
  "Scientific_name": "Bixa orellana",
  "Code": 30,
  "Common_name": "Achiote, Lipstick tree",
  "Family_name": "Bixaceae",
  "Kannada_name": "Rangumaale, Sindhuri gida, Aranattu ",
  "Origin": "Central America",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Least concern",
  "Flowering_period": null,
  "Fruiting_period": null,
  "Uses": "The tree is best known as the source of annatto, a natural orange-red condiment obtained from the waxy arils that cover its seeds. Annatto and its extracts are also used as an industrial food coloring to add yellow or orange color to many products such as butter, cheese, margarine, ice creams, meats, and condiments.",
  "Additional_information": null,
  "Description": "Evergreen, shrub or small tree, 6–1- m high. Young branches covered with red-brown scales. Leaves simple, alternate, cordate-ovate, glabrous, young leaves covered with scales on the lower surface, base, base cordate or truncate, apex acuminate, margin entire. Inflorescence a terminal panicle or corymb. Flower bright pink or mauve. Fruit globular, ovoid capsule purple-brown and spiny. Seeds numerous, red-brown. "
 },
 {
  "S_No": 31,
  "Scientific_name": "Bombax ceiba",
  "Code": 31,
  "Common_name": "Malabar silk cotton tree, Red silk cotton tree",
  "Family_name": "Malvaceae",
  "Kannada_name": "Kempu booruga",
  "Origin": "Southern and Eastern Asia, Australia",
  "Species type": "Indigenous",
  "Phenology": "Deciduous",
  "Conservation_status": "Not known",
  "Flowering_period": "January - February",
  "Fruiting_period": "March - May",
  "Uses": "The flowers are astringent and refrigerant. They are used to treat cutaneous troubles. The young roots are diuretic and tonic. The seed floss is used as a stuffing material for pillows, cushions etc. It is considered to be vermin-proof.",
  "Additional_information": null,
  "Description": "A large, deciduous tree growing up to 45 m. Trunk buttressed, bears numerous conical prickles, particularly when young, but get eroded when older. Leaves palmately compound, with about 5-7 leaflets, alternate; leaflets elliptic, elliptic-lanceolate, elliptic-ovate, base attenuate or cuneate, apex acuminate, margin entire. Inflorescence terminal, solitary or fascicule. Flowers bisexual, large, red or orange-red, 1- cm in diameter. Fruit a capsule, 8-1- cm long, finely tomentose. Seeds numerous, brown, embedded in white cotton. "
 },
 {
  "S_No": 32,
  "Scientific_name": "Brownea grandiceps",
  "Code": 32,
  "Common_name": "Rose of Venezueals, Scarlet flame bean",
  "Family_name": "Fabaceae",
  "Kannada_name": "-",
  "Origin": "South America",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": null,
  "Fruiting_period": null,
  "Uses": "Flowers are used in Venezuelan folk medicine as anti-hemorrhagic in women with heavy menstrual blood loss (menorrhagia).",
  "Additional_information": null,
  "Description": "Evergreen tree, growing up to 2- m tall. Leaves paripinnate, alternate, 8-26 leaflets; leaflets elliptic or oblong, with elongated apex. Young leaves pendant, reddish-brown. Inflorescence is a terminal panicle or head. Flowers bisexual, pink or red. Fruit a woody pod, covered in brown velvety hairs containing up to 5 seeds."
 },
 {
  "S_No": 33,
  "Scientific_name": "Butea monosperma",
  "Code": 33,
  "Common_name": "Flame of the forest, Bastard teak",
  "Family_name": "Fabaceae",
  "Kannada_name": "Muttuga, Palasha",
  "Origin": "Indian Subcontinent",
  "Species type": "Indigenous",
  "Phenology": "Deciduous",
  "Conservation_status": "Not known",
  "Flowering_period": "February - April",
  "Fruiting_period": "April - May",
  "Uses": "It is used for timber, resin, fodder, medicine, and dye. The gum is known as Bengal Kino and is considered valuable by druggists because of its astringent qualities and by leather workers because of its tannin.",
  "Additional_information": null,
  "Description": "Small to medium, deciduous tree, 1-- 2- m tall, bark greyish black. Leaves are pinnately trifoliate, leaflets unequal, terminal leaflet obovate, lateral leaflets narrowly ovate, leathery with obtuse or emarginate apex, stipules small and deciduous. Inflorescence an axillary or terminal raceme, flowers bisexual, bright orange- red, silky pubescent outside. Fruit is a pod 1-- 2- cm long, seed reddish brown. "
 },
 {
  "S_No": 34,
  "Scientific_name": "Calliandra haematocephala",
  "Code": 34,
  "Common_name": "Powder puff tree",
  "Family_name": "Mimosaceae",
  "Kannada_name": "-",
  "Origin": "Bolivia ",
  "Species type": "Exotic",
  "Phenology": "Deciduous",
  "Conservation_status": "Not known",
  "Flowering_period": "August - September",
  "Fruiting_period": "October - November",
  "Uses": "It is used as an ornamental plant.",
  "Additional_information": null,
  "Description": "Shrub or small tree, 8-2- m tall. Leaves bipinnate, leaflets in pairs of 4-8, lanceolate, coriaceous, glabrous, base oblique, apex mucronate or obtuse. Inflorescence is a terminal or axillary panicle. Flower scarlet coloured, stamens numerous and red coloured. Fruit a pod, brown when ripe, 6-11 cm long. Seeds 5-6 in number. "
 },
 {
  "S_No": 35,
  "Scientific_name": "Callistemon citrinus",
  "Code": 35,
  "Common_name": "Crimson bottle brush tree",
  "Family_name": "Myrtaceae",
  "Kannada_name": "-",
  "Origin": "Australia",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": "February - May and August - November",
  "Fruiting_period": "Februaury and September",
  "Uses": "The different parts of this herb have been used in common remedies for treatment of diarrhoea, dysentery and rheumatism. It is also used as a water accent, anticough, antibronchtits and insecticide in folk medicine .",
  "Additional_information": null,
  "Description": "Evergreen, erect, large shrub or small tree, up to 7.5 m tall. Young branchlets pink or lilac and hairy. Leaves narrowly lanceolate, glabrous, oil glands scattered, base cuneate, apex acuminate. Leaves have a citrus aroma when crushed. Inflorescence a spike growing beyond into a leafy shoot. Flowers crimson, sometimes lilac or purple-red. Stamens numerous, filaments crimson coloured, free at the base. Fruit a capsule, woody, depressed globose. "
 },
 {
  "S_No": 36,
  "Scientific_name": "Callistemon viminalis",
  "Code": 36,
  "Common_name": "Weeping bottlebrush",
  "Family_name": "Myrtaceae",
  "Kannada_name": "-",
  "Origin": "Australia",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": "All year",
  "Fruiting_period": "All year",
  "Uses": "It is considered antibacterial, antifungal, anthelmintic, hemostatic, diuretic. Studies have shown anthelmintic, anti-quorum sensing, insecticidal, anti-infective, antibacterial, molluscicidal, antioxidant, anticancer, anti-inflammatory, anti-platelet aggregation properties.",
  "Additional_information": null,
  "Description": "Evergreen, large shrub or small tree, up to 8 m tall. Bark grey and furrowed. Branches weeping, twigs silky haired. Leaves simple, alternate, linear-lanceolate, hairy when young, glabrous on maturity, base attenuate, punctate, glandular. Inflorescence a spike growing beyond into a leafy shoot. Flowers bright red. Stamens numerous, filaments red coloured and fused at the base. Fruit a capsule, woody, cup shaped. \n\n"
 },
 {
  "S_No": 37,
  "Scientific_name": "Calophyllum inophyllum",
  "Code": 37,
  "Common_name": "Alexandrian laurel tree",
  "Family_name": "Calophyllaceae",
  "Kannada_name": "-",
  "Origin": "Australia, Southeast Asia",
  "Species type": "Indigenous",
  "Phenology": "Evergreen",
  "Conservation_status": "Least concern",
  "Flowering_period": "December - January",
  "Fruiting_period": "December - January",
  "Uses": "A root decoction is traditionally used to treat ulcers, boils and ophthalmia. The bark is used to treat orchitis. The latex is rubbed on the skin in the treatment of rheumatism and psoriasis.",
  "Additional_information": null,
  "Description": "Evergreen, large trees, 7.5-3- m tall. Bark grey with longitudinal fissures, trunk relatively short and long spreading branches. Leaves simple, opposite decussate, rarely verticillate, elliptic-oblong to obovate, coriaceous, glabrous, glossy, base broadly cuneate or rounded, apex rounded or emarginate, margin undulate. Inflorescence an axillary raceme, 7-12 flowered. Flowers bisexual, rarely polygamous, white coloured, petals 4. Fruit an indehiscent drupe, ovoid-globose, pale brown when ripe, endocarp spongy with a single seed. "
 },
 {
  "S_No": 38,
  "Scientific_name": "Careya arborea",
  "Code": 38,
  "Common_name": "Wild guava",
  "Family_name": "Lecythidaceae",
  "Kannada_name": "Alagavvele, Gonji, Goujal",
  "Origin": "Indian subcontinent, Afghanistan, Indochina",
  "Species type": "Indigenous",
  "Phenology": "Deciduous",
  "Conservation_status": "Not known",
  "Flowering_period": "March - April",
  "Fruiting_period": "June - July",
  "Uses": "The bark of the tree and the sepals of the flowers are well-known Indian remedies, and are valued on account of their astringent and mucilaginous properties, being administered internally in coughs and colds and applied externally as an embrocation. ",
  "Additional_information": null,
  "Description": "Medium sized deciduous tree growing up to 12m high. Leaves simple, alternate, obovate, oblong-obovate, glabrous, base cuneate or attenuate, apex round or shortly acuminate, margin crenate-serrate. Inflorescence a terminal spike. Flowers are greenish white, bisexual with an unpleasant smell. Fruit a berry, globose 2 - 3 inch long with numerous seed."
 },
 {
  "S_No": 39,
  "Scientific_name": "Caryota urens",
  "Code": 39,
  "Common_name": "Fishtail Palm",
  "Family_name": "Arecaceae",
  "Kannada_name": "-",
  "Origin": "Indian subcontinent",
  "Species type": "Indigenous",
  "Phenology": "Evergreen",
  "Conservation_status": "Least concern",
  "Flowering_period": "January - April",
  "Fruiting_period": "January - April",
  "Uses": "Toddy is extracted from the inflorescence, and is considered some what powerful compared to toddy extracted from few other palm trees. Pulp of the fully grown up plant is cut, sun dried, powdered and is edible. The leaves possess strong fibres and are used for basketry. ",
  "Additional_information": null,
  "Description": "Trunk solitary, annulate, erect, up to 12 m tall. Leaves bipinnate, with a terminal leaflet, leaflets alternate, cuneate, fan-shaped, apex premorse. Inflorescence axillary, spadix and pendulous.  Flowers unisexual and white. The fruit matures to a round drupe, red in color, juicy, irritant due to oxalate crystals, seeds 1-2. "
 },
 {
  "S_No": 40,
  "Scientific_name": "Cassia fistula",
  "Code": 40,
  "Common_name": "Indian Laburnum",
  "Family_name": "Fabaceae",
  "Kannada_name": "Kakke mara",
  "Origin": "Indian subcontinent, Southeast Asia",
  "Species type": "Indigenous",
  "Phenology": "Deciduous",
  "Conservation_status": "Not known",
  "Flowering_period": "April - July",
  "Fruiting_period": "October - March",
  "Uses": "The ripe pods and seeds are widely used in both traditional and conventional medicine as a laxative. The bark or leaves are widely applied to skin problems. Broken bones and tropical ulcers are bandaged with bark scrapings and leaf sap.",
  "Additional_information": null,
  "Description": "It is a medium-sized, deciduous tree, 1-–2- m tall. Bark smooth when young, later dark and rough.  Leaves paripinnate, alternate, 3-6 pairs of leaflets, leaflets opposite, oblong-broadly obovate, glabrous above, pubescent below, base cuneate, apex acute, margin entire.  The leaves are Deciduous and pinnate with three to eight pairs of leaflets. Inflorescence a pendulous raceme 2-–4- cm long. Flower bisexual, golden-yellow. Fruit a pod, oblong, black when ripe, indehiscent, 4--6- cm, seeds numerous. "
 },
 {
  "S_No": 41,
  "Scientific_name": "Cassia grandis",
  "Code": 41,
  "Common_name": "Pink shower tree",
  "Family_name": "Fabaceae",
  "Kannada_name": "-",
  "Origin": "South America",
  "Species type": "Exotic",
  "Phenology": "Semi-deciduous",
  "Conservation_status": "Not known ",
  "Flowering_period": "February - March",
  "Fruiting_period": "March - May",
  "Uses": "The membrane surrounding seeds is used as a chocolate substitute in Central America. It is reported to give strong multipurpose wood, used in joinery, carpentry, beams among others. The fruit pulp is used as a laxative and fresh juice of the leaves is used externally in the treatment of ringworm.",
  "Additional_information": null,
  "Description": "Deciduous or semi-deciduous, up to 3- m tall. Branchlets pubescent towards the tip, later glabrous. Leaves paripinnate, alternate with 1--2- pairs of leaflets; leaflets oblong-elliptic, tomentose below, pubescent above, base rounded, apex obtuse or rounded, margin entire. Inflorescence an axillary raceme. Flowers bisexual, pink to white. Fruit an indehiscent pod, cylindrical, up to 9- cm long with numerous seeds. "
 },
 {
  "S_No": 42,
  "Scientific_name": "Cassia javanica",
  "Code": 42,
  "Common_name": "Apple blossom tree",
  "Family_name": "Fabaceae",
  "Kannada_name": "-",
  "Origin": "South East Asia",
  "Species type": "Exotic",
  "Phenology": "Deciduous",
  "Conservation_status": "Least concern",
  "Flowering_period": "April - June ",
  "Fruiting_period": null,
  "Uses": "The ripe pods and seeds are used as a traditional laxative. The bark and seeds are used as antipyretics in the treatment of fevers. The bark has been used for tanning, but the amount of tannin is comparatively low",
  "Additional_information": null,
  "Description": "Deciduous tree growing up to 2- m, sometime up to 3- m. Leaves paripinnate, alternate with 1--2- pairs of leaflets; leaflets oblong, oval, pilose, base cuneate or rounded, apex acute, obtuse or shortly acuminate. Inflorescence a lateral or terminal raceme. Flowers bisexual, pink or crimson, stamens bright yellow. Fruit a pod, 2--6- cm long, black when ripe, seeds 5--75 in number. "
 },
 {
  "S_No": 43,
  "Scientific_name": "Cassia roxburghii",
  "Code": 43,
  "Common_name": "Red Cassia",
  "Family_name": "Fabaceae",
  "Kannada_name": "Kakke ",
  "Origin": "South India",
  "Species type": "Indigenous",
  "Phenology": "Deciduous",
  "Conservation_status": "Not known ",
  "Flowering_period": "May- August ",
  "Fruiting_period": "May- July ",
  "Uses": "The dry leaves and bark is used to treat muscle spasms, diabetes, gastric problems, cold, diarrhea. Economical uses include its cultivation as ornamental plants",
  "Additional_information": null,
  "Description": "Medium-sized tree, deciduous tree, 15–2- m tall with spreading, drooping branches. Leaves paripinnate, alternate with 8-2- pairs of leaflets; leaflets oblong, ovate-elliptical, unequal sided, tips blunt. Inflorescence an axillary pendulous raceme. Flower bisexual, red to pink, older flowers pink. Fruit a pod, 2--3- cm long, cylindrical and glabrous.  "
 },
 {
  "S_No": 44,
  "Scientific_name": "Cassine paniculata",
  "Code": 44,
  "Common_name": "Panicled cassine",
  "Family_name": "Celastraceae",
  "Kannada_name": "-",
  "Origin": "Western Ghats",
  "Species type": "Endemic",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": "April - July ",
  "Fruiting_period": null,
  "Uses": " Bark is given internally in extreme cases of anemia, as a blood purifier, given as cardiac tonic and as wound healing. ",
  "Additional_information": null,
  "Description": "Evergreen, large buttressed tree, up to 4- m tall. Trunk is hollow in very old trees. Bark is gray, smooth, blaze red with watery exudation. Leaves simple, opposite decussate, elliptic-oblong, glabrous, coriaceous, base acute or cuneate, apex acute or obtusely acuminate, margin crenate. Inflorescence an axillary dichasial corymbose cyme. Flowers bisexual, greenish-yellow, 1 cm across. Fruit a drupe, globose to ellipsoid, apiculate, 1-2 seeded.    "
 },
 {
  "S_No": 45,
  "Scientific_name": "Castanospermum australe",
  "Code": 45,
  "Common_name": "Moreton Bay chestnut",
  "Family_name": "Fabaceae",
  "Kannada_name": "-",
  "Origin": "Australia",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known ",
  "Flowering_period": "October - November",
  "Fruiting_period": "February - April",
  "Uses": "The seed yields compounds called castanospermine that are under investigation as HIV inhibitors and might be useful in the treatment of AIDS. Parts of the tree contain chemicals which, after careful extraction, have been shown to have anti-cancer, anti-inflammatory, and anti-HIV properties. The seedpods are astringent. They are used to treat post-prandial hyperglycaemia in diabetic patients. ",
  "Additional_information": "Flowers are produced on the old wood. This species has a symbiotic relationship with certain soil bacteria, these bacteria form nodules on the roots and fix atmospheric nitrogen. Some of this nitrogen is utilized by the growing plant but some can also be used by other plants growing nearby",
  "Description": "Large, evergreen tree, up to 4- m tall. Leaves imparipinnate, alternate with 11-15 leaflets; leaflets alternate, oval shaped. Inflorescence a raceme. Flowers bisexual, yellow or orange, later turning into red, 4-5 cm long. Fruit a pod, cylindrical, up to 3- cm long with 1 to 5 seeds."
 },
 {
  "S_No": 46,
  "Scientific_name": "Casuarina equisetifolia",
  "Code": 46,
  "Common_name": "Australian pine tree",
  "Family_name": "Casuarinaceae",
  "Kannada_name": "Kyasurina Sarve mara",
  "Origin": "Southeast Asia, Australia",
  "Species type": "Indigenous",
  "Phenology": "Evergreen",
  "Conservation_status": "Least concern",
  "Flowering_period": "April - June ",
  "Fruiting_period": "September- December ",
  "Uses": "Root extracts are used for the treatment of dysentery, diarrhoea and stomach-ache. A decoction of the twigs is used for treating swelling. The fresh bark is an excellent astringent. It is used in the treatment of chronic diarrhoea and dysentery. A decoction of the inner bark, combined with the inner bark of Terminalia catappa, is taken as a treatment for asthma and shortness of breath",
  "Additional_information": null,
  "Description": "Evergreen tree which grows upto 35m, monoecious, often pyramidal; bark dark grey or brownish.  Youngest persistent stems with internodes with whorls of 6-8 scale leaves,  2–3 mm, straw coloured, narrowly triangular, pubescent, margin with numerous white or pale cilia. Persistent branches give rise to nuumerous deciduous branches that are green, 7-8 parallel ribs; scale leaves in whorls of 6-8, pale green or straw coloured, small, adpressed, united at base, glabrous, margin with cilia. Male inflorescenes abundant on deciduous branches, rare on persistent branches. Female inflorescnces axillary and borne on apices of younger persitent branches. Infructescence short, cylindricalor sub-globose with flattened apex. Fruit a samara, woody, pale brown, containing a single seed."
 },
 {
  "S_No": 47,
  "Scientific_name": "Ceiba pentandra",
  "Code": 47,
  "Common_name": "Java cotton, Silk-cotton tree",
  "Family_name": "Malvaceae",
  "Kannada_name": "Bili booraga",
  "Origin": "Mexico, Central America, South America",
  "Species type": "Exotic",
  "Phenology": "Deciduous",
  "Conservation_status": "Least concern",
  "Flowering_period": "January- March",
  "Fruiting_period": "September - October",
  "Uses": "The bark decoction has been used as a diuretic, as an aphrodisiac, and to treat headache, as well as type II diabetes. It is used as an additive in some versions of the psychedelic drink Ayahuasca. Oil from its seeds are extracted and used as vegetable oil",
  "Additional_information": null,
  "Description": "Large deciduous tree, evergreen, 3--4- m tall. Buttresses present. Bark smooth, green or greenish-grey with scattered conical spines, up to 1.5 cm long, young branches glabrous or pubescent. Leaves palmately compound, alternate with 5-9 leaflets; leaflets elliptic, obovate-oblong, glabrous, base acute or cuneate, apex acute or acuminate, margin entire. Inflorescence in clusters of 3-1-, axillary, rarely solitary. Flowers bisexual, creamy white or pink; petals glabrous outside, silky villous inside. Fruit a capsule, woody, smooth, brown, oblong-ellipsoid, 1--26 cm long. Seeds numerous, embedded in white or greyish silky wool. "
 },
 {
  "S_No": 48,
  "Scientific_name": "Ceiba speciosa",
  "Code": 48,
  "Common_name": "Silk floss tree",
  "Family_name": "Malvaceae",
  "Kannada_name": "-",
  "Origin": "South America",
  "Species type": "Exotic",
  "Phenology": "Deciduous",
  "Conservation_status": "Least concern",
  "Flowering_period": "September - October ",
  "Fruiting_period": "March - May",
  "Uses": "The silk floss tree is cultivated mostly for ornamental purposes. The wood can be used to make canoes, as wood pulp, and to make paper. The bark has been used to make ropes. From the seeds it is possible to extract vegetable oil",
  "Additional_information": null,
  "Description": "Deciduous tree, up to 25 m tall. Bark greenish in younger trees, covered with numerous spines. Leaves palmately compond, composed of 5 to 7 leafltes; leaflets more or less lanceolate, glabrous, base acute, apex acuminate, margin serrate. Inflorescence in clusters or soliatry in axils of terminal branches. Flowers bisexual, creamish-white in the center and pink towards the tips. Fruit a dehiscent capsule, about 2- cm long, seeds embedded in white cottony mass. "
 },
 {
  "S_No": 49,
  "Scientific_name": "Centrolobium tomentosum",
  "Code": 49,
  "Common_name": "Arariba rosa",
  "Family_name": "Fabaceae",
  "Kannada_name": "-",
  "Origin": "South America",
  "Species type": "Exotic",
  "Phenology": "Deciduous",
  "Conservation_status": "Not known ",
  "Flowering_period": null,
  "Fruiting_period": null,
  "Uses": "It is used in reforestation projects for restoring native woodland. A very decorative wood, it is used for cabinet making, furniture, ship building, indoor and outdoor hydraulic work, beams, canoes, wagons, general carpentry.",
  "Additional_information": "This species has a symbiotic relationship with certain soil bacteria, these bacteria form nodules on the roots and fix atmospheric nitrogen. Some of this nitrogen is utilized by the growing plant but some can also be used by other plants growing nearby",
  "Description": "Deciduous tree, dense, spreading crown, 1--12 m tall. Leaves imparipinnate; leaflets 13-17, oblong-ovate, pubescent, base obliquely truncate. Inflorescence a panicle.  Flowers are papilionaceous, yellow. Fruit a pod, spiny, with a broad falcate-ovate wing. "
 },
 {
  "S_No": 50,
  "Scientific_name": "Cerbera odollam",
  "Code": 50,
  "Common_name": "Pong pong tree",
  "Family_name": "Apocynaceae",
  "Kannada_name": "Chande, Chendu hoovu",
  "Origin": "South Asia, India",
  "Species type": "Indigenous",
  "Phenology": "Evergreen",
  "Conservation_status": "Least concern",
  "Flowering_period": "January- March",
  "Fruiting_period": "Feburary- April ",
  "Uses": "The leaves are used externally to treat ringworm. A leaf decoction is added to an aromatic bath after childbirth. The oil is applied externally to treat scabies and is used as a hair tonic that also kills head lice .The fruits are used for manufacturing bioinsecticides and deodorants. ",
  "Additional_information": "The whole plant, but especially the seeds, is very poisonous",
  "Description": "Small evergreen tree, up to 6 m tall, bark greenish-brown, latex milky. Leaves simple, alternate, crowned at the tip of branches, lanceolate or oblanceolate, glabrous, base cuneate or attenuate, apex acuminate or acute, margin entire. Inflorescence a pseudoterminal cyme. Flowers bisexual, white. tube funnel-shaped. Fruit a drupe, globose or ellipsoid, green, rosy when ripe; seeds 1-2. "
 },
 {
  "S_No": 51,
  "Scientific_name": "Chukrasia tabularis",
  "Code": 51,
  "Common_name": "Indian Mahogany, Chitta gong wood",
  "Family_name": "Meliaceae",
  "Kannada_name": "Kalgarike, Madagari bevu",
  "Origin": "Indian Subcontinent",
  "Species type": "Indigenous",
  "Phenology": "Deciduous",
  "Conservation_status": "Least concern",
  "Flowering_period": "April- May",
  "Fruiting_period": "December- March",
  "Uses": "Major uses are fine furniture, turnery, doors, windows and light flooring. Flowers contain a red and yellow dye. The bark and leaves contain commercial gums and tannins and the astringent bark has medicinal uses. It is planted as a shade tree for coffee plantations",
  "Additional_information": null,
  "Description": "Large, deciduous tree, up to 35 m tall. Bark thick, dark brown, with thin irregular flakes, blaze pink-red. Leaves paripinnate, 12-5- cm long, alternate, pulvinate; leaflets 1--24, alternate or subopposite; leaflets narrow ovate to lanceolate, coriaceous, glabrous above, pubescent beneath, base oblique, apex acuminate, margin entire. Inflorescence a terminal panicle, greyish, pubescent. Flowers bisexual, yellowish-white. Fruit a capsule, globose, 4 cm across, 4-5 valved, glabrous; seeds many, broadly winged at base. "
 },
 {
  "S_No": 52,
  "Scientific_name": "Cinnamomum verum",
  "Code": 52,
  "Common_name": "Cinnamon tree",
  "Family_name": "Lauraceae",
  "Kannada_name": "Lavangachakke, Lavangapatte",
  "Origin": "Sri Lanka, India",
  "Species type": "Indigenous",
  "Phenology": "Evergreen",
  "Conservation_status": "Least concern",
  "Flowering_period": "January- March",
  "Fruiting_period": "June- August",
  "Uses": "Cinnamon bark is astringent, stimulant and carminative. It possesses the property of checking nausea and vomiting.Cinnamon bark oil is employed in a range of dental and pharmaceutical preparations. Oils extracted from it are used in food flavouring industry but is also used in tobacco flavours and for incense. It has limited use in some perfumes",
  "Additional_information": null,
  "Description": "Evergreen trees, 1--2- m tall. Bark smooth, brown with strong cinnamon smell; buttressed. Leaves simple, opposite or subopposite, rarely alternate, ovate, elliptic ovate to elliptic-lanceolate, glabrous, base acute to attenuate, apex acute to acuminate, margin entire, tri-nerved venation.  Inflorescence terminal or axillary panicles. Flowers bisexual, greenish-yellow. Fruit a berry, ellipsoid, dark purple 1-2 cm containing a single seed. "
 },
 {
  "S_No": 53,
  "Scientific_name": "Citharexylum spinosum",
  "Code": 53,
  "Common_name": "Florida Fiddlewood",
  "Family_name": "Verbenaceae",
  "Kannada_name": "Beli parijatha",
  "Origin": "Caribbean, Tropical America",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Least concern",
  "Flowering_period": "All year",
  "Fruiting_period": "All year",
  "Uses": "A decoction of the young twigs is used in the treatment of children's thrush. A decoction of the bark is used as a treatment for colds. It is used for making furniture, musical instruments such as guitars, and is also used for general construction, windows, doors, beams. The wood is useful for fenceposts and other rough construction where resistance to termites and to rot are required",
  "Additional_information": null,
  "Description": "Large shrubs or small, evergreen trees up to 15 m tall. Branches and branchlets 4-angular. Leaves simple, opposite decussate, ovate, oblong-elliptic, to lanceolate, glabrous, chartaceous,  base cuneate to acute, apex acuminate, margin entire or dentate. Inflorescence terminal or axillary racemes.  Flowers bisexual, creamish-white, fragrant. Fruit a drupe, oblong, black and fleshy. "
 },
 {
  "S_No": 54,
  "Scientific_name": "Citrus limon",
  "Code": 54,
  "Common_name": "Lemon",
  "Family_name": "Rutaceae",
  "Kannada_name": "Nimbe hannu mara",
  "Origin": "Northeast India, Myanmar, China",
  "Species type": "Indigenous",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": "All year",
  "Fruiting_period": "All year",
  "Uses": "The essential oil from the skin of the fruit is strongly rubefacient and when taken internally in small doses has stimulating and carminative properties. The fruit is rich in vitamin C which helps the body to fight off infections and also to prevent or treat scurvy. ",
  "Additional_information": null,
  "Description": "Evergreen, spinous shrubs or small trees, 3-6  m tall. Spines axillary. Leaves simple, alternate, elliptic to ovate, glandular, base obtuse or rounded, apex subacute or obtuse, margin serrulate, petioles narrowly winged. Inflorescence clusters or solitary, axillary. Flowers bisexual, white, strongly scented. Fruit a hesperidium,  globose to elongated, glandualr,  yellow when ripe, with a leathery rind or peel. "
 },
 {
  "S_No": 55,
  "Scientific_name": "Clitoria arborea",
  "Code": 55,
  "Common_name": "Butterfly pea tree",
  "Family_name": "Fabaceae",
  "Kannada_name": "-",
  "Origin": "Brazil, Bolivia, Peru",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Least concern",
  "Flowering_period": null,
  "Fruiting_period": null,
  "Uses": null,
  "Additional_information": null,
  "Description": "Evergreen, small tree. Stem galbrous; leaf pinnately compound, leaflets broadly obovate, obtuse, emarginated at the base, unevenly rounded, glabrous. Inflorescence a raceme. Flowers bisexual, pink, papilonaceous corolla. Fruit a pod. "
 },
 {
  "S_No": 56,
  "Scientific_name": "Cocos nucifera",
  "Code": 56,
  "Common_name": "Coconut",
  "Family_name": "Arecaceae",
  "Kannada_name": "Thengina mara",
  "Origin": "Southeast Asia",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known ",
  "Flowering_period": "All year",
  "Fruiting_period": "All year",
  "Uses": "It has many culinary uses all over the world. The roots are used as a dye, a mouthwash, and a folk medicine for diarrhea and dysentery. Coconut trunks are used for building small bridges and huts; they are preferred for their straightness, strength, and salt resistance. The leavesare used as brooms and for making baskets,etc.",
  "Additional_information": null,
  "Description": "Large palm, erect, with annular petiolar scars, usually not straight, trunk  usally swollen at the base, growing up to 3- m tall. A tuft of leaves arises at the apex, pinnate, leaflets 6--1-- in number; leaflets opposite near the base, alternate and opposite near the tip, shiny green above, paler below, coriaceous, base narrow, apex tapering, acute, midrib prominent. Inflorescence an axillary panicle. Flowers unisexual; male flowers yellowish-brown, 8 mm long; female flowers woody. Fruit a drupe, up to 3- cm long, ovoid or globose, trigonous, pericarp fibrous, endocarp stony. Seed coherent with the endocarp. Endosperm white, mily fluid."
 },
 {
  "S_No": 57,
  "Scientific_name": "Colvillea racemosa",
  "Code": 57,
  "Common_name": "Colville's glory",
  "Family_name": "Fabaceae",
  "Kannada_name": "Kempu hukuchinamara",
  "Origin": "Madagascar",
  "Species type": "Exotic",
  "Phenology": "Deciduous",
  "Conservation_status": "Least concern",
  "Flowering_period": "August - October",
  "Fruiting_period": null,
  "Uses": "It is suitable for light joinery, interior trim, furniture, boxes and crates. The boles are used to make dug-out canoes. It is planted as an ornamental tree because of its bright orange flowers and delicate foliage",
  "Additional_information": null,
  "Description": "Deciduous tree, 2--3- m tall with spreading branches. Bark brownish-grey with copper tone and brown corky spots. Leaves bipinnate, alternate, with 2--3- pairs of pinnae, each bearing 2--28 pairs of leaflets arranged oppositely; leaflets linear to oblong, base rounded, apex obtuse to rounded, margin entire. Inflorescence a raceme. Flowers bisexual, scarlet to orange; stamens, 1-, prominent and yellow. Fruit a pod, oblong, two valved.  "
 },
 {
  "S_No": 58,
  "Scientific_name": "Cordia dichotoma",
  "Code": 58,
  "Common_name": "Indian cherry tree",
  "Family_name": "Boraginaceae",
  "Kannada_name": "Challe",
  "Origin": "Indomalayan realm",
  "Species type": "Indigenous",
  "Phenology": "Deciduous",
  "Conservation_status": "Not known ",
  "Flowering_period": "March - May",
  "Fruiting_period": "June - August",
  "Uses": "The fruit used to remedy treatment to relive several diseases as anti-diabetic, immunomodulator, hepatoprotective, treatment of inflammation, fever, bronchitis and astringent, wounds healing and paralytic in folk medicine.",
  "Additional_information": null,
  "Description": "Medium sized, deciduous tree, up to 15 m tall with a spreading crown.Bark is greyish brown, smooth or longitudinally wrinkled. Leaves simple, alternate, broadly ovate or elliptic oblong, sparsely pubescent or glabrous, base rounded to broadly cuneate, apex obtuse to mucronate, margin dentate or entire. Inflorescence a dichotomous corymbose cyme. Flowers dimorphic; male flowers white; bisexual flowers larger than male flowers, white. Fruit a drupe, fragrant, subglobose, yellow or pinkish-yellow, black on ripening, with sticky mesocarp, persistent calyx, single seeded."
 },
 {
  "S_No": 59,
  "Scientific_name": "Cordia myxa",
  "Code": 59,
  "Common_name": "Assyrian plum tree",
  "Family_name": "Boraginaceae",
  "Kannada_name": "Kaaduchalle",
  "Origin": "South Iran, Indo-China",
  "Species type": "Indigenous",
  "Phenology": "Deciduous",
  "Conservation_status": "Not known ",
  "Flowering_period": "March - April",
  "Fruiting_period": "July - August",
  "Uses": "The fruit pulp is commonly used in folk medicine to treat cough and chest complaints, as well as for the treatment of wounds and ulcers. Several studies have confirmed its anti-inflammatory and analgesic activities.",
  "Additional_information": null,
  "Description": "Deciduous, small trees, 6-12 m tall. Bark greyish brown with vertical fissures. Leaves simple, alternate, broadly ovate to circular, subcoriaceous, glabrous above, glabrous to pubescent below, base rounded to cordate or cuneate, apex obtusely acuminate, margin entire to slightly dentate. Inflorescence a terminal cyme. FLowers variable, unisexual and bisexual flowers, white. Fruit a drupe, 2- mm long, ovoid or globose, apiculate, glabrous, yellow or brownish-yellow with mucilaginous sweet pulp, 1 seeded. "
 },
 {
  "S_No": 60,
  "Scientific_name": "Cordia sebestena",
  "Code": 60,
  "Common_name": "Geiger tree, Scarlet cordia",
  "Family_name": "Boraginaceae",
  "Kannada_name": "Challekendala",
  "Origin": "Tropical America",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known ",
  "Flowering_period": "All year",
  "Fruiting_period": "All year",
  "Uses": "The leaves are emollient. They are used in the treatment of bronchitis, coughs, fevesr and influenza. The plant has been used as a remedy for intestinal and stomach complaints, and also for bronchial affections. A syrup prepared from the bark, flowers and fruit is a local remedy for affections of the chest",
  "Additional_information": null,
  "Description": "Shrubs or small trees, up to 8 m tall. Brachlets pubescent. Leaves simple, alternate, coriaceous, pubescent on the underisde, base rounded, apex acute,  margin entire to undulate. Inflorescence in terminal cymose panicles. Flowers bisexual, vermillon coloured. Fruit a drupe, ovoid, hard, white when ripe, fleshy, 1-4 seeded. "
 },
 {
  "S_No": 61,
  "Scientific_name": "Couroupita guianensis",
  "Code": 61,
  "Common_name": "Cannonball tree",
  "Family_name": "Lecythidaceae",
  "Kannada_name": "Lingada hoovinamara, Nagalinga pushpa mara",
  "Origin": "Central and South America",
  "Species type": "Exotic",
  "Phenology": "Deciduous",
  "Conservation_status": "Least concern",
  "Flowering_period": "All year",
  "Fruiting_period": "All year",
  "Uses": "The extracts of several parts of the tree to treat hypertension, tumors, pain, and inflammation. It has been used to treat the common cold, stomachache, skin conditions and wounds, malaria, and toothache.",
  "Additional_information": "In India, the tree has been adopted as sacred to Hindus, who believe its hooded flowers look like the nāga, and it is grown at Shiva temples.",
  "Description": "Deciduous trees growing up to 35 m. Leaves in clusters at the tip of branches, simple, alternate,  oblong, obovate, elliptic or broadly lanceolate, veins on underside pubescent, base cuneate, apex acute, margin entire or finely serrate. Inflorescence a raceme. Flowers bisexual, yellow and red tinged, deep red to pink inside, fragrant.  Fruit indehiscent, globose, hard woody exocarp, reddish-brown, pulpy inside with 2---3-- seeds. "
 },
 {
  "S_No": 62,
  "Scientific_name": "Crescentia cujete",
  "Code": 62,
  "Common_name": "Calabash tree",
  "Family_name": "Bignoniaceae",
  "Kannada_name": "Sokeburude",
  "Origin": "Africa, Central and South America",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": "All year",
  "Fruiting_period": "All year",
  "Uses": "The juice of the fruit is used to treat diarrhoea, pneumonia and intestinal irregularity. The leaf is chewed to treat toothache. The leaves are used as a wash to cleanse dirty wounds.",
  "Additional_information": null,
  "Description": "Small, evergreen tree, up to 1- m tall. Leaves simple, sessile, clustered at ends, obovate to oblanceolate, alternate, chartaceous, glabrous above, pubescent below, base attenuate, apex acute to obtuse. Inflorescence one or two cauliflorous flowers. Flower bisexual, yellowish-white with musty odour.  Fruit a pepo, spherical to ovoid, up to 3- cm long, green; seeds small, scattered throughout the pulp. "
 },
 {
  "S_No": 63,
  "Scientific_name": "Cupressus funebris",
  "Code": 63,
  "Common_name": "Chinese weeping cypress",
  "Family_name": "Cupressaceae",
  "Kannada_name": "-",
  "Origin": "China, Vietnam",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": null,
  "Fruiting_period": null,
  "Uses": "The leaf is antiperiodic. It is used in the treatment of bleeding piles, excessive menstrual flow etc. A decoction of fruiting branches is used in the treatment of colds.",
  "Additional_information": null,
  "Description": "  Evergreen, coniferous tree, up to 35 m. Bark smmoth, brown. Braches more or less horizontal, brachlets arranged in a plane, pendulous, green, slender, flattened, ca. 1 mm wide. Leaves light green or gray-green, densely appressed, scale-like, dimorphic, 1-1.5 mm long, apex pointed; facial pairs with a linear abaxial gland; lateral pairs folded face-to-face, overlapping basal part of facial pairs, ridged abaxially. Pollen cones ellipsoid or ovoid with 1--14 microsporophylls. Seed cones dark brown when ripe, globose, 8-15 mm across in diameter, cone scales 6-12, each fertile scale with 3-6 seeds. Seeds light brown, lustrous, flattened, ovate-rhombic or suborbicular. "
 },
 {
  "S_No": 64,
  "Scientific_name": "Cupressus sempervirens",
  "Code": 64,
  "Common_name": "Mediterranean cypress, Italian cypress",
  "Family_name": "Cupressaceae",
  "Kannada_name": "-",
  "Origin": "Mediterranean region",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Least concern",
  "Flowering_period": "March - April",
  "Fruiting_period": null,
  "Uses": "The cones and young branches are anthelmintic, antipyretic, antirheumatic, antiseptic, astringent, balsamic and vasoconstrictive. Taken internally, it is used in the treatment of whooping cough, the spitting up of blood, spasmodic coughs, colds, flu and sore throats. ",
  "Additional_information": null,
  "Description": "Evergreen, coniferous tree, up to 3- m tall; bark greyish brown, shallowly fissured; branches ascending or horizontal spreading; brachlets not arranged in a plane, ultimate ones 4-angled, ca. 1 mm in diameter. Leaves in 4 ranks, densely appressed, dark green, not glaucous, -.5-1 mm, ridged abaxially, without a conspicuous abaxial gland, apex obtuse or subacute. Pollen cones 4-8 mm. Seed cones yellowish grey when ripe, subglobose or ellipsoid, 2-3 cm in diameter, cone scales 8-14, each fertile scale with 8-2- seeds. Seeds brown, compressed, winged and narrow. "
 },
 {
  "S_No": 65,
  "Scientific_name": "Cycas circinalis",
  "Code": 65,
  "Common_name": "Queen sago",
  "Family_name": "Cyacadaceae",
  "Kannada_name": "Guddeechal, Mandeechal",
  "Origin": "Western Ghats",
  "Species type": "Endemic",
  "Phenology": "Evergreen",
  "Conservation_status": "Endangered",
  "Flowering_period": "December - February",
  "Fruiting_period": "December - February",
  "Uses": "The male cone scales are commonly sold for use as an anodyne in bazaars in India. The bark and the seeds are ground to a paste with oil and used as a poultice on sores, cuts, wounds, ulcers and swellings.",
  "Additional_information": null,
  "Description": "A dioecious cycad, slow growing, up to 6 m tall. Leaves pinnate, alternate, in spirals, 3 m long and 2 ft wide, glossy, dark green; leaflets -.5 inch wide; small spines line the petiole; leaf bases persistent. Male and female cones are borne on separate plants. Male cones, brown, up to 2 feet long, 5 inches thick, erect. Female cones leaflike, with each sporophyll bearing 6-1- large ovules on the margins. Mature seeds orange, smooth, 2.5 inches in diameter. "
 },
 {
  "S_No": 66,
  "Scientific_name": "Dalbergia latifolia",
  "Code": 66,
  "Common_name": "Indian rosewood",
  "Family_name": "Fabaceae",
  "Kannada_name": "Beete mara",
  "Origin": "Indian subcontinent",
  "Species type": "Indigenous",
  "Phenology": "Deciduous",
  "Conservation_status": "Vulnerable",
  "Flowering_period": "December - March",
  "Fruiting_period": "January - April",
  "Uses": "Wood from the tree is used in premium furniture making and cabinetry, guitar bodies and fretboards, Exotic veneers, carvings, boats, skis, and for reforestation. Medicines are made from the tannins in the bark, for diarrhoea, worms, indigestion, and leprosy.",
  "Additional_information": null,
  "Description": "Deciduous tree, up to 25 m high. Bark thick, grey, smooth with irregular cracks, blaze yellow to yellow-brown. Leaves imparipinnate, rarely 1-foliate, alternate, pulvinate; leaflets 3-9, alternate, orbicular, glabrous, coriaceous, base acute or very rarely trunctae, apex obtuse or emarginate, margin entire. Inflorescence axillary panicles. Flowers bisexual, white, 5-6 mm long. Fruit an indehiscent pod, oblong-lanceolate, tip obtuse, up to 7.5 cm; seeds 1-4, reniform and brown. "
 },
 {
  "S_No": 67,
  "Scientific_name": "Dalbergia melanoxylon",
  "Code": 67,
  "Common_name": "African blackwood",
  "Family_name": "Fabaceae",
  "Kannada_name": "-",
  "Origin": "Africa",
  "Species type": "Exotic",
  "Phenology": "Deciduous",
  "Conservation_status": "Near threatened",
  "Flowering_period": null,
  "Fruiting_period": null,
  "Uses": "The roots are used in traditional medicines to treat abdominal pain, diarrhoea and syphilis; the wood smoke is inhaled to treat headaches and bronchitis.",
  "Additional_information": null,
  "Description": "It is a spiny, deciduous shrub or tree, reaching 5–12 m tall, sometimes up to 3- m with grey bark , heartwood purplish-brown to black. Leaves pinnately compund, 8-2- cm long; 8-12 or more leaflets; leaflets circular to broadly elliptic or obovate, glabrous, slightly pubescent beneath, slightly cordate or cuneate at the base, apex emarginate or retuse, margin entire. Inflorescence a terminal or axillary panicle. Flowers white, fragrant, 3.5-5 mm long. Fruit a pod 3–7 cm long, elliptic-oblong, glabrous, 1-3 seeded. "
 },
 {
  "S_No": 68,
  "Scientific_name": "Dalbergia sissoo",
  "Code": 68,
  "Common_name": "North Indian rosewood, Shisham tree",
  "Family_name": "Fabaceae",
  "Kannada_name": "Beete mara",
  "Origin": "Indian subcontinent",
  "Species type": "Indigenous",
  "Phenology": "Deciduous",
  "Conservation_status": "Least concern",
  "Flowering_period": "March ",
  "Fruiting_period": "April - May",
  "Uses": "It is the best known economic timber species of the rosewood genus sold internationally, but it is also used as fuel wood and for shade and shelter.  In India, the wood has been used in Siddha medicine system for skin disorders and stomach-related issues. ",
  "Additional_information": "It is the larval food plant of the black rajah (Charaxes solon).",
  "Description": "Medium to large deciduous tree, up to 3- m high. Bark thin, grey, longitudinally furrowed.  Leaves imparipinnate, alternate, leaflets 3-5; leaflets broadly ovate or subobicular, glabrous when old, apex acuminate, margin entire. Inflorescnce an axillary panicle. Flowers yellowish-white. Fruit a pod, linear-oblong, strap shaped, 3.7-1- cm long, glabrous, 1-4 seeded. Seeds flattened. "
 },
 {
  "S_No": 69,
  "Scientific_name": "Delonix regia",
  "Code": 69,
  "Common_name": "Gulmohur",
  "Family_name": "Fabaceae",
  "Kannada_name": "Kempukenjiga, Kempu torai",
  "Origin": "Madagascar",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Least concern",
  "Flowering_period": "April - July",
  "Fruiting_period": "June - August",
  "Uses": "the seeds contain gum that may find use in textile and food industries.  It is mainly valued as a decorative tree, often being planted in avenues and gardens",
  "Additional_information": "There is a popular belief among Saint Thomas Christians of Kerala that when Jesus was crucified, there was a small gulmohur tree nearby his Cross. It is believed that the blood of Jesus Christ was shed over the flowers of the tree and this is how the flowers got a sharp red color.",
  "Description": "Large deciduous tree, up to 3- m tall. Bark greyish-brown, rough with conspicuous lenticels. Leaves bipinnate, up to 6- cm long, pinnae 11-18 pairs, leaflets in 2--3- pairs. Leaflets opposite, oblong, usually puberulent along the veins, base oblique, apex obtuse, margin entire. Inflorescence a terminal or axillary corymbose raceme. Flowers bright red to orange-red, 7-1- cm in diameter, stamens red. Fruit a pod, brown to blackish brown when mature, broadly linear, slightly curved, compressed, 3--5- cm long. Seeds 2--4-, mottled. "
 },
 {
  "S_No": 70,
  "Scientific_name": "Dimocarpus longan",
  "Code": 70,
  "Common_name": "Longan tree",
  "Family_name": "Sapindaceae",
  "Kannada_name": "Kendaala, Kanekendaala",
  "Origin": "Tropical Asia, China",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Near threatened",
  "Flowering_period": "December",
  "Fruiting_period": "June- July",
  "Uses": "The flesh of the fruit is administered as a stomachic, febrifuge and vermifuge, and is regarded as an antidote for poison. A decoction of the dried flesh is taken as a tonic and treatment for insomnia and neurasthenic neurosis.",
  "Additional_information": null,
  "Description": "Evergreen trees, up to 25 m high. Leaves pinnate, alternate, leaflets 3-6 pairs, oblong-elliptic to oblong lanceolate, glabrous, base broadly cuneate to truncate, apex acute, sometimes obtuse, margin entire. Inflorescence terminal or axillary panicles. Flower polygamous, yellowish-white. Fruit a schizocarp, globose, reddish-brown, tubercled, 1.5 cm across. Seed 1, black, covered by fleshy aril. "
 },
 {
  "S_No": 71,
  "Scientific_name": "Diospyros discolor",
  "Code": 71,
  "Common_name": "Velvet apple, Butter fruit",
  "Family_name": "Ebenaceae",
  "Kannada_name": "-",
  "Origin": "Taiwan",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": null,
  "Fruiting_period": null,
  "Uses": "A decoction of the young leaves is used as a treatment for hypertension, heart ailments and diabetes. The juice of unripe fruit is astringent. It is used as a wash for wounds. ",
  "Additional_information": null,
  "Description": "Large, evergreen, dioecious trees up to 3-m in height. Braches initially pubescent. Leaves simple, alternate, oblong-lanceolate, coriaceous, galbrous above, pubescent below, base obtuse, rounded or subcordate, apex sharp or rarely obtuse, margin revolute. Male flowers in axillary cymose inflorescences. Female flowers solitary, hairy flower. Flowers yellowish-green in colour. Fruit a berry, globose, lightly flattened, densely reddish hairy, reddish when ripe with whitish pulp."
 },
 {
  "S_No": 72,
  "Scientific_name": "Diospyros malabarica",
  "Code": 72,
  "Common_name": "Gaub tree, Malabar ebony",
  "Family_name": "Ebenaceae",
  "Kannada_name": "Holitupare",
  "Origin": "Indian subcontinent, South east Asia",
  "Species type": "Indigenous",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": "May - June",
  "Fruiting_period": "March - April (the following year)",
  "Uses": "The bark, leaves, flowers and fruits are much used in Ayurvedic medicine. The juice of the fresh bark is useful in the treatment of bilious fevers. The seeds are used as a treatment for diarrhoea and chronic dysentery. ",
  "Additional_information": null,
  "Description": "Evergreen, dioecious tree, up to 35 m tall. The bark is black, smooth, and the inner bark turns bluish on exposure to sunlight. Leaves simple, alternate or sub-opposite, oblong-lancelate, glabrous, acute or obtuse. Flowers unisexual, the male flowers are formed in 3-5 flowered cymes in leaf axils; Female flowers are solitary. Fruit a berry, globose, yellow when ripe, pulp glutinous; 4-8 seeded, compressed. "
 },
 {
  "S_No": 73,
  "Scientific_name": "Duabanga grandiflora",
  "Code": 73,
  "Common_name": "Duabanga",
  "Family_name": "Lythraceae",
  "Kannada_name": "-",
  "Origin": "India, Nepal, China",
  "Species type": "Indigenous",
  "Phenology": "Semi-deciduous",
  "Conservation_status": "Not known ",
  "Flowering_period": "April",
  "Fruiting_period": null,
  "Uses": "The fruits and leaves are boiled to make a black dye. The wood is used for purposes such as boxes and crates, tea boxes, furniture components, house and boat building, blockboard, fibre boards and pulp",
  "Additional_information": null,
  "Description": "Evergreen or semi-evergreen trees, growing up to 4- m.  Sparingly branched, branches are four-angled. Leaves simple, rigis, distichous, ovate to oblong, abaxially glaucous, base cordate, apex shortly acuminate. Inflorescence a corymb. Flowers bisexual white. Fruit a capsule, subglobose, 6-9 valved. Seeds 4-6 mm. "
 },
 {
  "S_No": 74,
  "Scientific_name": "Elaeis guineensis",
  "Code": 74,
  "Common_name": "African oil palm",
  "Family_name": "Arecaceae",
  "Kannada_name": "-",
  "Origin": "West and South Africa",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Least concern",
  "Flowering_period": "All year",
  "Fruiting_period": "All year",
  "Uses": "Palm oil extracted from this tree is popular in West Africa and Malaysia for cooking. Palm wine is the delicious wine obtained by tapping the base of the immature inflorescence of the oil palm. ",
  "Additional_information": null,
  "Description": "Stem erect, up to 3- m tall. Trunk covered by remains of leaf bases when young. Crown massive, 4--5- leaves arranged in several planes. Leaves pinnate, 8\/13 phyllotaxis, 1---15- leaflets on each side. Inflorescences either male or female, rarely both. Male flower with 3 chaffy sepals and 3 chaffy acute petals. Female flower accompanied by 2 abortive male flowers. Fruit broadly ellipsoid or ovoid, orange proximally and brown to blackish diatally, endocarp black. "
 },
 {
  "S_No": 75,
  "Scientific_name": "Elaeocarpus angustifolius",
  "Code": 75,
  "Common_name": "Blue marble tree",
  "Family_name": "Elaeocarpaceae",
  "Kannada_name": "-",
  "Origin": "Australia",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": null,
  "Fruiting_period": null,
  "Uses": "The seeds are valued as a remedy for blood pressure and heart ailments. The fruit is used in the treatment of diseases of the head and epileptic fits. The leaf sap is used to cure stomach-ache or pain in the chest and shoulders.",
  "Additional_information": "Fruit stones were used by native Australians for necklaces. The seeds are known as Rudraksha in India and are considered to be sacred.",
  "Description": "Evergreen trees, up to 3- m tall. Branchlets yellowish-brown, villous. Leaves simple, alternate oblong-obovate to oblong-lanceolate, membranous, villous when young, glabrescent when mature, base broadly cuneate, apex acute or obtuse, margin serrate. Inflorescence an axillary raceme. Flowers bisexual, creamish-white. Fruit a drupe, globular, glabrous, bright blue, 5 locular, one seed per locule, rugulose."
 },
 {
  "S_No": 76,
  "Scientific_name": "Enterolobium cyclocarpum",
  "Code": 76,
  "Common_name": "Monkey ear tree, Elephant ear tree",
  "Family_name": "Fabaceae",
  "Kannada_name": "-",
  "Origin": "Tropical America",
  "Species type": "Exotic",
  "Phenology": "Deciduous",
  "Conservation_status": "Not known ",
  "Flowering_period": "March - April",
  "Fruiting_period": null,
  "Uses": "Bark extracts are used medicinally against colds and bronchitis. The wood is resistant to attack by dry-wood termites and Lyctus, and can be used in house construction as well as in interior elements, including panelling. The wood is also excellent for producing quality paper.",
  "Additional_information": null,
  "Description": "Medium-sized to large deciduous tree, up to 3- m tall. Crown spreading, thin; young branchlets, leaves and inflorescences white pubescent. Leaves bipinnate, alternate; pinnae 3-9 pairs; leaflets 12 -3- pairs, falcate-lanceolate, sparsely pubescent, base truncate, apex mucronate, margin entire. Inflorescence a head. Flowers bisexual, greenish or white, stamens numerous. Fruit an indehiscent pod, black-brown, curved, auriculate-reniform, flesh and rounded. Seeds 1--2- arranged in 2 rows, dark brown and shiny. "
 },
 {
  "S_No": 77,
  "Scientific_name": "Eucalyptus globulus",
  "Code": 77,
  "Common_name": "Southern Blue gum",
  "Family_name": "Myrtaceae",
  "Kannada_name": "Neelagiri",
  "Origin": "Australia",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known ",
  "Flowering_period": "December - May",
  "Fruiting_period": null,
  "Uses": "The leaves are steam distilled to extract eucalyptus oil which has therapeutic, perfumery, flavoring, antimicrobial and biopesticide properties. The leaves are used in herbal tea.",
  "Additional_information": null,
  "Description": "Large trees, up to 45 m tall. The bark is usually smooth, white to cream-coloured but rough and brownish bark at base. Young leaves opposite, sessile, ovate. Leaves simple, alternate, lancelate, falcate, coriaceous, both surfaces glandular, apex acuminate, margin entire. Inflorescence an  axillary umbel. Flowers sessile, bisexual, operculum flattened, hypanthium as wide as operculum. Fruit obconic to hemspherical, glaucous, 1-2.1 cm long, 3-5 valves. Seeds flattened and ellipsoid. "
 },
 {
  "S_No": 78,
  "Scientific_name": "Ficus altissima",
  "Code": 78,
  "Common_name": "Council tree, Lofty fig",
  "Family_name": "Moraceae",
  "Kannada_name": "-",
  "Origin": "Southeast Asia",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Least concern",
  "Flowering_period": null,
  "Fruiting_period": null,
  "Uses": "The tree is planted as a pioneer species in northern Thailand in reforestation projects to restore native woodland. The fibrous bark is used for cordage.",
  "Additional_information": null,
  "Description": "Large semi-evergeen trees, 25-3- m tall, with aerial roots. Bark grey and rough. Leaves simple,  broadly ovate to broadly ovate-elliptic, glabrous above, glabrescent beneath, coriaceous, base broadly cuneate, apex obtuse, margin entire. Inflorescence a syconium. Figs axillary on leafy branchlets, paired, red or yellow when mature, ellipsoid-ovoid; involucral bracts hoodlike, covering young fig, caducous, apex broadly obtuse, scar ringlike. Male, gall, and female flowers within same fig. Fruit a achenes, tuberculate."
 },
 {
  "S_No": 79,
  "Scientific_name": "Ficus amplissima",
  "Code": 79,
  "Common_name": "Indian bat tree",
  "Family_name": "Moraceae",
  "Kannada_name": "Bilibasari mara",
  "Origin": "Western ghats, Sri Lanka",
  "Species type": "Indigenous",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known ",
  "Flowering_period": "December - January",
  "Fruiting_period": "December - February",
  "Uses": "It has been traditionally used in Ayurveda, Siddha, and Unani medicine for the treatment of diabetes. The bark of the tree is a natural anti-diabetic and anti-oxidant medicine, reducing blood glucose levels. The phenol in leaves gives the foliage anti-inflammatory and wound healing properties. In native medicine, leaf juice is applied on chronic wounds and the latex is applied on fresh wounds.The figs are chewed and their juice is sucked to treat mouth ulcers.",
  "Additional_information": null,
  "Description": "A large deciduous tree, up to 18 m tall. Bark-greenish-grey, young shoots whitish puberulous to vinous. Leaves simple, coriaceous, ovate or elliptic-lanceolate to ovate-oblong, glabrous, coriaceous, base rounded to cuneate, acute or obtusely acuminate at apex, stipules ovate-lanceolate. Inflorescence a syconium. Hypanthodia monoecious, sessile, in axillary pairs and around old leaf scars, depressed globular or obovoid, glabrous to puberulous basal bracts. Male flowers: few, disperse, stamen single. Female flowers: sessile; ovary white. Figs depressed-globose to pyriform, pink to purple, smooth achenes. "
 },
 {
  "S_No": 80,
  "Scientific_name": "Ficus benghalensis",
  "Code": 80,
  "Common_name": "Banyan tree, Strangler fig",
  "Family_name": "Moraceae",
  "Kannada_name": "Aalada mara",
  "Origin": "Indian subcontinent",
  "Species type": "Indigenous",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known ",
  "Flowering_period": "March - April",
  "Fruiting_period": "March - May",
  "Uses": "The leaves are used to remedy dysentery and diarrhoea. They are used in a decoction with toasted rice as a diaphoretic. The young leaves are heated and used as a poultice. The bark is tonic and diuretic. A decoction of the root fibres is useful as a treatment against gonorrhoea, whereas the tender ends of the aerial roots are used for obstinate vomiting.",
  "Additional_information": "The tree is considered sacred in India, and temples are often built nearby. It is the tree under which Lord Adhinath the first Jain Tirthankara attained Kewal Gyan or spiritual enlightenment.",
  "Description": "A large, evergreen to deciduous tree, up 25 m tall, pillar-like prop roots and accessory trunks. Trunk massive, fluted, bark grey, smooth, young softly white puberulous. Leaves with stout, hairy petiole; simple, ovate or obovate to elliptic, glabrous above, finely pubescent beneath, coriaceous, base subcordate or rounded, apex obtuse, margin entire, cystoliths abundant on side, few or absent below. Inflorescence a syconium. Hypanthodia sessile, in axillary pairs on young depressed-globose, green, hairy, minutely hairy basal bracts, Male flowers: numerous ostiolar; stamen solitary, with shortly mucronate anther. Female flowers: sessile, mixed with gall flowers, small. Gall flowers numerous, pedicellate. Figs globose to depressed-globose, pinkish-red, hairy."
 },
 {
  "S_No": 81,
  "Scientific_name": "Ficus benjamina",
  "Code": 81,
  "Common_name": "Weeping fig",
  "Family_name": "Moraceae",
  "Kannada_name": "Java atthi",
  "Origin": "Asia, Australia",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known ",
  "Flowering_period": null,
  "Fruiting_period": null,
  "Uses": "The pounded leaves and bark are applied as a poultice in the treatment of rheumatic headaches. The wood is of low quality, but is used for temporary constructions, mouldings, interior work, cladding, drawers, small domestic articles, fruit crates etc.",
  "Additional_information": null,
  "Description": "Evergreen trees, to 3- m tall. Bark gray to gray-white, smooth. Main branches producing aerial roots which can develop into new trunks; branchlets gray-white, pendulous, glabrous. Leaves simple, blade ovate to broadly elliptic, glabrous, coriaceous, base rounded to cuneate, margin entire, apex shortly acuminate. Inflorescence a syconium. Figs axillary on leafy branchlets, paired or solitary. Male, gall, and female flowers within same fig. Male flowers: few, shortly pedicellate; stamen 1. Gall flowers: many. Female flowers: sessile. Fruit an achene, ovoid-reniform, shorter than persistent style. Figs purple, red, or yellow [or red with white dots] when mature, globose to depressed globose or sometimes pear-shaped, glabrous or pubescent, base attenuate into stalk, sessile. "
 },
 {
  "S_No": 82,
  "Scientific_name": "Ficus drupacea",
  "Code": 82,
  "Common_name": "Mysore fig",
  "Family_name": "Moraceae",
  "Kannada_name": "Goni mara",
  "Origin": "Southeast Asia, Australia",
  "Species type": "Indigenous",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": "January - April",
  "Fruiting_period": "January - April",
  "Uses": "The roots are an effective vulnerary when powdered and applied to wounds.",
  "Additional_information": null,
  "Description": "Deciduous trees, 1--15 m tall. Bark grayish white, densely yellowish brown woolly. Leaves simple, narrowly elliptic to obovate-elliptic, coriaceous, glabrous or abaxially yellowish brown woolly but glabrescent, adaxially green and glabrous or sparsely shortly pubescent or densely yellowish brown long pubescent but glabrescent, base rounded or cordate to auriculate, apex acute, margin entire or slightly undulate. Inflorescence a syconium. Figs axillary on leafy branchlets, paired, reddish orange to red and with scattered white spots, oblong, pillow-shaped, or conic-ellipsoid, glabrous or densely covered with brownish yellow long hairs. Male, gall, and female flowers within same fig. Male flowers: long-pedicellate, stamen 1, anther narrowly ellipsoid. Gall flowers: pedicellate; sepals connate, apically 3- or 4-lobed; Female flowers: white, broadly lanceolate. Fruit achenes, tuberculate. "
 },
 {
  "S_No": 83,
  "Scientific_name": "Ficus elastica",
  "Code": 83,
  "Common_name": "Rubber fig",
  "Family_name": "Moraceae",
  "Kannada_name": "-",
  "Origin": "South and Southeast Asia",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": null,
  "Fruiting_period": null,
  "Uses": "It is grown as an ornamental plant.",
  "Additional_information": null,
  "Description": "Large, evergreen trees, 2--3- m tall. Bark pale gray, smooth. Branchlets strong. Leaves simple, oblong to elliptic, coriaceous, glabrous, base broadly cuneate, apex abruptly short-acuminate or apiculate, margin entire. Inflorescence a syconium. Figs axillary on leafless branchlets, paired, yellowish green to pale yellow, ovoid-ellipsoid, subsessile. Male, gall, and female flowers within same fig. Male flowers: scattered among other flowers, pedicellate, stamen 1, anther ovoid-ellipsoid. Gall flowers: sepals 4. Female flowers: sessile; style persistent, long. Achenes ovoid, tuberculate.  "
 },
 {
  "S_No": 84,
  "Scientific_name": "Ficus hispida",
  "Code": 84,
  "Common_name": "Hairy fig, Opposite leaf fig",
  "Family_name": "Moraceae",
  "Kannada_name": "Kaadatthi, Adavi atthi, Kallatthi",
  "Origin": "Asia, Australia",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": "June - July",
  "Fruiting_period": "June - July",
  "Uses": "The bark  is antiperiodic, emetic and tonic. The juice of the root is used in treatment of fevers and the juice of the fig is used to treat liver problems.",
  "Additional_information": null,
  "Description": "Shrubs or small trees, up to 1- m tall, coarsely hairy; dioecious. Leaves simple, opposite, ovate, oblong, or obovate-oblong, thickly papery, abaxially with coarse gray hairs, adaxially rough and with short thick hairs, base rounded to cuneate, apex acute to mucronate, margin entire or bluntly toothed. Inflorescence a syconium. Figs axillary on normal leafy shoots, sometimes on leafless branchlets or branchlets from main branches, solitary or paired, yellow or red when mature, top-shaped, pedunculate; involucre bracts present; lateral bracts sometimes present. Male flowers: many, near apical pore, stamen 1. Gall flowers: calyx absent, short, thick. Female flowers: calyx lobes absent; style lateral, with hairs. "
 },
 {
  "S_No": 85,
  "Scientific_name": "Ficus microcarpa",
  "Code": 85,
  "Common_name": "Chinese banyan, Curtain fig",
  "Family_name": "Moraceae",
  "Kannada_name": "Kirigoli, Kirugoli",
  "Origin": "Tropical and sub tropical region of Asia.",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Least concern",
  "Flowering_period": "March - May",
  "Fruiting_period": "March - May",
  "Uses": "bark is used therapeutically in the treatment of raktapitta (bleeding) doshas, ulcers, skin diseases, burning sensation, inflammation, and oedema.",
  "Additional_information": null,
  "Description": "Evergreen trees, 15-25 m tall, crown wide, bark dark gray. Branches producing rust-colored aerial roots when old. Leaves simple, alternate, narrowly elliptic, glabrous to puberulous, base cuneate, apex obtuse to subacute, rarely retuse, margin entire; basal lateral veins long. Figs axillary on leafy branchlets or on leafless older branchlets, paired, yellow to slightly red when mature, depressed globose, inside with a few short bristles among flowers, sessile. Male, gall, and female flowers within same fig. Male flowers: scattered, sessile or pedicellate; filament as long as anther. Gall and female flowers: sepals 3, broadly ovate; style lateral; stigma short, clavate. Achenes ovoid. "
 },
 {
  "S_No": 86,
  "Scientific_name": "Ficus neriifolia",
  "Code": 86,
  "Common_name": "Willow-leaf fig",
  "Family_name": "Moraceae",
  "Kannada_name": "-",
  "Origin": "Bhutan, Burma, China, India, Nepal",
  "Species type": "Indigenous",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": null,
  "Fruiting_period": null,
  "Uses": "The latex from the plant is applied to boils on the tongue. The juice of the stem bark is used as a folk remedy for conjunctivitis and boils. It is also pruned and grown as a bonsai. ",
  "Additional_information": null,
  "Description": "Deciduous trees, to 15 m tall. Bark dark gray, smooth. Branchlets green to pale green, leaf traces and stipular scars conspicuous. Leaves simple, elliptic, ovate, ovate-elliptic, both surfaces glabrous and green, abaxially densely covered with cystoliths, adaxially smooth, base cuneate to rounded, apex acuminate to caudate, margin entire. Inflorescence a syconium. Figs axillary on leafy or older leafless branches, paired, narrowly cylindric, ovoid, carpodermis thick or thin and with or without stone cells, inside without bristles, apical pore navel-like, sessile. Male flowers: many, pedicellate; calyx lobes 3 or 4, ovate-lanceolate; stamens 2 or 3. Gall flowers: few; ovary ovoid, short. Female and gall flowers: calyx lobes 3 or 4; female flowers: ovary globose; style thin. Achenes smooth. "
 },
 {
  "S_No": 87,
  "Scientific_name": "Ficus racemosa",
  "Code": 87,
  "Common_name": "Cluster fig",
  "Family_name": "Moraceae",
  "Kannada_name": "Atthi mara",
  "Origin": "Australia, Tropical Asia",
  "Species type": "Exotic",
  "Phenology": "Deciduous",
  "Conservation_status": "Least concern",
  "Flowering_period": "January - April",
  "Fruiting_period": "March - July",
  "Uses": "The bark is rubbed on a stone with water to make a paste, which can be applied to boils or mosquito bites. The rough leaves of the plant can also be used to remove caterpillar bristles lodged in skin. A common folk remedy is to rub the affected area lightly with a leaf, which effectively dislodges the stinging hairs.",
  "Additional_information": null,
  "Description": "Evergreen to occasionally deciduous trees, 25-3- m tall. Bark grayish brown, smooth. Branchlets, young leaf blades, and figs with bent hairs or densely covered with white soft pubescence. Branchlets brown. Leaves simple, alternate, elliptic-obovate, elliptic, or narrowly elliptic, abaxially pale green, pubescent when young, glabrescent, adaxially dark green and glabrous, base cuneate to obtuse, apex acuminate to obtuse, margin entire. Figs in a tumorlike aggregate on short branchlets of old stem, occasionally axillary on leafy shoot or on older leafless branchlets, paired, reddish orange when mature, pear-shaped. involucral bracts triangular-ovate. Male, gall, and female flowers within same fig. Male flowers: near apical pore, sessile; calyx lobes 3 or 4; stamens 2. Gall and female flowers: pedicellate; calyx lobes linear, apex 3- or 4-toothed; style lateral; stigma clavate. "
 },
 {
  "S_No": 88,
  "Scientific_name": "Ficus religiosa",
  "Code": 88,
  "Common_name": "Sacred fig",
  "Family_name": "Moraceae",
  "Kannada_name": "Arali mara",
  "Origin": "Indian subcontinent",
  "Species type": "Indigenous",
  "Phenology": "Deciduous",
  "Conservation_status": "Least concern",
  "Flowering_period": "November - December",
  "Fruiting_period": "April - May",
  "Uses": "Ficus religiosa is used in traditional medicine for about fifty types of disorders including asthma, diabetes, diarrhea, epilepsy, gastric problems, inflammatory disorders, infectious and sexual disorders.",
  "Additional_information": null,
  "Description": "Deciduous or semievergreen trees, 15-25 m tall, epiphytic when young. Bark gray, smooth, exudation milky. Branchlets grayish brown, sparsely pubescent when young. Leaves simple, alternate, leaf blade triangular-ovate, coriaceous, abaxially green, adaxially dark green and shiny, base broadly cuneate to cordate, apex acuminate-caudate, margin entire or undulate. Inflorescence a syconium. Figs axillary on leafy branchlets, paired or solitary, with no internal bristles, red when mature, globose to depressed globose, smooth. Flowers unisexual; male flowers, ostiolar, sessile in one ring; female flowers sessile, brownish, glabrous; gall flowers similar to female. Achenes smooth.  "
 },
 {
  "S_No": 89,
  "Scientific_name": "Ficus virens",
  "Code": 89,
  "Common_name": "White fig",
  "Family_name": "Moraceae",
  "Kannada_name": "Basari mara, Kari basari",
  "Origin": "Pakistan, India, Southeast Asia, Australia",
  "Species type": "Indigenous",
  "Phenology": "Deciduous",
  "Conservation_status": "Not known",
  "Flowering_period": null,
  "Fruiting_period": null,
  "Uses": "A decoction of the bark is used as an injection in the treatment of leucorrhoea. Applied externally, a bark decoction is used as a wash on ulcers and as a gargle in salivation.",
  "Additional_information": null,
  "Description": "Deciduous or semideciduous trees, epiphytic when young, with buttress or prop roots. Bark greenish-grey, smooth. Leaves simple, alternate, obovate, narrowly lanceolate, ovate-lanceolate, or elliptic-ovate, thin coriaceous, base bluntly rounded, cuneate, or cordate, apex acuminate to shortly acuminate, margin entire. Inflorescence a syconium. Figs axillary on leafy branchlets, paired or solitary or in clusters on leafless older branchlets, purple red when mature, globose. Flowers unisexual, within the same fig. Male flowers few, near apical pore, sessile; female and gall flowers pedicellate. Achenes wrinkled on surface. "
 },
 {
  "S_No": 90,
  "Scientific_name": "Filicium decipiens",
  "Code": 90,
  "Common_name": "Fern tree",
  "Family_name": "Sapindaceae",
  "Kannada_name": "Kaadu hoovarasi",
  "Origin": "Western Ghats",
  "Species type": "Endemic",
  "Phenology": "Evergreen",
  "Conservation_status": "Least concern",
  "Flowering_period": "October - December",
  "Fruiting_period": "October - December",
  "Uses": "It is traditionally used as anti-diabetic agent in India and Sri Lanka . It also showed a variety of biological activities, such as anti-fungal, anti-bacterial, anti-inflammatory, antioxidant and mollusicicidal activities",
  "Additional_information": null,
  "Description": "Small or medium sized evergreen tree, 4.5-2- m tall. Bark smooth, whitish. Leaves pinnate, alternate, petiole winged; leaflets 5-1- pairs, sub-opposite or alternate, lanceolate to linear or narrowly oblong-elliptic, glabrous, base acute, apex acute and minutely emarginate, margin entire, crisped-undulate, resinous when young. Inflorescence a terminal panicle. Flowers polygamous, yellow. Fruit a drupe, ellipsoid or subglobose, 1-1.5 cm long, smooth, dark purple. "
 },
 {
  "S_No": 91,
  "Scientific_name": "Flueggea leucopyrus",
  "Code": 91,
  "Common_name": "Bushweed",
  "Family_name": "Phyllanthaceae",
  "Kannada_name": "Bilihuli, Kandekuvana",
  "Origin": "Africa, South America",
  "Species type": "Exotic",
  "Phenology": "Deciduous",
  "Conservation_status": "Not known",
  "Flowering_period": "April - July",
  "Fruiting_period": "June - September",
  "Uses": "The leeaves are considered as aphrodisiac and laxative. The bark is an astringent. The fruit, mixed with pulses, is eaten to relieve digestive disorders. ",
  "Additional_information": null,
  "Description": "It is an erect shrub 1.5-4 m tall with branches cylindrical or obtusely angular when young, grey, ending in spines. Leaves simple, alternate, elliptic, obovate, or round, membranous, glabrous, base cuneate, apex emarginate, margin entire. Male inflorescence a cyme, female inflorescence sub-solitary. Flowers unisexual, tiny, yellowish or greenish-white. Fruit is a nearly spherical capsule, about 4 mm in diameter, whitish when ripe. Seed 1, globose. "
 },
 {
  "S_No": 92,
  "Scientific_name": "Garcinia livingstonei",
  "Code": 92,
  "Common_name": "African mangosteen",
  "Family_name": "Clusiaceae",
  "Kannada_name": "-",
  "Origin": "South Africa",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": "June-September",
  "Fruiting_period": "June-September",
  "Uses": "The root and bark of Garcinia livingstonei possess therapeutic properties and are used for preventing development of cancer and even tuberculosis. The plant possesses antioxidant properties too.",
  "Additional_information": null,
  "Description": "Evergreen tree, up to 18 m tall. Trunks are short, often twisted, occasionally multi stemmed. Bark reddish brown to dark grey, with shallow grooves or deeply fissured, ridged and scaly, exuding yellow or red resinous latex when cut. Leaves are simple, in whorls of 3, coriaceous, brittle, variable in shape, lanceolate or oblanceolate to oblong or obovate, glabrous, base broadly cuneate, rounded or cordate, apex acute to rounded, margin crenate or entire. Inflorescence a fascicle. Flowers polygamous, white or pale to yellowish green. Fruits ovoid to round berries, orange yellow, reddish, or purple; 1-2 seeded. Seeds are creamy brown."
 },
 {
  "S_No": 93,
  "Scientific_name": "Gliricidia sepium",
  "Code": 93,
  "Common_name": "Mexican lilac tree",
  "Family_name": "Fabaceae",
  "Kannada_name": "Gobbarada mara",
  "Origin": "Mexico, Central America",
  "Species type": "Exotic",
  "Phenology": "Deciduous",
  "Conservation_status": "Not known",
  "Flowering_period": "November - December",
  "Fruiting_period": "January - February",
  "Uses": "The whole plant is a folk remedy for various conditions such as but not limited to colds, cough, fever, headache, bruises, burns, rheumatism, ulcers, and wounds.",
  "Additional_information": null,
  "Description": "Medium-sized, deciduous tree, 1-–12 m high. The bark is smooth, and its color can range from a whitish gray to deep red-brown. Leaves imparipinnate, usually alternate, sometimes subopposite; leaflets 5-2-, opposite to rarely subopposite or alternate, ovate or elliptic, glabrous above, pubescent below, base slightly revolute, apex acute or acuminate, margin entire. Inflorescence a raceme. Flowers bisexual, bright pink to lilac color that is tinged with white, yellowish at base. Fruit a dehiscent pod, yellow-brown when ripe. Seeds 4-1-, dark brown, oblong. "
 },
 {
  "S_No": 94,
  "Scientific_name": "Grevillea robusta",
  "Code": 94,
  "Common_name": "Silver oak tree",
  "Family_name": "Proteaceae",
  "Kannada_name": "-",
  "Origin": "Australia",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": "March - May",
  "Fruiting_period": "May - October",
  "Uses": "They were also used by Australian Aborigines as traditional bush medicines to treat wounds and sores, skin diseases, diarrhoea and dysentery and as bactericidal preparations. Some studies have also reported antibacterial activity for several Grevillea spp.",
  "Additional_information": null,
  "Description": "Evergreen, erect tree, up to 3- m high. The bark is dark grey and furrowed. Leaves pinnate, alternate; leaflets 7-19, sessile, olive green above, silver grey silky hairy beneath, lanceolate, glabrous, base cuneate, apex acute, entire or pinnatifid, margin recurved. Inflorescence a raceme. Flowers bisexual, glabrous, yellowish orange, or sometimes reddish. Fruit a follicle, 2 silver-grey to olive green, dehiscent. Seeds 2, broadly winged, thin, ovate. "
 },
 {
  "S_No": 95,
  "Scientific_name": "Guazuma ulmifolia",
  "Code": 95,
  "Common_name": "West Indian elm",
  "Family_name": "Malvaceae",
  "Kannada_name": "Rudraakshi",
  "Origin": "Central America, Java",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": "All year",
  "Fruiting_period": "All year",
  "Uses": "It is used in the treatment of diarrhea, hemorrhages, fever, coughs, bronchitis, asthma, gastrointestinal pain and hypertension, and as stimulant for uterine contractions. Dried leaves are brewed into tea in some countries and used for kidney and gastrointestinal diseases, fever, dysentery and diabetes, and externally as an ailment for wounds, skin eruptions and even baldness. ",
  "Additional_information": null,
  "Description": "Deciduous tree, up to 25 m tall. Young branches puberulent. Leaves simple, alternate, ovate to lanceolate, membranous to chartaceous, scabrous above, velvety below, base oblique, apex acuminate, margin serrate to dentate. Inflorescence axillary or terminal, thyrsiform cyme. Flowers small, bisexual, brown-yellow color. Fruit a capsule, globose or oblong-ellipsoid, black, tuberculate. "
 },
 {
  "S_No": 96,
  "Scientific_name": "Handroanthus chrysotrichus",
  "Code": 96,
  "Common_name": "Golden-haired trumpet tree",
  "Family_name": "Bignoniaceae",
  "Kannada_name": "-",
  "Origin": "Brazil",
  "Species type": "Exotic",
  "Phenology": "Semi-deciduous",
  "Conservation_status": "Not known",
  "Flowering_period": "April - May",
  "Fruiting_period": "April",
  "Uses": "Its flowers, stem and bark are used for medicinal purposes in the treatment of cardiovascular and immune system diseases.",
  "Additional_information": null,
  "Description": "Small deciduous tree with a rounded crown, 2-1- m high. Young braches subtetragonous to subterete, with starry trichomes when young, glabrescent. Leaves palmate, 3-5 foliate; petiole with starry trichomes; leaflets oblong-ovate to oblong-elliptical, chartaceous, lepidotes present, scabrous, stellate trichomes, base obtuse to truncate, apex obtuse or rounded to abruptly cuspidated-subacumined, margin entire, rarely dentate at the apex. Inflorescence a terminal glomerule. Flowers bisexual, tubular, golden yellow with red in throat, stellate trichomes present. Fruit a capsule, linear-cylindrical, reddish, hairy with bearded trichomes. Seeds with hyaline membranous wing. "
 },
 {
  "S_No": 97,
  "Scientific_name": "Handroanthus impetiginosus",
  "Code": 97,
  "Common_name": "Pink trumpet tree",
  "Family_name": "Bignoniaceae",
  "Kannada_name": "-",
  "Origin": "South and Central America",
  "Species type": "Exotic",
  "Phenology": "Deciduous",
  "Conservation_status": "Least concern",
  "Flowering_period": "Febrauary - March",
  "Fruiting_period": "-",
  "Uses": " it is used as a remedy for inflammation, cancer, syphilis, malaria, fevers, trypanosomiasis, fungal infections, bacterial infections and stomach ulcers.",
  "Additional_information": null,
  "Description": "Large deciduous tree, up to 25 m high. Bark smooth, grey, wood greenish-brown,; twigs terete, glabrous. Leaves palmate, 5-7 foliate, opposite; leaflets ovate to elliptical, chartaceous to membranous, lepidote, pubescent, base cuneate to rounded, apex acuminate, margin entire or serrulate. Inflorescence a terminal panicle. Flower large, tubular, pinkish- purple to deep magenta, pubescent. Fruit a capsule, elongated-cylindrical, attenuate at both ends, glabrous, 12-56 cm long. Seeds with hyaline wings.  "
 },
 {
  "S_No": 98,
  "Scientific_name": "Holoptelea integrifolia",
  "Code": 98,
  "Common_name": "Indian elm tree, Jungle cork tree",
  "Family_name": "Ulmaceae",
  "Kannada_name": "Tapasi mara, Raahubeeja, Navule",
  "Origin": "Indian subcontinent, Myanmar, Indo-China",
  "Species type": "Indigenous",
  "Phenology": "Deciduous",
  "Conservation_status": "Not known",
  "Flowering_period": "January - February",
  "Fruiting_period": "April - May",
  "Uses": "The bark and leaves are used for treating oedema, diabetes, leprosy and other skin diseases, intestinal disorders, piles and sprue. The seed and a paste of the stem bark is used in treating ringworm.",
  "Additional_information": null,
  "Description": "Large Deciduous tree, about 2-–25 m tall, bark whitish grey to brown, bruised bark and crushed leaves give a strong smell, brachlets pubescent.  Leaves simple,  alternate, elliptic-ovate, ovate-oblong or ovate, coriaceous, glabrous above, pubescent below, base rounded or subcordate, apex acuminate, margin entire, distinctly serrate when young. Inflorescnece a axillary fascicle.  Flowers polygamous, greenish-purple, pubescent; female flowers with longer pedicels. Fruit a samara, 3 cm across, orbicular, wings nerved, glabrous, seed one and flat. "
 },
 {
  "S_No": 99,
  "Scientific_name": "Jacaranda mimosifolia",
  "Code": 99,
  "Common_name": "Jacaranda",
  "Family_name": "Bignoniaceae",
  "Kannada_name": "-",
  "Origin": "South America",
  "Species type": "Exotic",
  "Phenology": "Deciduous",
  "Conservation_status": "Vulnerable",
  "Flowering_period": "March - May",
  "Fruiting_period": "October - November",
  "Uses": "The bark and roots are used in the treatment of syphilis. The tree creates pleasant open shade and can be used effectively as a screen or as a windbreak. It is also used as an ornamental plant.",
  "Additional_information": null,
  "Description": " Deciduous tree, up to 2- m. Bark is thin, grey-brown, smooth when the tree is young but eventually becoming finely scaly. Leaves bipinnate, opposite, pinnae 12-31 pinnae, 13-41 sessile leaflets; leaflets narrowly elliptic, chartaceous, glabrous, or slightly puberulous along midrib and margin, base cuneate, apex acuminate, margin slightly revolute. Inflorescence an open terminal panicle. Flowers bisexual, purplish-blue or lilac, pubescent on the outside. Fruit a capsule, compressed, orbicular, reddish-brown, woody. Seeds thin, winged with brownish streaks. "
 },
 {
  "S_No": 100,
  "Scientific_name": "Khaya grandifoliola",
  "Code": 100,
  "Common_name": "African Mahagony, Benin Mahogany",
  "Family_name": "Meliaceae",
  "Kannada_name": "-",
  "Origin": "Africa",
  "Species type": "Exotic",
  "Phenology": "Deciduous",
  "Conservation_status": "Vulnerable",
  "Flowering_period": null,
  "Fruiting_period": null,
  "Uses": "The bitter-tasting bark is used in traditional medicine. It is widely used as a treatment against fever caused by malaria, whilst decoctions are also taken to treat stomach complaints including gastric ulcers and diarrhoea caused by intestinal parasites.",
  "Additional_information": null,
  "Description": "It is a semi-Deciduous tree growing but up to 3- m, bark dark brown to greyish, buttressed. Leaves paripinnate, leaflets 3-5 pairs; leaflets opposite or subopposite, broadly elliptical, oval-elliptical, coriaceous, base acute or slightly rounded, apex abruptly acuminate, margin undulate. Young foliage reddish. Inflorescence a panicle. Flowers bisexual, yellowish-white. Fruit a dehiscent capsule, woody, round, 4-5 valves. Seeds numerous, winged, reddish-brown. "
 },
 {
  "S_No": 101,
  "Scientific_name": "Kigelia pinnata",
  "Code": 101,
  "Common_name": "Sausage tree",
  "Family_name": "Bignoniaceae",
  "Kannada_name": "Aanethoradu Kaayi, Mara southe",
  "Origin": "Tropical Africa",
  "Species type": "Exotic",
  "Phenology": "Semi-deciduous",
  "Conservation_status": "Not known",
  "Flowering_period": "August - October",
  "Fruiting_period": "December - June",
  "Uses": "It  is used in a number of skin care products. The timber is used for makoros, yokes and oars. The bark and fruit are combined and used to heal sores and to restore taste. An oily ointment is made from the powder to rub on rheumatic parts and on malignant tumours. The leaves are sometimes used to treat rheumatism, malaria, infertility, epilepsy, headache, dysentery, stomach and kidney complaints",
  "Additional_information": "The fresh fruit is poisonous and strongly purgative",
  "Description": "Tree growing up to 2- m tall with spreading branches. The bark is grey, occasionally brown, smooth at first, peeling on older trees. Leaves imparipinnate, opposite or sub-opposite, 7-9 leaflets; leaflets elliptic to elliptic-obovate, pubescent, base rounded or acute to cuneate, apex rounded, obtuse or acute to acuminate, margin entire to serrate. Inflorescence a terminal panicle. Flowers bisexual, bell shaped, yellow outside, turning orange or red and with dark red to blackish inside. Fruit an indehiscent woody berry, up to 1m long, pendulous, sausage shaped. Seeds numerous embedded in the pulp. "
 },
 {
  "S_No": 102,
  "Scientific_name": "Lagerstroemia duperreana",
  "Code": 102,
  "Common_name": "Thorel's crepe myrtle",
  "Family_name": "Lythraceae",
  "Kannada_name": "-",
  "Origin": "Cambodia, Thailand, Vietnam",
  "Species type": "Exotic",
  "Phenology": "Deciduous",
  "Conservation_status": "Not known",
  "Flowering_period": "July - September",
  "Fruiting_period": null,
  "Uses": null,
  "Additional_information": null,
  "Description": "Deciduous trees 25-3- m tall. Branches terete, glabrous. Leaves simple, oblong-ovate, glabrous, base obtuse or rounded, apex emarginate, rounded or briefly acuminate, margin entire. Inflorescence a terminal panicle. Flowers bisexual, purple or lilac with crumpled petals. The flowers fade to white. Fruit a capsule, ovoid. 1.3 cm long. "
 },
 {
  "S_No": 103,
  "Scientific_name": "Lagerstroemia indica",
  "Code": 103,
  "Common_name": "Crape myrtle",
  "Family_name": "Lythraceae",
  "Kannada_name": "-",
  "Origin": "Indian Subcontinent, Southeast Asia",
  "Species type": "Indigenous",
  "Phenology": "Deciduous",
  "Conservation_status": "Not known",
  "Flowering_period": "June - September",
  "Fruiting_period": "September - November",
  "Uses": "The stem bark is febrifuge, stimulant and styptic. The bark, flowers and leaves are considered to be hydrogogue and a drastic purgative. A paste of the flowers is applied externally to cuts and wounds. The root is astringent, detoxicant and diuretic. A decoction of the flowers is used in the treatment of colds",
  "Additional_information": null,
  "Description": "Deciduous shrubs or small trees, up to 1- m tall. The bark is thin, smooth, whitish-grey. Branchlets 4-angled or subalate, puberulous, glabrescent. Leaves simple, sessile, alternate, oblong or obovate, obovate-orbicular, coriaceous, glabrous on maurity, base cuneate or narrow, apex subobtuse or subacute, margin entire. Inflorescence a panicle. Flowers bisexual, pink, rose or white. Fruit a dehiscent capsule, suborbicular, clawed, 4-6 valved. Seeds winged. "
 },
 {
  "S_No": 104,
  "Scientific_name": "Lagerstroemia microcarpa",
  "Code": 104,
  "Common_name": "Ben teak tree",
  "Family_name": "Lythraceae",
  "Kannada_name": "Bilinandi, Belandaru",
  "Origin": "Western Ghats",
  "Species type": "Endemic",
  "Phenology": "Deciduous",
  "Conservation_status": "Not known",
  "Flowering_period": "June - February",
  "Fruiting_period": "June - February",
  "Uses": "It is good for charcoal and fuel wood. Bark and leaves contain of tannin which is used for making skins.",
  "Additional_information": "It is known as \"Nude Lady of the Forest\" for its soft and smooth bark resembling the \"thigh of woman.\"",
  "Description": "Deciduous trees, upto 25m tall. Bark smooth, white and peeling. Leaves simple, opposite, sometimes upper leaves alternate; elliptic, glabrous, white velvety beneath, base acute, apex acute to acuminate, margin entire. Inflorescence a terminal or axillary panicle. Flowers bisexual, 5-6 mm across, white, clawed. Fruit a capsule, ellipsoid, woody, 4-6 valved, dehiscent. Seeds many, winged.  "
 },
 {
  "S_No": 105,
  "Scientific_name": "Lagerstroemia speciosa",
  "Code": 105,
  "Common_name": "Queen's crepe mrytle",
  "Family_name": "Lythraceae",
  "Kannada_name": "Hole daasavaala, Chella",
  "Origin": "Indian Subcontinent, Southern China, Indochina, Philippines, Malaysia, Indonesia.",
  "Species type": "Indigenous",
  "Phenology": "Deciduous",
  "Conservation_status": "Not known",
  "Flowering_period": "April - June",
  "Fruiting_period": "July - August",
  "Uses": "It is a medicinal tree traditionally used to lower blood sugar in the body. Its high content of corosolic acid makes it an effective anti-diabetic drug. It is also recommended for kidney, bladder problems and hypertension. A decoction of the bark is used against diarrhoea and abdominal pains. A leaf poultice is used to relief malarial fever and is applied on cracked feet",
  "Additional_information": "The tree is recognised as the state flower of the state of Maharashtra. (Tāmhan in Marathi)",
  "Description": "It is a medium sized, semi-deciduous tree with a flaky bark, 7-18 m tall. Leaves simple, opposite or subopposite, elliptic, oblong-elliptic to ovate, glabrous, base obtuse or acute, apex acuminate, margin entire. Inflorescence a terminal panicle, 2--4- cm long. Flower bisexual, muave or pink. Fruit a woody capsule, 4-6 valved. Seeds many, winged.  "
 },
 {
  "S_No": 106,
  "Scientific_name": "Leucaena leucocephala",
  "Code": 106,
  "Common_name": "River tamarind tree",
  "Family_name": "Fabaceae",
  "Kannada_name": "Subabul",
  "Origin": "Southern tropical America.",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": "April - June",
  "Fruiting_period": "August - October",
  "Uses": "The wood is used for making pulp in the pulp and paper industry. Red, brown and black dyes are extracted from the pods, leaves and bark.\nA decoction of the root and bark is abortifacient. The pods and seeds are a good tonic. The roasted seeds are emollient. The seeds have a beneficial effcct and are administered in the morning on an empty stomach.",
  "Additional_information": null,
  "Description": " Shrub or small evrgreen tree, -.6-9 m tall. Bark greyish-brown, fissured. Leaves bipinnate, 4-9 pairs of pinnae, leaflets 1--17 pairs; leaflets sessile, linear-oblong, glabrous or subglabrous, base oblique or cuneate, apex acute, margin ciliate. Inflorescence a head. Flowers bisexual, white to cream, anthers hairy. Fruit a pod, linaer and oblong, flat, pubescent, stipe up to 3 cm long. Seeds 15-25, oval, dark brown. "
 },
 {
  "S_No": 107,
  "Scientific_name": "Libidibia ferrea",
  "Code": 107,
  "Common_name": "Brazilian ironwood, Leopard tree",
  "Family_name": "Fabaceae",
  "Kannada_name": "-",
  "Origin": "Brazil, Bolivia",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": "May - July",
  "Fruiting_period": null,
  "Uses": "The roots and stem bark are used in the treatment of diabetes. The roots are astringent and febrifuge. A decoction of the wood is anticatarrhal and vulnerary.",
  "Additional_information": null,
  "Description": "Medium-sized evergreen tree, 8-15 m tall. Crown umbrella shaped, flat topped. Bark smooth, light grey to ivory, peely, mottled with brown or dark grey. Leaves bipinnately, pinnae 5 to11, leaflets 8-24 per pinna; leaflets opposite, linear-oblong or elliptical, pubescent, base obtuse or subattenuate, apex obtuse, margin entire. Inflorescence a terminal raceme. Flowers bisexual, fragrant, yellow, odd petal spotted red. Fruit a indehiscent pod, woody, elliptic-oblong, compressed, 5-7 cm long. "
 },
 {
  "S_No": 108,
  "Scientific_name": "Limonia acidissima",
  "Code": 108,
  "Common_name": "Wood apple",
  "Family_name": "Rutaceae",
  "Kannada_name": "Bela, Baloola",
  "Origin": "India, Bangladesh, Sri Lanka",
  "Species type": "Indigenous",
  "Phenology": "Deciduous",
  "Conservation_status": "Not known",
  "Flowering_period": "May - July",
  "Fruiting_period": "November - December",
  "Uses": "The fruit has astringent properties. The leaves contain tannins and an essential oil. They are astringent and are used internally, often combined with milk and sugar, in the treatment of indigestion, flatulence, diarrhoea, dysentery (especially in children) and haemorrhoids. An oil derived from the crushed leaves is applied on itchy skins",
  "Additional_information": "A majority of Hindu temples will have a sacred tree within its compound and is known as the Sthala Vriksha.",
  "Description": "Medium sized, deciduous trees, up to 2- m high. Bark dark grey or black, vertically fissured, spines sharp and straight. Leaves imparipinnate, alternate, 1-3 in a cluster; leaflets 5-7, opposite, sessile, obovate, glabrous, pellucid-punctate, coriaceous, base cuneate, aoex obtuse, margin entire, crushed leaf aromatic. Inflorescence an axillary cyme. Flowers polygamous, dull red, 1.3 cm across, pubescent, petals 5. Fruit a berry, 5-7.6 cm across, globose, whitish-brown, woody, rind hard. Seed many, wooly,  embedded in sour pulp.  "
 },
 {
  "S_No": 109,
  "Scientific_name": "Litchi chinensis",
  "Code": 109,
  "Common_name": "Litchi",
  "Family_name": "Sapindaceae",
  "Kannada_name": "-",
  "Origin": "China",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": null,
  "Fruiting_period": null,
  "Uses": "The fruit, its peel and the seed are used in traditional medicine; decoctions of the root, bark and flowers are used as a gargle to alleviate throat ailments. The fruit peel is used in the treatment of diarrhoea. Seeds are used as an anodyne in neuralgic disorders and orchitis",
  "Additional_information": null,
  "Description": "Medium sized evergreen tree, 6-12 m tall. Bark grey-black, branches brownish-red. Leaves pinnate, alternate; leaflets in 2 to 4 pairs, ovate or ovate-lanceolate , glabrous, glaucous beneath, base cuneate, apex acuminate, margin entire. Inflorescence a terminal panicle. Flowers bisexual, white, yellow or green, fragrant. Fruit a drupe, globose to subglobose, red or pink-red when mature. Seed 1, dark brown, covered by fleshy aril. "
 },
 {
  "S_No": 110,
  "Scientific_name": "Livistona chinensis",
  "Code": 110,
  "Common_name": "Chinese fan palm, fountain palm",
  "Family_name": "Arecaceae",
  "Kannada_name": "-",
  "Origin": "Southeast Asia",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Vulnerable",
  "Flowering_period": null,
  "Fruiting_period": null,
  "Uses": "The leaves are used for making fans. They are also used for manufacturing rain hats and coats, brooms etc. The fibres, extracted from the sheath and the petiole of the leaves, are made into cordage",
  "Additional_information": null,
  "Description": "A palm, up to 15 m tall. Trunk rough with leaf scars. Leaves palmate, with green or black recurved spines along margins of petiole, flabellate, plicate, divided into 6--9- segments; segments linear-lanceolate, glabrous, pendulous, apex acuminate and deeply forked. Inflorescence branched to 3 order, yellow when young and then green with unpleasant odour. Flowers small, sessile, in groups of 2-4 flowers. Fruits green or blue-green, globose to ellipsoid or pear-shaped, 1.9 cm long. "
 },
 {
  "S_No": 111,
  "Scientific_name": "Macadamia integrifolia",
  "Code": 111,
  "Common_name": "Macadamia",
  "Family_name": "Proteaceae",
  "Kannada_name": "-",
  "Origin": "Australia",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Vulnerable",
  "Flowering_period": null,
  "Fruiting_period": null,
  "Uses": "The decomposed husk is commonly used in potting soil. The oil from the seed is used in cosmetics. ",
  "Additional_information": null,
  "Description": "Evergreen tree, 5-18 m tall. Leaves simple, mostly in whorls of 3, oblong to oblanceolate, glabrous, coriaceous, base attenuate, apex acute to obtuse or retuse, margin irregularly spiny-dentate or entire. Inflorescence an axillary pendulous raceme.  Flowers bisexual, creamy-white or yellowish. Fruit a globose follicle. Seed usually 1, globular, with a smooth, hard, thick testa enclosing the edible kernel."
 },
 {
  "S_No": 112,
  "Scientific_name": "Madhuca longifolia",
  "Code": 112,
  "Common_name": "Mahua, Butter tree",
  "Family_name": "Sapotaceae",
  "Kannada_name": "Ippe, Kaadippe, Hunage",
  "Origin": "India",
  "Species type": "Indigenous",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": "March - April",
  "Fruiting_period": "June - August",
  "Uses": "The flowers are regarded as anthelmintic, cooling, demulcent, laxative and tonic. They are used in the treatment of coughs, colds and bronchitis and in the treatment of snakebites. The bark is astringent and emollient. It is used in the treatment of leprosy. The bark is used externally to treat itchy skin and bleeding gums.",
  "Additional_information": "The Tamil saint-philosopher Valluvar is believed to have born under an oil-nut tree within the Ekambareshwarar Temple at Mylapore, and hence it remains the sanctum tree of the Valluvar shrine built within the Ekambareshwarar temple complex.",
  "Description": "Medium to large sized, deciduous, much branched tree, up to 18 m high, sap white. Young growth tomentose. Leaves often clustered at the end of branches, simple, alternate, narrowly oblong, elliptic, oblanceolate or obovate, glabrous, cuneate at the base, rounded to acuminate at the apex, margin entire. Inflorescence a fascicle.   Flowers are cream, corollas fleshy, juicy, clustered at the end of branches, pubescent. Fruit a  berry, ovoid, fleshy, tomentose, greenish, 1-4 seeded. Seed is large, elliptical, compressed. "
 },
 {
  "S_No": 113,
  "Scientific_name": "Magnolia champaca",
  "Code": 113,
  "Common_name": "Yellow jade orchid tree",
  "Family_name": "Magnoliaceae",
  "Kannada_name": "Sampige mara",
  "Origin": "Indomalayan realm",
  "Species type": "Indigenous",
  "Phenology": "Evergreen",
  "Conservation_status": "Least concern",
  "Flowering_period": "June - September",
  "Fruiting_period": "September - October",
  "Uses": "The bark is used as a febrifuge. A decoction of the bark and leaves is given after childbirth. The flowers are used to treat leprosy. The leaves are used as a treatment against colic.The seeds are used to treat badly chapped skin. A yellow dye is obtained from the flowers.",
  "Additional_information": null,
  "Description": "Medium to large sized, evergreen tree, up to 3- m tall. Bark grey, lenticellate, blaze cream with orange speckles. Young shoots rusty tomentose. Leaves are simple, alternate, elliptic-lanceolate, glabrous, chartaceous, base acute to attenuate, apex acuminate, margin undulate. Flowers solitary or rarely in pairs, axillary, yellow, bisexual, fragrant. Fruit a follicle, warty, 2-3 long, dehiscing dorsally. Seeds 1, scarlet. "
 },
 {
  "S_No": 114,
  "Scientific_name": "Magnolia grandiflora",
  "Code": 114,
  "Common_name": "Magnolia",
  "Family_name": "Magnoliaceae",
  "Kannada_name": "Dodda billi sampige",
  "Origin": "Southeastern America",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Least concern",
  "Flowering_period": null,
  "Fruiting_period": null,
  "Uses": "The bark is diaphoretic, stimulant, tonic. It is used in the treatment of malaria and rheumatism. A decoction has been used as a wash and a bath for prickly heat itching. The decoction has also been used as a wash for sores and as a steam bath for treating dropsy.",
  "Additional_information": null,
  "Description": "Medium to large, evergreen tree, up to 37 m tall. Bark pale brown to grey, fissured. Young shoots shortly tomentose. Leaves simple, alternate, oblong-elliptic, elliptic-obovate, subcoriaceous, glabrous above, paler glaucous and pubescent with brownish hairs below, base obtuse or rounded, apex obtuse, acute to shallow mucronate at the tip, margin entire. Flowers soliatry, terminal, bisexual, creamy-white, lemony fragrance. Fruit a follicle, ovoid, compressed. Seeds 2, compressed, red; aril red. "
 },
 {
  "S_No": 115,
  "Scientific_name": "Mallotus philippensis",
  "Code": 115,
  "Common_name": "Kamala tree, Kumkuma tree",
  "Family_name": "Euphorbiaceae",
  "Kannada_name": "Kumkumada mara, Hulichendu",
  "Origin": "South Asia, Afghanistan, Australia",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": "March - April",
  "Fruiting_period": "July - August",
  "Uses": "Kamala powder is used as anthelmintic. All parts of the tree can be applied externally to treat parasitic infections of the skin. The powdered fruits are used to treat skin diseases.",
  "Additional_information": null,
  "Description": "Small or medium-sized, evergreen, dioecious tree, up to 25 m tall. Bark dark grey, thin, wood white. Branchlets, young leaves and inflorescence rusty pubescent. Leaves simple, alternate or subopposite, ovate or ovate-lanceolate, glabrous above, greyish pubescent to fulvous tomentose with minute red glands beneath, coriaceous, base acute or round, apex acuminate or acute, margin entire or sparsely serrate. Inflorescences terminal, spicate or racemose. Flowers rusty red. Male flowers 4.5 mm across; female flowers 4 mm across. Fruit a capsule, 7-8 mm across, globose, 3-lobed, densely red-glandular, pubescent. Seeds 1-4, globose, glabrous, black. "
 },
 {
  "S_No": 116,
  "Scientific_name": "Mammea suriga",
  "Code": 116,
  "Common_name": "Surangi",
  "Family_name": "Calophyllaceae",
  "Kannada_name": "Surige mara",
  "Origin": "South India",
  "Species type": "Endemic",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": null,
  "Fruiting_period": null,
  "Uses": "An infusion of the fresh or dry leaves is given in cases of intermittent fever. Uses of mamea in folk medicine include treatment of scalp infections, diarrhoea, digestive and eye problems. The powdered seeds are employed in the treatment of parasitic skin diseases.",
  "Additional_information": null,
  "Description": "Medium sized, evergreen trees, 1--18 m tall. Bark rough, outer bark greenish gray, inner bark reddish, resinous or milky white latex.  Leaves simple, opposite, ometimes ternately verticellate, lanceolate-obovate to elliptic-oblong, dark green, glabrous, base obtuse, apex acute with rounded tip, obtuse to emarginate, margin entire. Inflorescence a fascicled cyme or solitary. Flowers polygamous, monoecious, bisexual in culrivation fragrant, white or pinkish. Fruit an indehiscent berry, ovoid-globose, glabrous, persistent style, juicy and pulpy, seeds 1-4. "
 },
 {
  "S_No": 117,
  "Scientific_name": "Mangifera indica",
  "Code": 117,
  "Common_name": "Mango tree",
  "Family_name": "Anacardiaceae",
  "Kannada_name": "Maavina mara",
  "Origin": "Indian Subcontinent",
  "Species type": "Indigenous",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": "February- March",
  "Fruiting_period": "May - June",
  "Uses": "The leaves are astringent and odontalgic. An infusion is drunk to reduce blood pressure and as a treatment for conditions such as angina, asthma, coughs and diabetes. Externally, the leaves are used in a convalescent bath. A mouthwash made from the leaves is effective in hardening the gums and helping to treat dental problems. The leaves are used to treat skin irritations. The charred and pulverized leaves are used to make a plaster for removing warts and also act as a styptic. The stem is astringent. It is used to treat diarrhoea and to remedy stomach-ache. The roots are diuretic.",
  "Additional_information": null,
  "Description": "Medium to large sized, evergreen tree up to 3- m tall. Bark dark grey, rough with verticla fissures, blaze yellow, exudation yellowish and gummy. Leaves simple, alternate, clustered at the tips of branchlets, pulvinate, elliptic, elliptic-lanceolate, linear-oblong, coriaceous, glabrous, base attenuate or acute, apex acuminate, acute or obtusely acute, margin entire. Inflorescence a terminal panicle. Flowers polygamous, greenish-white to yellowish-green. Fruit a drupe, oblong-reniform, compressed, yellowish-red when ripe, mesocarp fleshy, fibrous in wild trees, endocarp fibrous; seed 1, subreniform."
 },
 {
  "S_No": 118,
  "Scientific_name": "Manihot carthaginensis",
  "Code": 118,
  "Common_name": "Ceara rubber tree, Cassava tree",
  "Family_name": "Euphorbiaceae",
  "Kannada_name": "-",
  "Origin": "Brazil",
  "Species type": "Exotic",
  "Phenology": "Deciduous",
  "Conservation_status": "Not known",
  "Flowering_period": "June - September",
  "Fruiting_period": "October - January",
  "Uses": "The stem and root are ingredients in a remedy for skin infections. ",
  "Additional_information": null,
  "Description": "Small, deciduous tree, 6-8 m high. Bark pinkish-grey to dark brown. Leaves are peltate; lobes 3 or 5, lobes broadly elliptic to obovate, glabrous, base narrow, apex subacute or mucronate, margin entire, dark green above, pale bluish green below. Inflorescence a panicle. Flowers unisexual, greenish-white,  flowers are greenish-white and muave tinged or pale yellow with reddish markings. Fruit a capsule, globose, smooth, warty when dry. Seeds biconvex, orange-brown, mottled black; caruncle yellow. "
 },
 {
  "S_No": 119,
  "Scientific_name": "Manilkara zapota",
  "Code": 119,
  "Common_name": "Sapota, chikoo tree",
  "Family_name": "Sapotaceae",
  "Kannada_name": "Sapota",
  "Origin": "Mexico, Central America, Caribbean",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": "August - October",
  "Fruiting_period": "January",
  "Uses": "A leaf decoction is taken for fever, haemorrhage, wounds and ulcers.  The bark is astringent, febrifuge and tonic. The fruit is eaten as a remedy for indigestion and diarrhoea. Seeds are antipyretic, and when ground with water they act as a diuretic. They are used to expel urinary and gall bladder stones. The pulverized roots are used to treat thrush in babies. ",
  "Additional_information": null,
  "Description": "Medium to large sized, deciduous tree, up to 3- m tall. Bark light grey to dark brown, fissured, inner bark pink, with sticky latex. Leaves clustered at tip of branches, simple, alternate, elliptic or oblong-elliptic, subcoriaceous, glabrous, brown-tomentose along midrib, base cuneate, apex acute to acuminate, margin sinuate. Inflorescences solitary flowers. Flowers bisexual, white or pale yellow. Fruit a berry, globose or ellipsoid, rough rusty brown, fleshy, sweet scented when ripe. Seeds 5-12, shining black, obovate. "
 },
 {
  "S_No": 120,
  "Scientific_name": "Markhamia lutea",
  "Code": 120,
  "Common_name": "Nile trumpet",
  "Family_name": "Bignoniaceae",
  "Kannada_name": "kunkuma",
  "Origin": "Eastern Africa",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Least concern",
  "Flowering_period": "All year",
  "Fruiting_period": "All year",
  "Uses": "The tree is considered to be an effective treatment for skin-affections, sores and itch. The plant is also used as a rejuvenator and diuretic, and is given for oedema of the legs and elephantiasis of the scrotum. The leaves and bark are used as medicine for tooth-ache and for convulsion in children. Roots are also used against venereal diseases and for preventing abortion.",
  "Additional_information": null,
  "Description": "Evergreen tree, 15-21 m tall. Sometimes shrubby, 1.2-4.5 m tall. Bark brown, smooth or rough, ridged. Leaves pinnate; leaflets 7-13, elliptic to obovate, glabrous but densely lepidote above, more sparsely so beneath, often with pubescent axillary domatia beneath, base cuneate to rounded, apex acuminate, margin undulate. Inflorescence a terminal panicle. Flowers bisexual, trumpet shaped, yellow with red veins or spots at the throat. Fruit a capsule, curved, elongated, compressed, glabrous but lepidote, 35-8- cm long. Seeds numerous, winged. "
 },
 {
  "S_No": 121,
  "Scientific_name": "Melia azedarach",
  "Code": 121,
  "Common_name": "Chinaberry tree",
  "Family_name": "Meliaceae",
  "Kannada_name": "Bevu",
  "Origin": "Indomalayan plane",
  "Species type": "Indigenous",
  "Phenology": "Deciduous",
  "Conservation_status": "Not known",
  "Flowering_period": "March - May and November - December",
  "Fruiting_period": null,
  "Uses": "The leaf juice is anthelmintic, antilithic, diuretic and emmenagogue. The flowers and leaves are applied as a poultice in the treatment of neuralgia and nervous headache. The stem bark is anthelmintic, astringent and bitter tonic. A red dye is obtained from the bark. A fibre obtained from the bark is used to make rope. The fruits are a source of a flea powder and an insecticide.",
  "Additional_information": null,
  "Description": "Medium sized, deciduous tree, up to 15 m tall. Bark dark grey-brown, smooth, longitudinally exfoliating. Leaves bipinnate, rarely tripinnate, alternate; pinnae 5-9, oppoiste; leaflets 3-7, opposite, terminal one slightly larger, ovate, elliptic or lanceolate, sparsely puberulous, glabrescent, base oblique, apex acuminate, margin serrate to subserrate. Inflorescence an axillary panicle. Flower bisexual, small, lilac, fragrant. Fruit a drupe, ellipsoid or globose,  yellow when ripe, 3-6 seeded; endocarp ligneous. "
 },
 {
  "S_No": 122,
  "Scientific_name": "Melia dubia",
  "Code": 122,
  "Common_name": "Malabar neem",
  "Family_name": "Meliaceae",
  "Kannada_name": "Hebbevu, Turukubevu, Bettabevu",
  "Origin": "South India",
  "Species type": "Indigenous",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": "January - March",
  "Fruiting_period": "February - May",
  "Uses": "The bark is made into a paste with cumin seeds and given to cure fever. It is planted as a shade tree in coffee estates. A paste made out of the green fruits is used to treat scabies and sores.",
  "Additional_information": null,
  "Description": "Large deciduous trees, up to 2- m tall. Bark dark brown, rough, lenticellate, exfoliations rectangular. Young shoots and inflorescence scurfy tomentose. Leaves are 2-3 pinnate, imparipinnate, swollen at base, tomentose when young; pinnae 3-7 pairs; leaflets 2-11 on each pinnae, opposite, ovate-lanceolate, glabrous at maturity, coriaceous, base oblique, acute, obtuse, round or attenuate, apex acuminate, margin crenate. Inflorescence an axillary panicle. Flowers bisexual, greenish-white, pubescent. Fruit a drupe, globose, dosally compressed, longitudinal ridges, yellow when ripe, fleshy, seeds 3 to 4. "
 },
 {
  "S_No": 123,
  "Scientific_name": "Millettia peguensis",
  "Code": 123,
  "Common_name": "Moulmein rosewood",
  "Family_name": "Fabaceae",
  "Kannada_name": null,
  "Origin": "Burma, Siam",
  "Species type": "Exotic",
  "Phenology": "Deciduous",
  "Conservation_status": "Least concern",
  "Flowering_period": "December - May",
  "Fruiting_period": "April - October",
  "Uses": "Ornamental tree planted along roads for its showy and fragrant flowers.",
  "Additional_information": null,
  "Description": "Small to medium deciduous tree, 12-15 in height. Leaves imparipinnate, leaflets 5-7, ovate-elliptic, glabrous, base obtuse, apex acuminate,   Flowers are pinkish-white in racemes or panical inflorescence, flowering during february-june. the fruits are oblong pod, compressed and woody; seed is solitary, reniform."
 },
 {
  "S_No": 124,
  "Scientific_name": "Millettia pinnata",
  "Code": 124,
  "Common_name": "Pongamia",
  "Family_name": "Fabaceae",
  "Kannada_name": "Honge",
  "Origin": "Tropical Asia, Australia, Pacific Island",
  "Species type": "Indigenous",
  "Phenology": "Evergreen",
  "Conservation_status": "Least concern",
  "Flowering_period": "April - June",
  "Fruiting_period": "February - May",
  "Uses": "The seed oil has been found to be useful in diesel generators, and along with Jatropha and castor, it is being explored in hundreds of projects throughout India and the third world as feedstock for biodiesel. pinnata as a biofuel is commercially valuable to the rural populations of places such as India and Bangladesh, where the plant grows abundantly, because it can support the socioeconomic development of these areas.",
  "Additional_information": "-",
  "Description": "A medium sized, evergreen tree, up to 18 m tall. Bark grey, smooth, speckled with brown; blaze-yellow; branchlets lenticellate. Leaves alternate, imparipinnate; leaflets 5-7, oppoiste, elliptic-acuminate, elliptic-lanceolate, ovate or ovate-oblong, glabrous, chartaceous, base cuneate, apex acuminate, margin entire. Inflorescence an axillary raceme or panicle. Flowers bisexual, pinkish-white or purplish-white. Fruit a pod, 4-5 cm long, obliquely oblong, flat, thick, pointed at both ends, indehiscent, slightly falcate; seed one, reniform."
 },
 {
  "S_No": 125,
  "Scientific_name": "Millingtonia hortensis",
  "Code": 125,
  "Common_name": "Indian Cork tree",
  "Family_name": "Bignoniaceae",
  "Kannada_name": "Birate mara, Aakasha mallige",
  "Origin": "South Asia",
  "Species type": "Indigenous",
  "Phenology": "Deciduous",
  "Conservation_status": "Least concern",
  "Flowering_period": "October - December",
  "Fruiting_period": "October - December",
  "Uses": "It is considered ornamental and the pleasant fragrance of the flowers renders it ideal as a garden tree. The wood is also used as timber and the bark is used as an inferior substitute for cork. The leaves are also used as a cheap substitute for tobacco in cigarettes",
  "Additional_information": "It is salinity tolerant and considered auspicious.",
  "Description": "Evergreen trees, 8-25 m tall. Bark corky. Leaves imparipinnately bipinnate, opposite; pinnae 2-3 pairs with 5-7 leaflets per pinna; leaflets elliptic, ovate, or ovate-oblong, glabrous, base rounded, oblique, apex acuminate, margin entire. Inflorescence a paniculate cyme. Flowers bisexual, white, tube shaped, pubescent adaxially. Fruit a capsule, linear, compressed. Seeds discoid-oblong, compressed, winged."
 },
 {
  "S_No": 126,
  "Scientific_name": "Mimusops elengi",
  "Code": 126,
  "Common_name": "Spanish Cherry",
  "Family_name": "Sapotaceae",
  "Kannada_name": "Ranjal",
  "Origin": "Southeast Asia, Nothern Australia",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": "April",
  "Fruiting_period": "June - October",
  "Uses": "The bark, flowers, fruits, and seeds are used in Ayurvedic medicine in which it is purported to be astringent, cooling, anthelmintic, tonic, and febrifuge. It is mainly used for dental ailments such as bleeding gums, pyorrhea, dental caries, and loose teeth",
  "Additional_information": null,
  "Description": "\n Evergreen trees, 16-2- m tall. Bark dark grey, smooth, not deeply furrowed. Leaves simple,  alternate, broadly ovate, glabrous, base cuneate, apex acuminate, entire or slightly wavy. Inflorescences 2-4 flowered fascicles or solaitary. Flowers bisexual, creamish-white, fragrant. Fruit a berry, ovoid, 2.5-4 cm long, orange, pubescent when young, persistent calyx. "
 },
 {
  "S_No": 127,
  "Scientific_name": "Morus nigra",
  "Code": 127,
  "Common_name": "Black mulberry",
  "Family_name": "Moraceae",
  "Kannada_name": "Tuti, tool",
  "Origin": "Southwestern Asia",
  "Species type": "Exotic",
  "Phenology": "Deciduous",
  "Conservation_status": "Not known",
  "Flowering_period": "May - June",
  "Fruiting_period": "August - September",
  "Uses": "The plant is analgesic, emollient, sedative. The leaves are antibacterial, astringent, diaphoretic, hypoglycaemic, odontalgic and ophthalmic. They are taken internally in the treatment of colds, influenza, eye infections and nosebleeds. The stems are antirheumatic, diuretic, hypotensive and pectoral. A tincture of the bark is used to relieve toothache",
  "Additional_information": null,
  "Description": "Small to medium, deciduous, monoecious or dioecious tree, up to 1- m tall. Bark dark brown, fissured, rough; twigs reddish-brown, densely hairy. Leaves simple, alternate, broadly ovate, unlobed, sometimes 2-5 lobed, abaxially pale green, shortly pubescent, and tomentose, adaxially dark green and coarse, base cordate, apex acute to shortly acuminate, margin regularly and coarsely serrate. Inflorescence a catkin. Male catkins cylindric, pubescent. Female catkins ellipsoid, short peduncle, pubescent. Fruit a sorosis, ovoid-oblong, dark purple to black, strongly acidic until mature. "
 },
 {
  "S_No": 128,
  "Scientific_name": "Muntingia calabura",
  "Code": 128,
  "Common_name": "Buah Cherry tree",
  "Family_name": "Muntingiaceae",
  "Kannada_name": "Gasagase hannina mara",
  "Origin": "Mexico, Bolivia",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": "July - October",
  "Fruiting_period": "July - October",
  "Uses": "Its soft wood used for rural construction, while the bark is fibrous and used for making ropes. Traditional medicinal uses have been reported for the leaves (headaches, prostate problems, reduce gastric ulcers), bark (antiseptic), flowers (antiseptic, reduce swelling, antispasmodic), and fruits (respiratory problems; antidiarrheic).",
  "Additional_information": "-",
  "Description": "Shrub or small evergreen tree, 2-12 m tall with spreading branches. Young branches densely tomentose. Leaves simple, alternate, oblong or lanceolate, pubescent, base inequilateral, apex acuminate, margin irregularly serrate. Inflorescence a supra-axillary 2 to 3 flowerd fascicle or solitary. Flowers bisexual, white.  Fruit a subglobose berry, ca. 1 cm in diameter, slightly glabrous, yellowish to red when ripe, seeds numerous. "
 },
 {
  "S_No": 129,
  "Scientific_name": "Murraya paniculata",
  "Code": 129,
  "Common_name": "Orange jasmine, Chinese box",
  "Family_name": "Rutaceae",
  "Kannada_name": "Kadu karibevu",
  "Origin": "South Asia, India, Australia",
  "Species type": "Indigenous",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": "All year",
  "Fruiting_period": "All year",
  "Uses": "The leaves are astringent, stimulant and tonic. They are used in the treatment of dropsy, diarrhoea and dysentery. The ground-up bark of the roots is both eaten and applied externally in the treatment of body aches. An essential oil is obtained from the flowers. ",
  "Additional_information": null,
  "Description": "Evergreen shrubs or trees, 1.8-12 m tall. Bark greyish-white to pale yellowish-grey. Leaves imparipinnate, alternate; leaflets 3-7, suborbicular to ovate to elliptic, coriaceous, puberulent to glabrate, glandular punctate, base cuneate, apex rounded to acuminate, margin entire or crenulate. Inflorescences terminal or  axillary panicle. Flowers bisexual, white, fragrant. Fruit a berry, orange to vermilion, narrowly ellipsoid, subglobose or rarely ovoid, glabrous, punctate. Seeds 1-2, villous."
 },
 {
  "S_No": 130,
  "Scientific_name": "Neolamarckia cadamba",
  "Code": 130,
  "Common_name": "Burflower tree",
  "Family_name": "Rubiaceae",
  "Kannada_name": "Kadamba",
  "Origin": "Southeast Asia",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Least concern",
  "Flowering_period": "December - July",
  "Fruiting_period": null,
  "Uses": "The dried bark is used to relieve fever and as a tonic. An extract of the leaves serves as a mouth gargle. The plant is considered to be astringent, digestive, expectorant and febrifuge. It is used in the treatment of conditions such as ulcers, digestive problems, fevers and vomiting.",
  "Additional_information": "The leaf extract has recently been used to produce silver nanoparticles for surface-enhanced Raman spectroscopy",
  "Description": "Large, deciduous trees, up to 3- m high. Bark thin, greyish to pale brown, fissured and scabrous when old; branches horizontally spreading. Leaves simple, opposite decussate, ovate or elliptic-oblong, glabrous above, pubescent beneath, base truncate or obtuse, apex acuminate, margin entire. Inflorescence a terminal solitary, globose head. Flowers bisexual, yellowish-white. Fruit a capsule on a fleshy globose receptacle, 3.5-5 cm across, orange yellow, capsule membranous. Seeds many, angular, minute."
 },
 {
  "S_No": 131,
  "Scientific_name": "Pachira aquatica",
  "Code": 131,
  "Common_name": "Guiana chestnut, Malabar chestnut",
  "Family_name": "Malvaceae",
  "Kannada_name": "-",
  "Origin": "Central and South America",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": "All year",
  "Fruiting_period": "All year",
  "Uses": "It is known as the best air-purifying plant, and it absorbs the toxic components present in the air. It purifies the air and makes home a safe place for family. With so many amazing benefits.",
  "Additional_information": "-",
  "Description": "Evergreen trees, 5-23 m tall, sometimes buttressed. Bark smooth, greyish to brownish. Leaves palmate, alternate; leaflets 5-9, oblong to obovate-oblong, abaxially ferruginous stellate tomentose, adaxially glabrous, base cuneate, apex acuminate, margin entire. Inflorescence solitary flowers. Flowers bisexual, yellowish; stamens numerous, pink-tipped white to yellowish. Fruit a capsule, subglobose, ellipsoid to oblong-ellipsoid, yellowish-brown puberulous, silky-villous inside. Seeds 4-5 angular, dark brown. "
 },
 {
  "S_No": 132,
  "Scientific_name": "Parkia biglandulosa",
  "Code": 132,
  "Common_name": "African Locust Bean",
  "Family_name": "Fabaceae",
  "Kannada_name": null,
  "Origin": "Africa",
  "Species type": "Exotic",
  "Phenology": "Deciduous",
  "Conservation_status": "Least concern",
  "Flowering_period": "December - April ",
  "Fruiting_period": "December - April",
  "Uses": "The bark is used as a mouthwash, vapour inhalant for toothache, or for ear complaints. It is macerated in baths for leprosy and used for bronchitis, pneumonia, skin infections, sores, ulcers, bilharzia, washes for fever, malaria, diarrhoea, violent colic and vomiting, sterility, venereal diseases, guinea worm, oedema and rickets, and as a poison antidote. Leaves are used in lotions for sore eyes, burns, haemorrhoids and toothache. Seed is taken for tension, and pulp for fevers, as a diuretic and as a mild purgative. Roots are used in a lotion for sore eyes",
  "Additional_information": "The fruit pulp, the leaves and the seeds are also used to feed livestock and poultry. The flowers are attractive to bees and a good source of nectar",
  "Description": " Deciduous tree, 15-2- m tall. Bark black, rough, wood brown, branchlets pubescent. Leaves bipinnate, alternate, pinnae 2--4- pairs; leaflets 6--8- pairs, oblong, galbrous above, puberulous below, base truncate, apex acute-obtuse, margin ciliate. Inflorescence a large globose head, axillary, solitary, pendulous. Flowers bisexual, cream coloured. Fruit a pod, with elongated stipe, oblong-linear, compressed, brown, dehiscent. Seeds 6-13, ellipsoid, compressed to ovoid. "
 },
 {
  "S_No": 133,
  "Scientific_name": "Peltophorum pterocarpum",
  "Code": 133,
  "Common_name": "Copper pod ",
  "Family_name": "Fabaceae",
  "Kannada_name": "Booruga",
  "Origin": "Southeastern Asia",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": "march to may and September to November ",
  "Fruiting_period": "All year",
  "Uses": "In traditional medicine it is used as an astringent to cure or relieve intestinal disorders after pain at childbirth, sprains, bruises and swelling or as a lotion for eye troubles, muscular pains and sores. It is also used for gargles and tooth powders. An antifungal principle is present in the leaflets and buds. An alcoholic extract from the flowers has an anti-inflammatory effect and an antibacterial activity.",
  "Additional_information": "-",
  "Description": "Evergreen trees, 12-24 m tall. Bark grey, smooth, lenticels present. Leaves bipinnate, pinnae 7-15 pairs, 7-21 pairs of leaflets per pinna; leaflets opposite, oblong-obovate, coriaceous, pubescent to glabrous, base oblique, apex rounded, mucronate, margin entire. Inflorescence a terminal or axillary panicle. Flowers bisexual, yellow, pubescent. Fruit a pod, copper-red, oblong, flat, thin, hard, narrowed at both the ends, 5-1- cm long. Seeds brown, 2-4. "
 },
 {
  "S_No": 134,
  "Scientific_name": "Persea americana",
  "Code": 134,
  "Common_name": "Avocado",
  "Family_name": "Lauraceae",
  "Kannada_name": null,
  "Origin": "Mexico",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Least concern",
  "Flowering_period": "November - January",
  "Fruiting_period": "January to March ",
  "Uses": "The leaves are astringent, carminative, antitussive, emmenagogue and hypotensive. An oral infusion of the leaves is used to treat dysentery. It is also used for relieving coughs, lowering blood pressure, treating liver obstructions, promoting menstrual flow and for clearing high uric acid levels in the body which could lead to gout. The bark is astringent, carminative, antitussive and emmenagogue. It is used in the treatment of diarrhoea. The fruit pulp is emollient, carminative and helps lower blood cholesterol levels. The mashed fruit pulp is a nourishing food that is considered to have aphrodisiac properties",
  "Additional_information": "The fruit of domestic varieties has a buttery flesh when ripe. Depending on the variety, avocados have green, brown, purplish, or black skin when ripe, and may be pear-shaped, egg-shaped, or spherical. Commercially, the fruits are picked while immature, and ripened after harvesting.",
  "Description": "Small to medium sized evergreen trees, up to 2- m tall. Bark grey-green, longitudinally fissured, young branches pubescent. Leaves simple, alternate, narrowly elliptic, elliptic, ovate or obovate, coriaceous, glabrous or pubescent scattered on the underside, glaucous below, base cuneate or acute to subrounded, apex acute or obtuse or obtusely acuminate, margin entire. Inflorescence an axillary subterminal panicle, densely pubescent. Flowers small, fragrant, pubescent, greenish-yellow. Fruit a berry, large, pear-shaped, globose, or oval; pulp fleshy, thick, juicy, oily. Seed 1, large, globose. "
 },
 {
  "S_No": 135,
  "Scientific_name": "Persea macrantha",
  "Code": 135,
  "Common_name": "Large-flowered bay tree",
  "Family_name": "Lauraceae",
  "Kannada_name": "Gulimaavu, Chittu thandri",
  "Origin": "Western Ghats, Sri Lanka",
  "Species type": "Endemic",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": "December - May",
  "Fruiting_period": "December - May",
  "Uses": "The leaf as well as bark are used extensively by folklore practitioners in treating various ailments such as rheumatism, asthma, ulcer, bruise, mental upset, fractures, swellings, weakness and debility.",
  "Additional_information": null,
  "Description": "Evergreen trees, up to 3- m tall. Bark pale brown, mottles with dark blotches, thinly scaly, blaze pinkish. Leaves simple, alternate, clustered at the tip of brachlets, obovate or elliptic to elliptic-oblong, coriaceous, glabrous, glaucous beneath, base acute to rounded, apex rounded or acuminate or acute, margin entire, aromatic when crushed. Inflorescence a terminal or axillary panicle. Flowers bisexual, pale yellow. Fruit a berry, globose, up to 2 cm across, aromatic, green with white specs, red to black when ripe. Seed 1, globose. "
 },
 {
  "S_No": 136,
  "Scientific_name": "Phoenix sylvestris",
  "Code": 136,
  "Common_name": "WIld date palm",
  "Family_name": "Arecaceae",
  "Kannada_name": "Ichalu, Kharjura",
  "Origin": "Pakistan, India, Bhutan, Myanmar, Bangladesh",
  "Species type": "Indigenous",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": "March - May",
  "Fruiting_period": "September - October",
  "Uses": "The fruit is useful in the treatment of heart complaints, abdominal complaints, fevers, vomiting and loss of consciousness. The fruit pounded and mixed with almonds, quince seeds, pistachio nuts and sugar, forms a restorative remedy.",
  "Additional_information": null,
  "Description": "Medium sized, dioecious, soliatry tree palm, 1--16 m tall, with persistent leaf bases. Leaves pinnate, greyish-green, short spines at the base; leaflets numerous, alternate, opposite or fascicled, in several planes, linear, glabrous, apex almost sharply pointed. inflorescence a spadix. Male flowers white, fragrant. Female flowers greenish or creamy-white. Fruit a berry, oblong-ellisoid, 2.5-3.2 cm long, orange-yellow when ripe. Seed 1, deeply grooved. "
 },
 {
  "S_No": 137,
  "Scientific_name": "Phyllanthus acidus",
  "Code": 137,
  "Common_name": "Malay gooseberry, Star gooseberry",
  "Family_name": "Phyllanthaceae",
  "Kannada_name": "-",
  "Origin": "Madagascar, South Asia",
  "Species type": "Exotic",
  "Phenology": "Deciduous",
  "Conservation_status": "Not known",
  "Flowering_period": "April - May",
  "Fruiting_period": "June - August",
  "Uses": "An extract from the root is used to cure skin diseases especially to bring relief from itching. The fruit is used as a laxative. They are also taken as a liver tonic to enrich the blood.",
  "Additional_information": null,
  "Description": "A small deciduous, monoecious tree or shrub, reaching 2 to 9 m in height. The leaves are ovate or lanceolate, glabrous, base obtuse or rounded, apex acute, margin entire. Inflorescence an axillary cymule, rarely cauliflorous. Flowers male, female or bisexual, small and pinkish. Fruit a drupe, oblate, with 6 to 8 ribs, pale yellow to creamish-white, waxy, crisp, juicy and very sour. Seeds 4 to 6. "
 },
 {
  "S_No": 138,
  "Scientific_name": "Phyllanthus emblica",
  "Code": 138,
  "Common_name": "Indian gooseberry",
  "Family_name": "Phyllanthaceae",
  "Kannada_name": "Bettada nellikayi",
  "Origin": "Indian subcontinent",
  "Species type": "Indigenous",
  "Phenology": "Deciduous",
  "Conservation_status": "Least concern",
  "Flowering_period": "March - May ",
  "Fruiting_period": "June - September",
  "Uses": "The amla fruit is eaten raw or cooked into various dishes, such as dal (a lentil preparation) and amle ka murabbah, a sweet dish made by soaking the berries in sugar syrup until they are candied. It is traditionally consumed after meals. Commonly used in inks, shampoos and hair oils, the high tannin content of Indian gooseberry fruit serves as a mordant for fixing dyes in fabrics.",
  "Additional_information": "In the Buddhist tradition, half an amalaka fruit was the final gift to the Buddhist sangha by the great Indian emperor Ashoka",
  "Description": "Deciduous trees, to 15 m high, bark grey-brown, rough, irregularly flaking; blaze pink-red. Leaves simple, alternate, bifarious on short deciduous branchlets, closely overlapping, subsessile, linear, oblong or linear-oblong, glabrous, membranous, base round, apex obtuse and shortly apiculate, margin entire. Flowers unisexual, greenish-yellow, densely clustered in leaf axils. Fruit a drupe, subglobose, disc enlarged, fleshy yellowish-green, indehiscent. Seeds reddish, trigonous, 3, smooth. "
 },
 {
  "S_No": 139,
  "Scientific_name": "Pimenta dioica",
  "Code": 139,
  "Common_name": "Allspice, Jamaican pepper",
  "Family_name": "Myrtaceae",
  "Kannada_name": null,
  "Origin": "West indies, Central America ",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": "February - March",
  "Fruiting_period": "April - June",
  "Uses": "Allspice is one of the most important ingredients of Caribbean cuisine. Under the name 'pimento', it is used in Jamaican jerk seasoning, though in principle the wood is used to smoke jerk in Jamaica. In the West Indies, an allspice liqueur is produced under the name \"pimento dram\". ",
  "Additional_information": null,
  "Description": "Evergreen tree, up to 2- m tall, with young branchlets glandular and pubescent. Leaves aromatic, oblong-elliptic, elliptic or elliptic-lanceolate, glabrous or glabrescent, base acute or rounded, rounded to obtusely acuminate at the apex, margin entire. Inflorescence a panicle. Flowers bisexual, white, 4-merous, small, pubescent. Fruit subglobose to oblate berry, densely covered with convex glands, aromatic on drying. Seeds 2, reniform."
 },
 {
  "S_No": 140,
  "Scientific_name": "Pithecellobium dulce",
  "Code": 140,
  "Common_name": "Madras Thorn",
  "Family_name": "Fabaceae",
  "Kannada_name": "Seeme hunase",
  "Origin": "Mexico",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": "December - February",
  "Fruiting_period": "February - March",
  "Uses": "The leaves can be used as a plaster to allay pain even from venereal sores, and can relieve convulsions. A paste made from the leaves is applied externally to treat muscular swellings caused by some inflammations. The bark of the root is a good remedy for diarrhoea and dysentery. The fruit pulp is taken orally to stop blood flow in case of haemoptysis. The seed juice is inhaled into the nostrils against chest congestion and pulverised seeds are ingested for internal ulcers.",
  "Additional_information": "-",
  "Description": "Evergreen trees, 1--15 m tall. Branches often pendulous; branchlets armed with spinescent stipules. Leaves pinnate, alternate, pinnae 1 pair; glands at junction of pinnae and leaflets; leaflets sessile, 1 pair per pinna, elliptic or obovate-elliptic, glabrous, base slightly oblique, apex obtuse or emarginate, margin entire. Inflorescence pedunculate heads, aggre­gated in terminal panicles. Flower bisexual, greenish-white. Fruit a pod, green or reddish-brown, curved into a circle, with white to pink pulpy aril. Seeds dark brown, shiny, 5-9, ovoid-ellipsoid, hard, with pleurogram."
 },
 {
  "S_No": 141,
  "Scientific_name": "Plumeria alba",
  "Code": 141,
  "Common_name": "White frangipani",
  "Family_name": "Apocynaceae",
  "Kannada_name": null,
  "Origin": "West indies, Caribbean ",
  "Species type": "Exotic",
  "Phenology": "Deciduous",
  "Conservation_status": "Not known",
  "Flowering_period": "April - June",
  "Fruiting_period": "-",
  "Uses": "The root bark is depurative and purgative, causing thirst. It is used in the treatment of blennorrhagia, herpes and syphilis. The root bark is used externally as a lotion on syphilitic ulcers, administered as powder macerated in sugar-water, wine or beer. The latex from the stem is caustic. It is used for treating ulcers, skin diseases and scabies. The flowers are bitter and caustic. They are an ingredient in a complex pectoral syrup for treating chest coughs and grippe. The seeds are used in the treatment of dysentery.",
  "Additional_information": "-",
  "Description": "Evergreen and deciduous trees, up to 7.6 m. Upright branches thick and have milky sap. Leaves simple, oblong-lanceolate, usually clustered at ends. Inflorescence cyme. Flowers bisexual, fragrant, white, yellow throathed. Fruit a follicle. "
 },
 {
  "S_No": 142,
  "Scientific_name": "Plumeria obtusa",
  "Code": 142,
  "Common_name": "Temple tree",
  "Family_name": "Apocynaceae",
  "Kannada_name": null,
  "Origin": "Mexico, South America",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Least concern",
  "Flowering_period": "All year",
  "Fruiting_period": "All year",
  "Uses": "This plant is commonly used as an ornamental, grown for its flowers. In Cambodia the flowers are used to make necklaces and in offerings to the deities. In traditional medicine used in that country, a decoction of the bark is given in varying doses as a purgative or as a remedy against oedema.",
  "Additional_information": "Plumeria can grow without water for a very longer period of time ",
  "Description": "Nearly evergreen small tree, up to 6 m tall. Young branches terete. Leaves simple, obovate to oblong-obovate, coriaceous, glabrous, base acutely cuneate, sometimes acute or rounded, apex rounded to emarginate often short mucronate, margin entire. Inflorescence a cyme. Flowers bisexual, white with yellow throats, fragrant. Fruit a follicle, 1--22 cm long. "
 },
 {
  "S_No": 143,
  "Scientific_name": "Plumeria rubra",
  "Code": 143,
  "Common_name": "Red frangipani",
  "Family_name": "Apocynaceae",
  "Kannada_name": "kempu kolabe",
  "Origin": "Mexico, Central America, Columbia",
  "Species type": "Indigenous",
  "Phenology": "Deciduous",
  "Conservation_status": "Least concern",
  "Flowering_period": "March - May and July - October",
  "Fruiting_period": "-",
  "Uses": " The plant has also been shown to be an antifungal, antiviral, analgesic, antispasmodic, and hypoglycemic. The plant has been known to promote digestion and excretion, along with respiratory and immune functions. The sap of the plant is used as a laxative and is a remedy for bloating and stomachaches. The bark is said to be purgative and is also used for venereal sores. The flowers can be boiled in water or juice and made into a salad to promote bowel movement, urine flow, and to control gas and phlegm. The flowers are also used in the treatment of asthma",
  "Additional_information": "Plumeria rubra is the national flower of Nicaragua, where it is known under the local name \"sacuanjoche\". It is also the village flower of Asan-Maina on Guam.",
  "Description": "Deciduous shrub or small tree, 2-8 m. bark thin and grey. Leaves simple, oblong-lanceolate to ovate, glabrous to sparsely pubescent below, base acute, apex acute to acuminate, margin entire. Inflorescence a cyme. Flowers bisexual, white, yellow, rose or combinations of these colours. Fruit a follicle, 9-3- cm long. "
 },
 {
  "S_No": 144,
  "Scientific_name": "Polyalthia longifolia",
  "Code": 144,
  "Common_name": "False Ashoka",
  "Family_name": "Annonaceae",
  "Kannada_name": "Ubbina mara, Kambada mara",
  "Origin": "India and Srilanka",
  "Species type": "Indigenous",
  "Phenology": "Evergreen",
  "Conservation_status": "Least concern",
  "Flowering_period": "March - May",
  "Fruiting_period": "July - September",
  "Uses": "The leaves are used for ornamental decoration during festivals. The tree is a focal point in gardens throughout India. The tree can be pruned into various shapes and maintained in required sizes. The flexible, straight and light-weight trunks were used in the making of masts for sailing ships. Its wood is mostly used for manufacturing small articles such as pencils, boxes, matchsticks, etc. The oil of the seed has been confirmed to possess anti-oxidant, anti-lipooxygenase and antimicrobial (against various microbe strains) activities, among others.",
  "Additional_information": "Methanolic extracts of Monoon longifolium have yielded 2- known and two new organic compounds, some of which show cytotoxic properties. The fatty acid composition of the seed has also been reported ",
  "Description": "Evergreen trees to 2- m tall; trunk straight. Branches finely striate, minutely puberulent when young, soon glabrous. Leaves simple, alternate, ovate-oblong to ovate-lanceolate, stiffly membranous to thinly leathery, glabrous, abaxially pale, adaxially dark glossy green, base cuneate, obtuse or rounded, apex acuminate, margin undulate.  Inflorescence axillary, fasciculate and shortly pedunculate, racemose, or umbelliform. Flowers bisexual, greenish-yellow. Fruit a berry, globose or ellipsoid. Seed pale brown, ovoid, usually with a longitudinal groove. "
 },
 {
  "S_No": 145,
  "Scientific_name": "Pterocarpus marsupium",
  "Code": 145,
  "Common_name": "Malabar Kino",
  "Family_name": "Fabaceae",
  "Kannada_name": "-",
  "Origin": "India",
  "Species type": "Indigenous",
  "Phenology": "Deciduous",
  "Conservation_status": "Near threatened",
  "Flowering_period": "September - October",
  "Fruiting_period": "September - October",
  "Uses": "The resin obtained from wounds in the bark is astringent. It is used in the treatment of chronic diarrhoea and the irritation caused by gastric infection and colitis. Although it has an unpleasant flavour, it makes a good mouthwash and gargle. It is commonly used in cases of toothache and also as a douche to treat vaginal discharge. The resin is applied topically in the treatment of skin conditions.",
  "Additional_information": null,
  "Description": "Deciduous trees, to 3- m high, bark 1--15 mm, surface grey or greyish-black, rough, deeply vertically cracked, exfoliations small, irregular, fibrous; blaze pink; exudation blood-red. Leaves imparipinnate, alternate, pulvinate, leaflets 5-7, alternate, lamina elliptic-oblong, oblong-ovate or oblong, glabrous, base obtuse or acute, apex obtuse and emarginate, margin entire. Inflorescence a terminal or axillary cyme. Flowers bisexual, yellow. Fruit a pod, orbicular-reniform, broadly winged; seed one, subreniform."
 },
 {
  "S_No": 146,
  "Scientific_name": "Pterocymbium tinctorium",
  "Code": 146,
  "Common_name": "Winged boot tree",
  "Family_name": "Malvaceae",
  "Kannada_name": "-",
  "Origin": "Peru",
  "Species type": "Exotic",
  "Phenology": "Deciduous",
  "Conservation_status": "Least concern",
  "Flowering_period": "January - May",
  "Fruiting_period": "January - May",
  "Uses": "A fibre obtained from the bark is used to make rope. The bark is used to improve black dyeing of cotton cloth. ",
  "Additional_information": null,
  "Description": "Deciduous trees, to 2- m high, bark grey-brown. Leaves simple, alternate, ovate or ovate-oblong, glabrous above, pubescent beneath, coriaceous, base cordate, apex acute or acuminate, margin entire. Inflorescence a terminal umbellate panicle. Flowers polygamous, yellow. Fruit a follicle, boat shaped with a pouch-like bulging at base, glabrous, membranous, 2-lobed, lower broad, round, upper linear, obtuse, glabrous, dehiscing before maturity; seed 1, 1 cm long, basal, ellipsoid to ovoid."
 },
 {
  "S_No": 147,
  "Scientific_name": "Pterospermum acerifolium",
  "Code": 147,
  "Common_name": "Bayur tree",
  "Family_name": "Malvaceae",
  "Kannada_name": "Kanaka champaka",
  "Origin": "Southeast Asia",
  "Species type": "Indigenous",
  "Phenology": "Evergreen",
  "Conservation_status": "Least concern",
  "Flowering_period": "January - April",
  "Fruiting_period": "January - April",
  "Uses": "They can be used as actual dinner plates or as packaging and storage by wrapping materials inside. In India they are shaped into regular dinner plates and soup bowls on moulds, some even stitched together with twigs. In Burma they are also used to dry tobacco upon. The leaves can also serve as a primitive method of re-enforcing roofs and preventing leaks. The pubescent under surface of the leaves is said to stop bleeding and can be used as tinder for a means of sparking fires.",
  "Additional_information": "The Bayur Tree even serves a cultural function. Local Hindu people employ the plant for religious purposes. Its bark is also supposed to be used in case of scabies and topical preparation in lipsticks",
  "Description": "Evergreen tree, 12-15 m tall; bark smooth, ash-coloured; branchlets ferruginous-tomentose. Leaves polymorphous, obovate to orbicular or oblong, cordate, grey-tomentose beneath, sometimes peltate at base, entire or sinuately lobed at apex, margin coarsely serrate. Inflorescence an axillary or solitary cyme. Flowers fragrant, pubescent, white. Fruit a capsule, oblong, 5-angled, woody and brown, tubercled. Seeds obliquely ovoid, compressed with a large membranous wing"
 },
 {
  "S_No": 148,
  "Scientific_name": "Pterygota alata",
  "Code": 148,
  "Common_name": "Buddha Coconut tree",
  "Family_name": "Malvaceae",
  "Kannada_name": "Kolugida, Tattale mara",
  "Origin": "India, Southeast Asia",
  "Species type": "Indigenous",
  "Phenology": "Deciduous",
  "Conservation_status": "Not known",
  "Flowering_period": "April - May",
  "Fruiting_period": "April - May",
  "Uses": "Alata fruits possess a narcotic like effect and utilized as an alternate for opium in India. The bark juice was used traditionally in the management of hemorrhoids, dropsy, swelling oedema, gout, leprosy and pain",
  "Additional_information": "-",
  "Description": "Large deciduous trees, buttressed, up to 3- m tall. Bark grey, longitudinally arranged lenticels; blaze yellowish cream. Young branchlets stout, terete, dense golden-brown stellate pubescence, later glabrous. Leaves simple, alternate, spiral, clustered at twig ends, broadly ovate or oblong-ovate, thinly coriaceous, glabrous, base cordate or subtruncate, apex acute or slightly acuminate, margin entire or slightly undulate, Inflorescence short axillary panicle, on old wood, rusty brown tomentose. Flowers polygamous, pale orange to red. Fruit a follicle of 3-5, globose or ovoid, woody; seeds winged."
 },
 {
  "S_No": 149,
  "Scientific_name": "Putranjiva roxburghii",
  "Code": 149,
  "Common_name": "Putranjiva",
  "Family_name": "Putranjivaceae",
  "Kannada_name": "Amani putranjiva",
  "Origin": "Southeast Asia, Indian subcontinent, South China",
  "Species type": "Indigenous",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": "March - August",
  "Fruiting_period": "March - August",
  "Uses": "A decoction of leaves and fruit is taken for the treatment of liver complaints, colds, fevers and rheumatism. ",
  "Additional_information": null,
  "Description": "Evergreen trees, up to 2- m high, bark dark grey, whitish when young with horizontal lenticels; branches generally pendent; branchlets terete, brown or blackish, slender, pubescent. Leaves simple, alternate, elliptic-oblong, glabrous, dark green, shining, coriaceous, base oblique, apex shortly acuminate, acute or obtuse with retuse tip; margin serrate or serrulate. Male inflorescence an axillary spike, female flowers solitary. Flowers unisexual, small, yellow; Fruit a drupe, ovoid-ellipsoid, white tomentose; seed one, crustaceous; pedicels 6-25 mm long."
 },
 {
  "S_No": 150,
  "Scientific_name": "Reutealis trisperma",
  "Code": 150,
  "Common_name": "Phillipine tung",
  "Family_name": "Euphorbiaceae",
  "Kannada_name": "-",
  "Origin": "Phillipines",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": "March - April",
  "Fruiting_period": "March - April",
  "Uses": "A drying oil is obtained from the seed. It was formerly made into a weak soap which was popular with sailors as it lathered with sea water. The oil has been widely utilized in the Philippines for illumination, for lubrication and to caulk ships. The oil is said to be an effective insecticide and can be applied as a wood preservative. The wood can be made into tea boxes, matches, wooden shoes and light construction material. Medicinally, sap from the bark has been used to cure scurf and the seed as a strong purgative.",
  "Additional_information": null,
  "Description": "Evergreen trees, up to 15 m tall. Leaves simple, alternate, ovate or ovate-cordate, abaxial surface with hair-tufts in many vein-axils, base usually deeply cordate with rounded lobes, sometimes rounded or obtuse on old trees, apex gland-tipped, margin entire. Plants dioecious, sometimes monoecious. Male inflorescences flat-topped, with many cymelets. Female inflorescences flat-topped, racemose, or thyrsoid. Flowers unisexual, white. Capsule depressed globose to obtusely trigonous; pericarp, longitudinally 3-angular, rugose, densely velutinous-pubescent."
 },
 {
  "S_No": 151,
  "Scientific_name": "Roseodendron donnell-smithii",
  "Code": 151,
  "Common_name": "Primavera, Gold tree",
  "Family_name": "Bignoniaceae",
  "Kannada_name": "-",
  "Origin": "Central America, Mexico",
  "Species type": "Exotic",
  "Phenology": "Deciduous",
  "Conservation_status": "Not known",
  "Flowering_period": null,
  "Fruiting_period": null,
  "Uses": "It is used for fine furniture, cabinetwork, decorative veneer, flooring etc. The wood is also used for fuel.",
  "Additional_information": null,
  "Description": "Large deciduous trees, 7-13 m, occasionally up to 35 m. Leaves are simple, 1-foliolate or digitately 3-7-foliolate; leaflets oblong-elliptic, membranous to chartaceous, puberulus underside or glabrescent, lepidotes present, base truncate, apex acute to acuminate, margin entire to serrate. Inflorescence a terminal panicle. Flowers bisexual, tubular, bright yellow, scattered pubescent. Fruit a capsule, linear-elongated, puberulous. Seeds surrounded by hyaline membranous wing. "
 },
 {
  "S_No": 152,
  "Scientific_name": "Roystonea regia",
  "Code": 152,
  "Common_name": "Royal palm",
  "Family_name": "Arecaceae",
  "Kannada_name": "-",
  "Origin": "Mexico, Central America, Caribbean",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Least concern",
  "Flowering_period": "March - April",
  "Fruiting_period": "March - April",
  "Uses": "Leaves are used for thatching and the wood for construction. The roots are used as a diuretic. They are also used as a treatment for diabetes.",
  "Additional_information": "In Roman Catholicism, R. regia plays an important role in Palm Sunday observances.",
  "Description": "Large palm, up to 4- m tall, usually displaying a distinct thickening towards the middle, greyish white, smooth. Crown roundish. Leaves pinnate, drooping, divided into numerous leaflets, pinnae in two rows on either side of rachis, linear, apex acuminate; petiole glabrous, unarmed, smooth, elongated into a leaf sheath forming a shining greenish elongated crown shaft, crown shaft reaching up to 12- cm; leaflets Inflorescence a spadix. Flowers unisexual, white, anthers pink. Fruit a drupe, globose to ellipsoid, fleshy, scar near the base of the fruit."
 },
 {
  "S_No": 153,
  "Scientific_name": "Samanea saman",
  "Code": 153,
  "Common_name": "Rain tree",
  "Family_name": "Fabaceae",
  "Kannada_name": "-",
  "Origin": "South America",
  "Species type": "Exotic",
  "Phenology": "Deciduous",
  "Conservation_status": "Least concern",
  "Flowering_period": "March - May",
  "Fruiting_period": "March - May",
  "Uses": "A decoction of the inner bark and fresh leaves is used as a treatment for diarrhoea. A brew of small sections of the bark is taken to treat stomach-ache. A crude aqueous or alcoholic extract of the leaves is observed to have an inhibiting effect on Mycobacterium tuberculosis. An infusion of the leaves is used as a laxative. The fruit decoction is used as a CNS-sedative. The seeds are chewed for treating a sore throat.",
  "Additional_information": "Children eat the pods, which contain a brownish, sticky, liquorice-like, sweet-flavoured pulp. A lemon-like fruit drink is also made from the pulp.",
  "Description": "Evergreen or deciduous tree to 2- m tall with a broad crown; bark rough, grey. Leaves bipinnate, alternate, pinnae 2–6 pairs; leaflets 6–16 pairs, rhombic-elliptic, asymmetric, increasing in size towards top of pinna, glabrous above, pubescent below, base acute, apex obtuse or rounded, margin entire. Inflorescence umbelliform capitulae. Flowers bisexual, pink with green lobes. Fruit a pod, indehiscent, brown or blackish, somewhat fleshy with a raised border."
 },
 {
  "S_No": 154,
  "Scientific_name": "Santalum album",
  "Code": 154,
  "Common_name": "Indian sandalwood tree",
  "Family_name": "Santalaceae",
  "Kannada_name": "Chandana, Srigandha",
  "Origin": "India, Southeast Asia",
  "Species type": "Indigenous",
  "Phenology": "Evergreen",
  "Conservation_status": "Vulnerable",
  "Flowering_period": "March - April",
  "Fruiting_period": "June - September",
  "Uses": "The wood or essential oil is taken internally in the treatment of genito-urinary disorders, fever, sunstroke, digestive problems and abdominal pain. A paste of the wood is used externally to treat skin complaints.",
  "Additional_information": "It is considered sacred in some religions like Hinduism, and some cultures place great significance on its fragrant and medicinal qualities.",
  "Description": "Evergreen trees, 4-1- m, occasionally up to 2- m high, bark surface dark grey to nearly black, rough with short vertical cracks. Leaves simple, opposite, ovate to lanceolate-elliptic, glabrous, base acute or round, apex obtuse or acute, margin entire. Inflorescence axillary and terminal paniculate cymes. Flowers bisexual, reddish-purple. Fruit a drupe, 8-12 mm across, globose, blackish-purple, annulate above, beaked with the basal part of the style; seed one."
 },
 {
  "S_No": 155,
  "Scientific_name": "Sapindus emarginatus",
  "Code": 155,
  "Common_name": "Notched-leaf soapnut",
  "Family_name": "Sapindaceae",
  "Kannada_name": "Koogate kaayi, Arutaala",
  "Origin": "Western Ghats, Indian subcontinent",
  "Species type": "Endemic",
  "Phenology": "Deciduous",
  "Conservation_status": "Not known",
  "Flowering_period": "November - March",
  "Fruiting_period": "November - March",
  "Uses": "The fruits possess several medicinal properties and are widely used, for example in the treatment of asthma, colic and dysentery, and during childbirth. ",
  "Additional_information": null,
  "Description": "Evergreen trees, to 18 m high, bark dark-brown, rough; branchlets tomentose. Leaves paripinnate, alternate; leaflets 2-3 pairs, oblong-obovate, oblanceolate or oblong, glabrescent above, softly tomentose beneath, base cuneate or obtuse, apex obtuse, round and emarginate, margin entire. Inflorescence a terminal or axillary cyme. Flowers polygamous, greenish-white. Fruit a drupe of 3 indehiscent cocci, combined about half way up and then separating with saponaceous fibrous pericarp; smooth and slightly pubescent when young, later glabrous and wrinkled; seeds black, globose, smooth."
 },
 {
  "S_No": 156,
  "Scientific_name": "Sapindus laurifolius",
  "Code": 156,
  "Common_name": "South Indian soapnut",
  "Family_name": "Sapindaceae",
  "Kannada_name": "Antuvaala",
  "Origin": "India",
  "Species type": "Indigenous",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": "November - January",
  "Fruiting_period": null,
  "Uses": "Kernel extracts of soapnut disrupt the activity of enzymes of larvae and pupae and inhibits the growth of the mosquito Aedes aegypti, an important vector of viral diseases.",
  "Additional_information": null,
  "Description": "Large trees, up to 25 m, branchlets purplish brown, lenticellate. Leaves are compound, leaflets 1-4 pairs, subopposite, elliptic-oblong to elliptic-lanceolate or obovate, glabrous, pubescent on midrib, acute to truncate or rounded at the base, emarginate to  acuminate at the apex. Inflorescence a terminal panicle. Flowers bisexual, greenish-white.  Fruit is 2-3 lobed, velvety when young, hard and smooth when mature. Each cell has a 6-9 mm black, round seed, which is what is popular as a traditional washing soap."
 },
 {
  "S_No": 157,
  "Scientific_name": "Saraca asoca",
  "Code": 157,
  "Common_name": "Ashoka tree",
  "Family_name": "Fabaceae",
  "Kannada_name": "Achange, Ashoka, Eliyaala",
  "Origin": "Indian Subcontinent",
  "Species type": "Indigenous",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": "February - March",
  "Fruiting_period": "July - October",
  "Uses": "The bark is also useful in dyspepsia, fever, and burning sensation. It is also used to treat menorrhagia, leucorrhoea, internal bleeding, hemorrhoids, and hemorrhagic dysentery",
  "Additional_information": "-",
  "Description": "Small evergreen trees, 7-1- m tall; Trunk often tubercled; bark lenticellate, dark, shallowly fissured; blaze purplish. Branchlets terete, glabrous. Leaves paripinnate, alternate; leaflets 4-6 pairs, narrow elliptic-oblong or lanceolate, subcoriaceous, glabrous, base acute to rounded or subcordate, apex acute to acuminate, margin undulate, young leaves red. Inflorescence dense corymbs. Flowers bisexual, orange, sometimes white; fragrant. Fruit a pod, flat, oblong, apiculate; seeds obovate-orbiculate."
 },
 {
  "S_No": 158,
  "Scientific_name": "Scheffelera actinophylla",
  "Code": 158,
  "Common_name": "Australian umbrella tree",
  "Family_name": "Araliaceae",
  "Kannada_name": "-",
  "Origin": "Australia",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Least concern",
  "Flowering_period": "July - September",
  "Fruiting_period": null,
  "Uses": "It is planted as an ornamental tree as it attracts different birds.",
  "Additional_information": null,
  "Description": "Evergreen tree, up to 12 m high, bark greenish. Leaves alternate; leaflets 7-16, oblanceolate, glabrous, glossy, apex acute, margin entire or dentate when young. Inflorescence a raceme. Flowers bisexual, red. Fruit a drupe, purplish-black when ripe, up to 7 mm in diameter. "
 },
 {
  "S_No": 159,
  "Scientific_name": "Schotia brachypetala",
  "Code": 159,
  "Common_name": "Weeping boer-bean, Tree fushchia",
  "Family_name": "Fabaceae",
  "Kannada_name": "-",
  "Origin": "Africa",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known ",
  "Flowering_period": "March - June",
  "Fruiting_period": "-",
  "Uses": "It is used to treat heart burn. Mixtures of bark are used to purify the blood and diarrhoea.",
  "Additional_information": null,
  "Description": "Evergreen to semi-deciduous tree up to 16 m high with a somewhat rounded crown. Bark greyish-to reddish-brown, rough or smooth; young branchlets glabrous to shortly pubescent. Leaves paripinnate, leaflets 3-6 pairs, opposite, oblong or obovate, coriaceous, glabrous to shortly pubescent, base cuneate, apex rounded or retuse, margin entire. Inflorescence a dense subglobose panicle, usually cauliflorous on older branches but occasionally terminal. Flowers bisexual, deep red or scarlet or crimson. Fruit a pod, oblong, flattened, glabrous, with numerous small resin-filled vesicles in the pod wall, several-seeded, tardily dehiscent leaving the dorsal and ventral sutures attached to the pedicel. Seeds light brown, ovoid, oblong or oblique with a large yellow basal aril."
 },
 {
  "S_No": 160,
  "Scientific_name": "Senegalia polyacantha",
  "Code": 160,
  "Common_name": "White thorn tree",
  "Family_name": "Fabaceae",
  "Kannada_name": "-",
  "Origin": "Africa, India, Asia",
  "Species type": "Indigenous",
  "Phenology": "Deciduous",
  "Conservation_status": "Not known",
  "Flowering_period": "June - September",
  "Fruiting_period": "June - September",
  "Uses": "The roots are tonic and also used as an antidote for snake bites. They are also used in the treatment of venereal diseases. A decoction of the bark is used in the treatment of dysentery and gastro-intestinal disorders.",
  "Additional_information": "The presence of the tree in the wild is said to be a good indicator that the land is suitable for growing tobacco and cotton.",
  "Description": "Deciduous tree up to 21 m. high; trunk with fissured bark and knobby persistent prickles. Young branchlets pubescent or puberulous, rarely subglabrous, grey to brown. Prickles in pairs just below each node, straw-coloured to brown or blackish. Leaves paripinnate, alternate, pinnae 15-25 pairs; leaflets 3--5-, opposite, elliptic, densely pubescent, chartaceous, base truncate, apex subacute or obtuse, margin ciliate. Inflorescence an axillary spike, solitary or paired. Flowers bisexual, cream or white. Fruit a pod, dehiscent, glabrous or nearly so, oblong, straight, venose. Seeds subcircular to elliptic-lenticular."
 },
 {
  "S_No": 161,
  "Scientific_name": "Senna montana",
  "Code": 161,
  "Common_name": "Mountain cassia",
  "Family_name": "Fabaceae",
  "Kannada_name": "-",
  "Origin": "India",
  "Species type": "Indigenous",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": "November - January",
  "Fruiting_period": "November - January",
  "Uses": null,
  "Additional_information": null,
  "Description": "Large shrubs to small trees, up to 4 m tall, young shoots yellow tomentose. Leaves paripinnate, alternate; leaflets oblong or elliptic, base rounded, apex obtuse to mucronate, margin entire. Inflorescence an axillary or terminal corymbose panicle. Flowers bisexual, yellow. Fruit compressed, beaked, ovoid, longitudinal."
 },
 {
  "S_No": 162,
  "Scientific_name": "Senna siamea",
  "Code": 162,
  "Common_name": "Siamese cassia",
  "Family_name": "Fabaceae",
  "Kannada_name": "Hiretangedi, Simethangadi",
  "Origin": "South Asia",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known ",
  "Flowering_period": "August - May",
  "Fruiting_period": "August - May",
  "Uses": "In traditional medicine, the fruit is used to charm away intestinal worms and to prevent convulsions in children. The heartwood is said to be a laxative, and a decoction is used against scabies.",
  "Additional_information": null,
  "Description": "Evergreen tree, 12-15 m tall, bark greyish brown, smooth, fissured at age, branchlets greenish brown, sparsely puberulent. Leaves pinnate, alternate; leaflets 6-1- pairs, oblong or ovate-oblong, coriaceous, abaxially finely pubescent, adaxially smooth and glabrous, base rounded, apex obtusely rounded, often emarginate, mucronate, margin entire. Inflorescence a raceme. Flowers bisexual, complete, bright yellow, sub persistent bract. Fruit a pod, numerous, long, narrow, flat dark, brown, strap shaped, stipitate, terete to compressed, dehiscent, with septae between the numerous seeds; seeds are bean shaped, shiny, dark."
 },
 {
  "S_No": 163,
  "Scientific_name": "Senna spectabilis",
  "Code": 163,
  "Common_name": "Golden wonder tree",
  "Family_name": "Fabaceae",
  "Kannada_name": null,
  "Origin": "south and central america",
  "Species type": "Exotic",
  "Phenology": "Deciduous",
  "Conservation_status": "Least concern",
  "Flowering_period": "June - August",
  "Fruiting_period": "December - February",
  "Uses": "The plant has been used to treat ringworm and skin disease. A leaf extract in alcohol has shown significant antifungal activity and suggests a potential use in infections caused by Candida albicans.",
  "Additional_information": null,
  "Description": "Small evergreen trees, 5-1- m tall, with long, spreading branches. Bark greyish brown, smooth, fissured at age. Young branches, petioles, and rachises of leaves densely yellowish brown velutinous. Leaves pinnate, alternate; leaflets 8-19 pairs, elliptic or oblong-lanceolate, abaxially densely yellowish brown velutinous, adaxially glabrous or puberulent, base subrounded and slightly oblique, apex acute, cuspidate. Flowers in terminal panicles or axillary racemes. Flowers bisexual, yellow. Fruit a pod, black, narrowly cylindric, slightly compressed, slightly contracted between seeds, annulate-septate, glabrous. Seeds 5--7-, suborbicular."
 },
 {
  "S_No": 164,
  "Scientific_name": "Simarouba glauca",
  "Code": 164,
  "Common_name": "Paradise tree",
  "Family_name": "Simaroubaceae",
  "Kannada_name": "-",
  "Origin": "Florida, South America, Caribbean",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Least concern",
  "Flowering_period": null,
  "Fruiting_period": null,
  "Uses": "The bark is taken as a decoction or tea for diarrhoea and fever. Leaves are used for rheumatism or are applied in the form of a lotion for body pain, bruises or skin itch.",
  "Additional_information": null,
  "Description": "Small to medium-sized evergreen, dioecious tree growing up to 15 m in height, straight, cylindrical bole, bark brown with irregular superficial fissures. Leaves imparpinnate, alternate; leaflets 5-15, oblong, elliptic, rounded, paler and puberulous beneath, often notched or smooth at the apex. Inflorescence a terminal or axillary panicle. Flowers unisexual, occasionally bisexual flowers are borne, yellowish-white. Fruit a drupe, purple or black at maturity, about 1.5 cm long. "
 },
 {
  "S_No": 165,
  "Scientific_name": "Spathodea campanulata",
  "Code": 165,
  "Common_name": "African tulip tree",
  "Family_name": "Bignoniaceae",
  "Kannada_name": "Jeerkolavi kaayi, Neeru kaayi",
  "Origin": "Africa",
  "Species type": "Exotic",
  "Phenology": "Deciduous",
  "Conservation_status": "Not known ",
  "Flowering_period": "March - April",
  "Fruiting_period": "June - August",
  "Uses": "The bark has laxative and antiseptic properties. The bark is chewed and sprayed over swollen cheeks. The bark may also be boiled in water used for bathing newly born babies to heal body rashes. Extracts of the bark, leaves and flowers are used to treat malaria, HIV, diabetes mellitus, oedema, dysentery, constipation, gastrointestinal disorders, ulcers, skin diseases, wounds, fever, urethral inflammation, liver complaints and as a poison antidote.",
  "Additional_information": null,
  "Description": "Large, evergreen or semi-deciduous tree, up to 25 m tall. Trunk sometimes buttressed, bark lenticellate. Leaves imparipinnate, usually 9-15-foliolate, the leaflets more or less elliptic, slightly puberulous along main veins, base asymmetrically subtruncate or widely cuneate, apex acute to acuminate. Inflorescence a terminal raceme. Flowers bisexual, bright vermillion or scarlet, with yellow-orange margin. Fruit a capsule, erect, slightly woody, fusiform, compressed, angular (like a flat–bottomed boat when dehisced), lenticellate, glabrous or densely tomentose when young, glabrescent when older. Seeds compressed, wings hyaline."
 },
 {
  "S_No": 166,
  "Scientific_name": "Stenocarpus sinuatus",
  "Code": 166,
  "Common_name": "Firewheel tree",
  "Family_name": "Proteaceae",
  "Kannada_name": "-",
  "Origin": "Australia",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known ",
  "Flowering_period": "February - March",
  "Fruiting_period": "January - July",
  "Uses": "It is used as an ornamental tree.",
  "Additional_information": "-",
  "Description": "Medium to large tree, up to 35 m tall. The bark is greyish brown, not smooth and irregular. Leaves simple or pinnatifid, alternate, oblong-lanceolate, irregularly lobed to entire, coriaceous, glabrous, apex obtuse. Inflorescence an umbel. Flowers bisexual, bright red. Fruit a follicle, dehiscent; seeds 4, winged. "
 },
 {
  "S_No": 167,
  "Scientific_name": "Sterculia balanghas",
  "Code": 167,
  "Common_name": "Nawa",
  "Family_name": "Malvaceae",
  "Kannada_name": "-",
  "Origin": "India, Sri Lanka",
  "Species type": "Indigenous",
  "Phenology": "Deciduous",
  "Conservation_status": "Not known",
  "Flowering_period": null,
  "Fruiting_period": null,
  "Uses": "The fibre obtained from the bark is used to make cottages.",
  "Additional_information": null,
  "Description": "Deciduous trees, to 18 m high, bole buttressed; bark grey, smooth, exfoliating in thin round flakes; branchlets tomentose. Leaves simple, alternate, pulvinate leaf base, elliptic, obovate, oblong, elliptic-ovate or oblong-ovate, stellate hairy to velvety beneath, base subcordate or round, apex acuminate, margin entire. Inflorescence a terminal or axillary panicles. Flowers unisexual or polygamous, yellow or greenish-purple. Fruits woody follicles, horizontally spreading, orange-red, oblong, rusty tomentose; seeds oblong, black, shiny."
 },
 {
  "S_No": 168,
  "Scientific_name": "Sterculia foetida",
  "Code": 168,
  "Common_name": "Bastard poon tree, Java olive tree",
  "Family_name": "Malvaceae",
  "Kannada_name": "-",
  "Origin": "South Africa",
  "Species type": "Exotic",
  "Phenology": "Deciduous",
  "Conservation_status": "Not known ",
  "Flowering_period": "February - August",
  "Fruiting_period": "February - August",
  "Uses": "The bark is aperient, diaphoretic and diuretic. It is used in the treatment of dropsy and rheumatism. The leaves are aperient.The fruit is astringent and mucilaginous. It is used in the treatment of gonorrhoea.",
  "Additional_information": "-",
  "Description": "Deciduous trees, to 25 m high, bole buttressed; bark grey, smooth, irregularly flaking off in thin scales; blaze reddish-yellow; branches horizontal, whorled. Leaves palmately compound, alternate, clustered at the end of branchlets; leaflets 3-9, elliptic, elliptic-lanceolate or elliptic oblanceolate, glabrous, coriaceous, base cuneate, apex acuminate, margin entire. Inflorescence a terminal or axillary raceme. Flowers unisexual or polygamous, dull-orange red, foetid smell. Fruit an aggregate of follicle of 1-5, scarlet, boat shaped, 5-lobed, woody, glabrous; seeds black, numerous, ellipsoid, smooth, with a small yellow aril."
 },
 {
  "S_No": 169,
  "Scientific_name": "Stereospermum tetragonum",
  "Code": 169,
  "Common_name": "Yellow snake tree",
  "Family_name": "Bignoniaceae",
  "Kannada_name": "Kalladri, Kalludure",
  "Origin": "India, Sri lanka",
  "Species type": "Indigenous",
  "Phenology": "Deciduous",
  "Conservation_status": "Not known",
  "Flowering_period": null,
  "Fruiting_period": null,
  "Uses": "An infusion of the pleasant tasting root, as well as the fragrant flowers, is used as a cooling drink in the treatment of fevers. The juice of the bark is used to treat indigestion.",
  "Additional_information": null,
  "Description": "Deciduous trees, 15–2- m tall. Leaves pinnate, leaflets 3-6 pairs; leaflets opposite, elliptic-ovate, pubescent or glabrous, base oblique or cunaeate, apex acute or acumiante. Inflorescence a terminal panicle. Flowers bisexual, pale yellow, tube terete, tomentose at mouth. Fruit a capsule, terete, 4-angular. Seeds ovoid, white membranous winged at apices. "
 },
 {
  "S_No": 170,
  "Scientific_name": "Swietenia macrophylla",
  "Code": 170,
  "Common_name": "Honduran Mahogany",
  "Family_name": "Meliaceae",
  "Kannada_name": "Dal, Davala, Hebbaevu, Mahaagani.",
  "Origin": "Central America",
  "Species type": "Exotic",
  "Phenology": "Deciduous",
  "Conservation_status": "Least concern",
  "Flowering_period": "March - April",
  "Fruiting_period": "September - December",
  "Uses": "The bark is astringent, bitter and febrifuge. An infusion is used to treat diarrhoea and fevers. The bark is used for dyeing and tanning leather.",
  "Additional_information": "-",
  "Description": "Deciduous trees, to 3- m high; bark brown. Leaves paripinnate, alternate, glabrous; leaflets 4-1-, opposite, obliquely ovate-lanceolate, glabrous, shining above, dull beneath, coriaceous, base oblique, apex acuminate or caudate-acuminate, margin entire. Inflorescence an axillary panicle. Flowers bisexual, pale yellow. Fruit a capsule, oblong-globose, woody, rusty outside; seeds many, winged."
 },
 {
  "S_No": 171,
  "Scientific_name": "Swietenia mahagoni",
  "Code": 171,
  "Common_name": "Small - leaved Mahogany. Cuban Mahogany",
  "Family_name": "Meliaceae",
  "Kannada_name": "-",
  "Origin": "North America",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Least concern",
  "Flowering_period": "March - April",
  "Fruiting_period": "September - November",
  "Uses": "The stem bark is considered to be antiseptic, astringent and febrifuge. It is taken orally as a decoction for diarrhoea and dysentery, as a source of vitamins and iron, and as a medicine to induce haemorrhage. When the bark is steeped to a red liquid, it is taken to clear the blood, increase appetite, and restore strength in cases of tuberculosis. A decoction of the bark is used externally to dress wounds caused by firearms.",
  "Additional_information": "-",
  "Description": "Semi-evergreen trees to 3- m tall, base buttressed. Bark slightly red, scalelike. Branches gray, expanding, smooth. Leaves pinnate, alternate; leaflets 5 pairs, ovate to lanceolate, leathery, glabrous to sparsely pubescent, abaxially light green, adaxially dark green, base oblique, apex long acuminate, margin entire or with 1 or 2 serrations. Inflorescence a panicle. Flowers small, bisexual, cream-yellow, glabrous. Fruit a capsule, brown, ovoid, Seeds apically winged."
 },
 {
  "S_No": 172,
  "Scientific_name": "Syzygium cuminii",
  "Code": 172,
  "Common_name": "Java plum",
  "Family_name": "Myrtaceae",
  "Kannada_name": "Nerale hannu mara",
  "Origin": "Indian subcontinent, South east Asia",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known ",
  "Flowering_period": "March - April",
  "Fruiting_period": "May - June",
  "Uses": "Medicinally, the fruit is stated to be astringent, stomachic, carminative, antiscorbutic and diuretic and have antidiabetic properties",
  "Additional_information": "-",
  "Description": "Evergreen trees, 6-2- m tall. Branchlets greyish white when dry, terete. Leaves simple, opposite broadly elliptic to narrowly elliptic, leathery, both surfaces with small glands, glabrous, base cuneate to obtuse, apex acuminate, margin entire.  Inflorescences axillary on flowering branches or occasionally terminal, paniculate cymes. Flowers bisexual, greenish-white, stamens many. Fruit a berry, red to black, ellipsoid to oblong, juicy, seed 1. "
 },
 {
  "S_No": 173,
  "Scientific_name": "Tabebuia aurea",
  "Code": 173,
  "Common_name": "Silver trumpet tree",
  "Family_name": "Bignoniaceae",
  "Kannada_name": "-",
  "Origin": "Tropical America",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known ",
  "Flowering_period": "February - April",
  "Fruiting_period": null,
  "Uses": "The wood is used for tool handles, objects that need to be curved, flexible rulers, furniture, frames, construction etc.",
  "Additional_information": "-",
  "Description": "Semi-deciduous tree, up to 16 m tall. Young branches often thick and corky, subterete to subtetragonous, lepidote. Palmate leaves with 5-7 leaflets; leaflets oblong-elliptic to narrowly oblong-lanceolate, coriaceous, light olive green when dry, lepidote or glabrous. Inflorescence a terminal panicle, showy, the branches densely lepidote, base rounded to subcordate, rounded apex or retuse, margin entire. Inflorescence a panicle. Flowers bisexual, tubular, yellow. Fruit a capsule, oblong, greyish, densely lepidote, tapering towards both ends. Seeds with two hyaline-membranous wings on the edges, irregularly brownish at the base, rather continuous with the seed body. "
 },
 {
  "S_No": 174,
  "Scientific_name": "Tabebuia pallida",
  "Code": 174,
  "Common_name": "Cubban Pink trumpet",
  "Family_name": "Bignoniaceae",
  "Kannada_name": "-",
  "Origin": "Carribean",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known ",
  "Flowering_period": "January - February",
  "Fruiting_period": null,
  "Uses": "It is used in traditional medicine in the form of herbal or medicinal tea to manage cancer, fever, and pain. Moreover, extracts from the leaves of T. pallida showed anticancer activity.",
  "Additional_information": "-",
  "Description": "Semi-deciduous or small tree, up to 15 m. Leaves 1-5-foliolate, the leaflets elliptic to elliptic-oblong, obtuse, basally rounded, chartaceous, lepidote. Inflorescence a few-flowered terminal panicle, often reduced to one or 2 flowers. Flowers bisexual, pinkish- lavender to almost white, the throat opening yellow, tubular. Fruit a capsule, linear-cylindric, attenuate at both ends, seeds bialate, the wings hyaline-membranaceous, sharply demarcated from the seed body."
 },
 {
  "S_No": 175,
  "Scientific_name": "Tabebuia rosea",
  "Code": 175,
  "Common_name": "Rosy trumpet tree",
  "Family_name": "Bignoniaceae",
  "Kannada_name": "-",
  "Origin": "Mexico, Ecuador, Venezuela",
  "Species type": "Exotic",
  "Phenology": "Deciduous",
  "Conservation_status": "Least concern",
  "Flowering_period": "January - February",
  "Fruiting_period": "February - April",
  "Uses": "Preparations of the bark of the tree are consumed to eliminate intestinal parasites, malaria and uterine cancer. A decoction of the bark is recommended for anemia and constipation. A decoction of the flowers, leaves and roots has been used to reduce fevers and pain, cause sweating, to treat tonsil inflammation and various other disorders",
  "Additional_information": null,
  "Description": "It is a medium to large deciduous tree upto 25m tall.  Leaves are compound, digitate and deciduous. Each leaf has five leaflets of variable size, the middle one being the largest. Flowers purplish-pink to nearly white, up to 8 cm long. Fruit a linear dehiscent capsule containing many winged seeds."
 },
 {
  "S_No": 176,
  "Scientific_name": "Tamarindus indica",
  "Code": 176,
  "Common_name": "Tamarind ",
  "Family_name": "Fabaceae",
  "Kannada_name": "Hunase mara",
  "Origin": "Tropical Africa",
  "Species type": "Exotic",
  "Phenology": "Deciduous",
  "Conservation_status": "Not known ",
  "Flowering_period": "April - June",
  "Fruiting_period": "October - December",
  "Uses": "Leaf extracts exhibit anti-oxidant activity in the liver, and are a common ingredient in cardiac and blood sugar reducing medicines. A sweetened decoction of the leaves is good against throat infection, cough, fever, and even intestinal worms. The fruit is aperient and laxative. A syrup made from the ripe fruit is drunk in order to keep the digestive organs in good condition, and also as a remedy for coughs and chest colds. The flesh of the fruit is eaten to cure fevers and control gastric acid",
  "Additional_information": "-",
  "Description": "Evergreen trees, up to 2- m high, bark brown to brownish-black, rough with vertical fissures; branchlets warty, tomentose. Leaves paripinnate, alternate; leaflets oblong, glabrous, chartaceous, base unequal, apex obtuse, margin entire. Inflorescence a terminal raceme. Flowers bisexual, yellow with reddish-pink dots. Fruit a pod oblong, fruit wall crustaceous, mesocarp pulpy, endocarp septate, leathery, indehiscent; seeds obovoid-orbicular, compressed, brown.."
 },
 {
  "S_No": 177,
  "Scientific_name": "Tecoma stans",
  "Code": 177,
  "Common_name": "Yellow elder, Yellow trumpetbush",
  "Family_name": "Bignoniaceae",
  "Kannada_name": "Koranechellar",
  "Origin": "South America",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known ",
  "Flowering_period": "October - May",
  "Fruiting_period": "June - August",
  "Uses": "A leaf infusion can be taken orally for treating diabetes and stomach pains. A strong leaf and root decoction is taken orally as a diuretic, to treat syphilis or for intestinal worms. The flowers are diuretic.",
  "Additional_information": "-",
  "Description": "Shrub or small evergreen tree, glabrous. Leaves imparipinnate, opposite, 3–9-foliolate; leaflets lanceolate, apex acute to acuminate, puberulent especially on the main veins, base oblique, apex acuminate, margin serrate. Inflorescence a terminal raceme of up to 2- yellow flowers. Flowers bisexual, tubular, bright yellow, fragrant. Fruit a capsule, dehiscent. Seeds orbicular-compressed, winged. "
 },
 {
  "S_No": 178,
  "Scientific_name": "Tectona grandis",
  "Code": 178,
  "Common_name": "Teak wood tree",
  "Family_name": "Lamiaceae",
  "Kannada_name": "Tegu, Saagavaani",
  "Origin": "Bangladesh, India, Sri Lanka, Myanmar",
  "Species type": "Indigenous",
  "Phenology": "Deciduous",
  "Conservation_status": "Not known",
  "Flowering_period": "June - August",
  "Fruiting_period": "November - January",
  "Uses": "The bark has been used as an astringent and in the treatment of bronchitis. The flowers are diuretic. They are used to treat biliousness, bronchitis and urinary disorders. It is used in the manufacture of outdoor furniture and boat decks. It is also used for cutting boards, indoor flooring, countertops and as a veneer for indoor finishings.",
  "Additional_information": null,
  "Description": "Large deciduous tree, up to 4- m tall, younger parts densely pubescent with stellate hairs. Leaves simple, opposite, broadly elliptic, glabrescent, shining-green above, paler and tomentose beneath, coriaceous, base attenuate, apex acute or shortly acuminate, margin entire to repand-dentate. Inflorescence a terminal cyme. Flowers white, rarely pinkish, bisexual. Fruit a drupe, subglobose to tetragonally flattened, tomentose, usually slightly 4-lobed at the apex, epicarp spongy, endocarp stony; seeds 1-4, oblong. "
 },
 {
  "S_No": 179,
  "Scientific_name": "Terminalia arjuna",
  "Code": 179,
  "Common_name": "Arjun tree",
  "Family_name": "Combretaceae",
  "Kannada_name": "Neeru matti, Tore matti",
  "Origin": "Indian Subcontinent",
  "Species type": "Indigenous",
  "Phenology": "Evergreen",
  "Conservation_status": "Least concern",
  "Flowering_period": "May - June",
  "Fruiting_period": "September - November",
  "Uses": "The bark of Arjun is astringent, sweet, acrid, cooling, aphrodisiac, urinary astringent, and expectorant, but, chiefly used as cardio tonic as it improves blood supply to heart. It is also useful in ulcer treatment, fractures, cirrhosis of liver, ischaemic heart disease, and hypertension.\n",
  "Additional_information": "-",
  "Description": "A large, evergreen or deciduous tree, up 25 m tall with smooth, pale greenish to whitish grey bark. Leaves simple, alternate to opposite, oblong-elliptic or somewhat sub-orbicular, obtuse, rarely subacute, glabrous to subglabrous above, partially pubescent beneath, rounded or cordate base, apex obtuse, margin entire or crenate-serrate. Inflorescence axillary or terminal paniculate spikes. Flowers bisexual, yellowish white, sessile, hypanthium broadly campanulate, Fruit a drupe, 5-angled, ovoid-oblong, brown with wings."
 },
 {
  "S_No": 180,
  "Scientific_name": "Terminalia bellirica",
  "Code": 180,
  "Common_name": "Baheda",
  "Family_name": "Combretaceae",
  "Kannada_name": "Taarekaayi, Shanthikayi",
  "Origin": "Tropical Asia, India",
  "Species type": "Indigenous",
  "Phenology": "Evergreen",
  "Conservation_status": "Least concern",
  "Flowering_period": "April - May",
  "Fruiting_period": "November - February",
  "Uses": "The fruit is anthelmintic, astringent, digestive, tonic and laxative. It is used internally principally in the treatment of digestive and respiratory problems. In Indian herbal medicine the ripe fruit is used in cases of diarrhoea and indigestion, whilst the unripe fruit is used as a laxative in cases of chronic constipation. The fruit is often used to treat upper respiratory tract infections that cause symptoms of sore throats, hoarseness and coughs. Externally, the fruit is used to make a lotion for sore eyes.",
  "Additional_information": "-",
  "Description": "Deciduous trees, up to 35 m high, bole often buttressed; bark surface blackish-grey, smooth, vertically shallowly fissured, exfoliations small, semi-fibrous; blaze yellow; branches sympodial; branchlets terete, thinly fulvous-hairy, leaf scars prominent. Leaves simple, opposite or alternate, clustered at the tip of branchlets, obovate, elliptic or obovate-elliptic, glabrous, base obliquely cuneate, attenuate or acute; apex obtusely acuminate, margin entire. Inflorescence an axillary spike. Flowers bisexual, greenish-yellow. Fruit a drupe, obovoid, obscurely 5-ridged, yellowish-brown, honed, not winged, softly tomentose; seed one, ellipsoid."
 },
 {
  "S_No": 181,
  "Scientific_name": "Terminalia catappa",
  "Code": 181,
  "Common_name": "Indian almond",
  "Family_name": "Combretaceae",
  "Kannada_name": "Kaadubaadaami",
  "Origin": "Asia, Australia",
  "Species type": "Exotic",
  "Phenology": "Deciduous",
  "Conservation_status": "Least concern",
  "Flowering_period": "March - June",
  "Fruiting_period": "July - September",
  "Uses": "The red leaves act as a vermifuge, while the sap of young leaves, cooked with oil from the kernel, is used to treat leprosy. The juice of the leaves is ingested for coughs. An infusion of the leaves is used to treat jaundice. Externally, the leaves may be rubbed on breasts to cure pain or, when heated, may be applied to numb parts of the body. They may be used as a dressing for swollen rheumatic joints. The leaves, applied to the head and sides, are refreshing and sudorific",
  "Additional_information": null,
  "Description": "Deciduous or semievergreen trees up to 2- m tall. Bark brownish black, longitudinally peeling. Branches spreading, forming tiers. Branchlets densely brownish yellow tomentose near apex, densely covered with conspicuous leaf scars. Leaves alternate, crowded at apices of branchlets; leaf blade obovate to oblanceolate, narrowed in proximal half, both surfaces glabrous or abaxially sparsely softly hairy when young, base narrow, cordate or truncate, apex obtuse or mucronate, margin entire. Inflorescences axillary, simple, long, slender spikes. Flowers bisexual, fragrant, white to greenish. Fruit a drupe, red or blackish green when ripe, ellipsoid, slightly to strongly compressed, pericarp woody, rigid. "
 },
 {
  "S_No": 182,
  "Scientific_name": "Terminalia mantaly",
  "Code": 182,
  "Common_name": "Madagascar Almond",
  "Family_name": "Combretaceae",
  "Kannada_name": "-",
  "Origin": "Madagascar",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": null,
  "Fruiting_period": null,
  "Uses": "The bark and wood are astringent. They are used in the treatment of dysentery. ",
  "Additional_information": null,
  "Description": "It is a small to medium Evergreen tree, 1--2- m tall. Bark pale grey, smooth and rather \nmottled. Its crown is layered in symmetrical tiers. Leaves simple, in rosettes of 4-9 equal leaves on short thick stems, spathulate, glabrous, base tapered, apex broadly rounded, margin wavy to crenate. Inflorescence a spike. Flowers small, greenish. Fruit a drupe, small, oval; seeds 1.5 cm long, wingless. "
 },
 {
  "S_No": 183,
  "Scientific_name": "Thespesia populnea",
  "Code": 183,
  "Common_name": "Portia tree, Pacific rosewood, Indian tulip tree",
  "Family_name": "Malvaceae",
  "Kannada_name": "Adavi bende mara, Huvarasi mara",
  "Origin": "Tropical Africa and Asia",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": "All year",
  "Fruiting_period": "All year",
  "Uses": "The fruit juice is used to treat herpes. The crushed fruit is used in a treatment for urinary tract problems and abdominal swellings. An extract of the fruit is applied to swollen testicles. A decoction of the leaves is used in treating coughs, influenza, headache and relapses in illnesses. The stem is employed in treating breast cancer.",
  "Additional_information": null,
  "Description": "Evergreen or dry deciduous trees, up to 15 m high, bark dark brown; blaze yellowish-pink; branchlets densely covered with minute scales, glabrescent. Leaves simple, alternate, orbicular or ovate, coriaceous, with peltate scales above, glabrescent or stellate-tomentose beneath, base cordate or truncate, apex acute or acuminate, margin entire or dentate. Inflorescence solitary or terminal and axillary cyme. Flowers bisexual, yellow, showy. Fruit a capsule, globose, indehiscent, depressed, scaly, ultimately glabrescent; seeds many, ovoid, channeled along the back, pubescent."
 },
 {
  "S_No": 184,
  "Scientific_name": "Toona ciliata",
  "Code": 184,
  "Common_name": "Red cedar",
  "Family_name": "Meliaceae",
  "Kannada_name": "-",
  "Origin": "Australia, Papua New Guinea",
  "Species type": "Exotic",
  "Phenology": "Deciduous",
  "Conservation_status": "Least concern",
  "Flowering_period": "February - May",
  "Fruiting_period": "September - November",
  "Uses": "The bark is a powerful astringent, febrifuge, tonic, and antiperiodic. It is used to treat chronic dysentery and wounds. A resinous gum obtained from the bark is used to treat boils. The flowers are emmenagogue",
  "Additional_information": null,
  "Description": "Semi-deciduous trees, up to 3- m high, bark reddish-brown, rough, exfoliating in large flakes; fibrous; blaze pink red with white streaks and strong smell. Leaves paripinnate, alternate, clustered at the tips of branchlets; leaflets 1--14 pairs opposite or subopposite, ovate, ovate-lanceolate or oblong-lanceolate, chartaceous, glossy above, pale beneath, base oblique, apex acuminate, margin entire or serrate. Inflorescence an axillary or terminal panicle. Flowers bisexual, white. Fruit a capsule, 5-valved; seeds many, oblong, thin, winged at both ends."
 },
 {
  "S_No": 185,
  "Scientific_name": "Triplaris weigeltiana",
  "Code": 185,
  "Common_name": "Ant tree",
  "Family_name": "Polygonaceae",
  "Kannada_name": "-",
  "Origin": "South America",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": null,
  "Fruiting_period": null,
  "Uses": "A decoction of the bark is used in the treatment of dysentery, diarrhoea and piles. It is used for furniture components, boxes and crates, interior construction, joinery, fibreboard and particleboard.",
  "Additional_information": null,
  "Description": "It is a tree growing up to 5 m tall or more. Leaves subsessile, acute apically, wedge-shaped at the base, entire, longitudinally lined, and with numerous pairs of prominent lateral veins. Flower spikes are 6-1- cm long, bearing numerous ovate to ovate-lanceolate, hirtellous bracts, pistillate perianth accrescent and enclosing the fruit, three of the sepals much enlarged, 2.8-3.2 cm long, 4-5 mm wide, suffused red purple, showy."
 },
 {
  "S_No": 186,
  "Scientific_name": "Vachellia leucophloea",
  "Code": 186,
  "Common_name": "White bark acacia",
  "Family_name": "Fabaceae",
  "Kannada_name": "Bili jaari mara, Naayi bela",
  "Origin": "South and Southeast Asia",
  "Species type": "Indigenous",
  "Phenology": "Deciduous",
  "Conservation_status": "Not known",
  "Flowering_period": "July - November",
  "Fruiting_period": "April - June",
  "Uses": "The bark extracts are used in Pakistani traditional medicine as an astringent, a preventive of infections, an anthelmintic, a vulnerary, a demulcent, an expectorant, an antipyretic, an antidote for snake bites and in the treatment of bronchitis, cough, vomiting, wounds, ulcers, diarrhea, dysentery and skin diseases.",
  "Additional_information": null,
  "Description": "Deciduous trees, up to 2- m high; bark yellow to yellowish-brown, rough, exfoliating in irregular scales; blaze light red; branchlets yellowish-velvety, spines present. Leaves bipinnate, alternate, pinnae 5-15 pairs; leaflets 3--54, opposite, sessile, linear, glabrous above, pubescent below, chartaceous, base oblique, truncate, apex subacute, margin ciliate. Inflorescence a head in terminal panicle. Flowers yellow or yellowish-white. Fruit a pod, flat, strap-shaped, straight or sometimes curved, somewhat bullate along seeds, thin walled, round or often mucronate at apex, minutely brown tomentose, sessile to subsessile, tardily dehiscent; seeds ovate. "
 },
 {
  "S_No": 187,
  "Scientific_name": "Vitex altissima",
  "Code": 187,
  "Common_name": "Peacock chaste tree",
  "Family_name": "Lamiaceae",
  "Kannada_name": "Myrole, Nevaladi, Navuladi, Balgay",
  "Origin": "Bangladesh, India, Myanmar",
  "Species type": "Exotic",
  "Phenology": "Deciduous",
  "Conservation_status": "Least concern",
  "Flowering_period": "April - May",
  "Fruiting_period": "July - August",
  "Uses": "The bark is used as a fomentation in treating rheumatic swellings. The leaves and roots are used in Ayurvedic medicine. The plant is believed to pacify vitiated kapha, vata. It is used to treat inflammations, wounds, ulcers, allergies, eczema, pruritus, worm infestations, urinary system diseases, stomatitis, emaciation, and ailments after parturition.",
  "Additional_information": null,
  "Description": "Deciduous trees, up to 3- m high, bark greyish-yellow, scaly; blaze yellow; branchlets, quadrangular, lenticellate, minutely tomentose. Leaves compound, trifoliate, rarely up to 5, opposite, rachis slender, pubescent, winged in sapling leaves, wings auriculate at base; leaflets sessile, lanceolate, elliptic-lanceolate, or oblanceolate, glabrous above and pubescent or glabrescent along the nerves below, chartaceous, base cuneate or acute, apex acuminate, margin entire. Inflorescence a terminal panicle. Flowers bisexual, white, tinged with blue. Fruit a drupe, smooth, globose, glabrous, blue, supported by enlarged calyx; seeds 4, obovate."
 },
 {
  "S_No": 188,
  "Scientific_name": "Vitex negundo",
  "Code": 188,
  "Common_name": "Chaste tree",
  "Family_name": "Lamiaceae",
  "Kannada_name": "Karilakki, Lakkigida",
  "Origin": "Eastern and Southern Africa and Asia",
  "Species type": "Indigenous",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": "April - August",
  "Fruiting_period": "February - July",
  "Uses": "It is used for treating stored garlic against pests and as a cough remedy. It is also used in traditional herbal medicine for women's health, including treatments for regulating the menstrual cycle, fibrocystic breast disease and post-partum remedies.",
  "Additional_information": null,
  "Description": "Shrubs or small evergreen trees, whitish to greyish tomentose except the upper surface of leaves and fruits, branchlets quadrangular. Leaves compound, 3-5 foliate, opposite-decussate, leaflets usually narrowly oblong or elliptic to lanceolate, chartaceous, dark green sparsely pubescent above, paler grayish pubescent beneath, base acute, apex acuminate, margin entire or serrate. Inflorescence a terminal panicle. Flowers bisexual, small, usually blue or violet, subsessile to shortly pedicelled. Fruit is a drupe subglobose or somewhat ovoid, usually 4-celled, with 1 seed in each cell."
 },
 {
  "S_No": 189,
  "Scientific_name": "Wodyetia bifurcata",
  "Code": 189,
  "Common_name": "Foxtail Palm",
  "Family_name": "Arecaceae",
  "Kannada_name": "-",
  "Origin": "Australia",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Conservation dependent",
  "Flowering_period": "December - February",
  "Fruiting_period": "October - December",
  "Uses": "It is used as an ornamental tree.",
  "Additional_information": null,
  "Description": "Stem light grey, slightly bottle-shaped, 6-15 m tall, monoecious palm, closely ringed with leaf-scars. Leaves pinnate, appearing plumose; sheaths tubular, forming a prominent crownshaft, covered with greyish-white tomentum; primary pinnae 9--1-7, divided into several linear segments or deeply lobed, glabrous, base slightly cuneate, apex coarsely praemorse. Inflorescence infrafoliar, decompound. Flowers in widely spaced triads, 1 female between 2 males, white. Fruit a berry, globose-ovoid, orange-red on ripening. Seed beaked. "
 },
 {
  "S_No": 190,
  "Scientific_name": "Ziziphus mauritiana",
  "Code": 190,
  "Common_name": "Indian jujube",
  "Family_name": "Rhamnaceae",
  "Kannada_name": "Bore, Elachi",
  "Origin": "Southeast Asia",
  "Species type": "Exotic",
  "Phenology": "Evergreen",
  "Conservation_status": "Not known",
  "Flowering_period": "July - October",
  "Fruiting_period": "December - March",
  "Uses": "It aids weight gain, improves muscular strength and increases stamina. In Chinese medicine it is prescribed as a tonic to strengthen liver function. The fruits are anodyne, anticancer, antidote, expectorant, pectoral, refrigerant, sedative, stomachic, styptic and tonic. ",
  "Additional_information": null,
  "Description": "Evergreen or deciduous trees, up to 1- m high; bark dark grey or nearly black, with deep vertical cracks, reddish and fibrous inside; branchlets, petiole and underside of leaves white buff, tomentose, with stipular spines. Leaves simple, alternate, ovate, elliptic-ovate, elliptic-orbicular or suborbicular, glabrous above, coriaceous, base oblique, subcordate or round, apex round, margin glandular-denticulate or serrate. Inflorescence a cymose axillary fascicle. Flowers bisexual, greenish-yellow. Fruit a drupe, oblong-globose, yellow or orange when ripe; seeds 1 or 2, compressed.\n\n"
 }
]